      *************************
       IDENTIFICATION DIVISION.
      *************************
 
       PROGRAM-ID. SSRF9E40.
 
       COPY XCWWCRHT.
 
      *****************************************************************
      **  MEMBER :  SSRF9E40                                         **
      **  REMARKS:  MATURITY PAYMENT PROCESSING/                     **
      **            CHANGE TO SINGLE PREMIUM VI                      **
      **                                                             **
      **  DOMAIN :  CV                                               **
      **  CLASS  :  FD                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
23802D**  04APR22  CTS    INITIAL VERSION                            **
23802E**  18APR22  CTS    MATURITY PROCESSING CHANGES                **
23802H**  01JUN22  CTS    MATURITY REVERSAL CHANGES                  **
23802K**  27JUN22  CTS    CHANGES DONE FOR SUL MATURITY VALUATION    **
23802M**  11JUN22  CTS    SUL MATURITY REPORT CHANGES                **
23802R**  06JUL22  CTS    SUL MATURITY ACCOUNTING CHANGES            **
PM0182**  24AUG22  CTS    PMG-182 FIX FOR ERROR ACCTG DURING SINGLE  **
PM0182**                  PREMIUM PROCESSING AND REVERSAL            **
UY3048**  06MAY23  CTS    ENHANCMENT FOR MATURITY DEFERMENT          **
S33534**  12JUL23  CTS    UDS3-3534 JIRA CHANGES FOR UNPAID PREMIUM  **
UY3066**  19OCT23  CTS    CHANGES FOR SAVING RIDER                   **
S11982**  01DEC23  CTS    UDS3-11982 JIRA CHANGES                    **
S12009**  01DEC23  CTS    UDS3-12009 JIRA CHANGES                    **
S43728**  30NOV24  CTS    CHANGES TO RECORD CDSA FOR DEFR INT CAP    **
S49446**  09APR25  CTS    FIX FOR RETROFIT                           **
S50643**  11JUN25  CTS    UDS3-50643 JIRA FIX CHANGES                **
      *****************************************************************
      /
      **********************
       ENVIRONMENT DIVISION.
      **********************
 
      ***************
       DATA DIVISION.
      ***************
 
      *
       WORKING-STORAGE SECTION.
      *
       COPY XCWWPGWS REPLACING '$VAR1' BY 'SSRF9E40'.
      *
       COPY SQLCA.
23802E COPY XCWLPTR.       
  
      *********************************************************
      *   COMMON COPYBOOKS
      *********************************************************
       COPY CCWWINDX.
       COPY XCWWWKDT.
       COPY XCWLDTLK.
UY3048 COPY CCWWPLAN.
      /
      **********************************************************
      * I/O COPYBOOKS
      **********************************************************
       COPY CCFWPH.
       COPY CCFRPH.
      /
       COPY CCFWPD.
       COPY CCFRPD.
      /
23802E COPY CCFWDH.   
23802E COPY CCFRDH.
23802E COPY CCFREDIT.
23802E COPY CCFWEDIT.
23802E COPY CCFWDXFR.
23802E COPY CCFRDXFR.
23802H COPY CCFRPHST.
23802H COPY CCFWPHST.
23802H COPY CCFWPHS3.
23802H COPY CCFRPLRT.
23802H COPY CCFWPLRT.
23802R COPY SCFRFA.
23802R COPY SCFWFA.
UY3048 COPY CCFWSRVH.
UY3048 COPY CCFRSRVH.
UY3048 COPY CCFWLHST.
UY3048 COPY CCFRLHST.
S33534 COPY CCFWCVG.
S33534 COPY CCFRCVG.
23802E/
UY3066 COPY CCFWCFLW.   
UY3066 COPY CCFRCFLW.
UY3066/
S11982 COPY CCFRBNDV.
S11982 COPY CCFWBNDV.
UY3053 COPY CCFWFBN1.
UY3053 COPY CCFWFBNK.
UY3053 COPY CCFRFBNK.
UY3049 COPY CCFRPOLP.
UY3049 COPY CCFWPOLP.
UY3049 COPY CCFWPOL.
UY3049 COPY CCFHPOL.
UY3049 COPY CCFHCVGS.
UY3049 COPY NCFWTTAB.
UY3049 COPY NCFRTTAB.
UY3049 COPY CCFWETAB.
UY3049 COPY CCFRETAB.
UY3049/
      **********************************************************
      * CALLED MODULE PARAMETER INFORMATION
      ********************************************************
       COPY SCWW9E40.
       COPY XCWL1680.
       COPY XCWL1670.
23802H COPY XCWL1660.
       COPY XCWL0289.
       COPY CCWL0186.
       COPY CCWL9215.
       COPY CCWL0182.
       COPY SCWL0500.
UY3109 COPY CCWL5510.
UY3109 COPY CCWL9A79.
UY3109 COPY CCWL9132.
UY3109 COPY CCWL2080.
UY3109 COPY CCWL2180.
23802E COPY CCWL5150. 
23802E COPY CCWL2400.
23802E COPY CCWL9966.
23802E COPY CCWL9308.
23802E COPY CCWL2470.
23802E COPY CCWL2520.
23802E COPY CCWL2435.
23802E COPY CCWL2404.
23802H COPY CCWL4770.
23802H COPY CCWL4780.
23802H COPY CCWL0481.
23802H COPY CCWL1130.
23802H COPY CCWL2095.
23802H COPY CCWLACCT.
23802H COPY CCWWBTAX.
23802H COPY CCWL5200.
23802K COPY CCWL0292.
23802M COPY NCWL0303.
23802M COPY XCWL0290.
23802R COPY CCWL2120.
23802R COPY CCWL2090.
23802R COPY CCWL2190.
23802R COPY CCWL9037.
PM0182 COPY CCWL2185.
PM0182 COPY CCWL4750.
UY3048 COPY CCWL5620.
S33534 COPY CCWL933F.
UY3048 COPY CCWL0682.
UY3048 COPY CCWL2060.
UY3048 COPY CCWL0205.
UY3048 COPY CCWL0201.
UY3048 COPY CCWL1651.
UY3048 COPY CCWLCRCV.
UY3048 COPY CCWL5460.
UY3048 COPY CCWL1415.
UY3048 COPY CCWL1413.
UY3048 COPY CCWL9A69.
UY3066 COPY CCWL9A67.
UY3048 COPY CCWL2153.
UY3048 COPY CCWL2194.
UY3048 COPY CCWL2072.
UY3048 COPY CCWL7410.
UY3048 COPY CCWWNAHD.
S12009 COPY CCWL9D48.
S43728 COPY CCWL2600.
S49446 COPY CCWL9G97.
UY319A COPY CCWL9307.
UY3049 COPY CCWL9E59.
S50643 COPY CCWL0183.
      /
      *****************************************************************
      *  INPUT PARAMETER INFORMATION
      *****************************************************************
      /
      *****************
       LINKAGE SECTION.
      *****************
      
       01  WGLOB-GLOBAL-AREA.
       COPY XCWWGLOB.
       COPY SCWL9E40.
       COPY CCWLPGA.
       COPY CCFRPOL.
       COPY CCWWCVGS.
      /
      ********************
       PROCEDURE DIVISION  USING    WGLOB-GLOBAL-AREA
                                    L9E40-PARM-INFO
                                    LPGA-PARM-INFO
                                    RPOL-REC-INFO
                                    WCVGS-WORK-AREA.
      
      *---------------
       0000-MAIN-LINE.
      *---------------
      
           PERFORM  9E40-0000-MAINLINE
               THRU 9E40-0000-MAINLINE-X.
      
       0000-MAIN-LINE-X.
           GOBACK.
      /
      ***********************************************************
      *    PROCESSING COPYBOOKS
      ***********************************************************
       COPY SCPP9E40.
       COPY CCPPPLIN.
       COPY CCPPPDIN.
       COPY CCPPMIDT.
      /
      ***********************************************************
      *    LINKAGE PROCESSING COPYBOOKS
      ***********************************************************
       COPY CCPS0186.
       COPY CCPL0186.
      /
       COPY CCPS9215.
       COPY CCPL9215.
      /
       COPY CCPS0182.
       COPY CCPL0182.
      /
       COPY XCPL0260.
      /
       COPY XCPL0289.
      /
       COPY XCPL1680.
23802H COPY XCPL1660.
23802E COPY CCPS5150.
23802E COPY CCPL5150. 
23802E COPY CCPS2400.
23802E COPY CCPL2400.
23802E COPY CCPL9966.
23802E COPY CCPS9966.
23802E COPY CCPL9308.
23802E COPY CCPS9308.
23802E COPY CCPBDH.
23802E COPY CCPADH.
23802E COPY CCPCDH.
23802E COPY CCPVDH.
23802E COPY CCPUDH.
23802E COPY CCPNEDIT.
23802E COPY CCPS2470.
23802E COPY CCPL2470.
23802E COPY CCPADXFR.
23802E COPY CCPCDXFR.
23802E COPY CCPFDXFR.
23802E COPY CCPS2520.
23802E COPY CCPL2520.
23802E COPY CCPS2435.
23802E COPY CCPL2435.
23802E COPY CCPS2404.
23802E COPY CCPL2404.
23802H COPY CCPS4770.       
23802H COPY CCPL4770.
23802H COPY CCPS4780.
23802H COPY CCPL4780.
23802H COPY CCPS0481.
23802H COPY CCPL0481.
23802H COPY CCPS1130.
23802H COPY CCPL1130.
23802H COPY CCPS2095.
23802H COPY CCPL2095.
23802H COPY CCPSACCT.
23802H COPY CCPS5200.
23802H COPY CCPL5200.
23802K COPY CCPS0292.
23802K COPY CCPL0292.
23802M COPY XCPL0290.
23802M COPY XCPS0290.
UY3109 COPY CCPS5510.
UY3109 COPY CCPL5510.
UY3109 COPY CCPS9A79.
UY3109 COPY CCPL9A79.
UY3109 COPY CCPS2080.
UY3109 COPY CCPL2080.
UY3109 COPY CCPS2180.
UY3109 COPY CCPL2180.
UY3109 COPY CCPS9132.
UY3109 COPY CCPL9132.
23802M COPY NCPL0303.
23802M COPY NCPS0303.
23802R COPY CCPS2120.
23802R COPY CCPL2120.
23802R COPY CCPL2090.
23802R COPY CCPS2090.
23802R COPY CCPL2190.
23802R COPY CCPS2190.
23802R COPY CCPL9037.
23802R COPY CCPS9037.
23802R COPY SCPBFA.
PM0182 COPY CCPL2185.
PM0182 COPY CCPS2185.
PM0182 COPY CCPS4750.
PM0182 COPY CCPL4750.
UY3048 COPY CCPS5620.
UY3048 COPY CCPL5620.
S33534 COPY CCPS933F.
S33534 COPY CCPL933F.
UY3048 COPY CCPL0682.
UY3048 COPY CCPS0682.
UY3048 COPY CCPS2060.
UY3048 COPY CCPL2060.
UY3048 COPY CCPS1651.
UY3048 COPY CCPL1651.
UY3048 COPY CCPLCRCV.
UY3048 COPY CCPSCRCV.
UY3048 COPY CCPS0205.
UY3048 COPY CCPL0205.
UY3048 COPY CCPL0201.
UY3048 COPY CCPS5460.
UY3048 COPY CCPL5460.
UY3048 COPY CCPS1415.
UY3048 COPY CCPL1415.
UY3048 COPY CCPS1413.
UY3048 COPY CCPL1413.
UY3048 COPY CCPS9A69.
UY3048 COPY CCPL9A69.
UY3066 COPY CCPS9A67.
UY3066 COPY CCPL9A67.
S12009 COPY CCPS9D48.
S12009 COPY CCPL9D48.
UY3048 COPY CCPS2153.
UY3048 COPY CCPS2194.
UY3048 COPY CCPS2072.
UY3048 COPY CCPL2153.
UY3048 COPY CCPL2194.
UY3048 COPY CCPL2072.
UY3048 COPY CCPL7410.
UY3048 COPY CCPS7410.
S49446 COPY CCPS9G97.
S49446 COPY CCPL9G97.
S43728 COPY CCPS2600.
S43728 COPY CCPL2600.     
UY319A COPY CCPS9307.
UY319A COPY CCPL9307.
UY3049 COPY CCPS9E59.
UY3049 COPY CCPL9E59.
S50643 COPY CCPS0183.
S50643 COPY CCPL0183.
      /
      ***********************************************************
      *    FILE I/O PROCESS MODULES
      ***********************************************************
       COPY CCPNPH.
       COPY CCPNPD.
23802H COPY CCPBPHST.
23802H COPY CCPVPHST.
23802H COPY CCPVPHS3.
UY3048 COPY CCPVSRVH.
UY3048 COPY CCPVLHST.
S33534 COPY CCPNCVG.
S33534 COPY NCPPCVGS.
UY3066 COPY CCPVCFLW.
UY3048 COPY CCPBBNDV.
UY3048 COPY CCPCBNDV.
UY3048 COPY CCPFBNDV.
UY3048 COPY CCPABNDV.
UY3048 COPY CCPUBNDV.
UY3048 COPY CCPBFBN1.
UY3048 COPY CCPAFBNK.
UY3048 COPY CCPBFBNK.
UY3048 COPY CCPCFBNK.
UY3048 COPY CCPUFBNK.
UY3049 COPY CCPNPOLP.
UY3049 COPY CCPUPOLP.
UY3049 COPY CCPNPOL.
UY3049 COPY NCPNTTAB.
UY3049 COPY CCPEPRSM.
UY3049 COPY CCPBETAB.
      /      
      ***********************************************************
      *    ERROR HANDLING ROUTINES
      ***********************************************************      
       COPY XCPL0030.
      *
      *****************************************************************
      **                 END OF PROGRAM SSRF9E40                     **
      *****************************************************************
      