      **************************
       IDENTIFICATION DIVISION.
      **************************
 
       PROGRAM-ID. XSDU1680.
 
       COPY XCWWCRHT.
 
      *****************************************************************
      **  MEMBER :  XSDU1680                                         **
      **  REMARKS:  COMPUTATION ROUTINES FOR DATE CONVERSION UTILITY **
      **                                                             **
      **  DOMAIN :  SY                                               **
      **  CLASS  :  UT                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
      **  28AUG89         CREATED FOR NBS                            **
53-062**  30NOV95  VK     ADD WORKING STORAGE COPYBOOK XCWWPGWS      **
54-001**  01SEP96  GJR    MODIFICATIONS FOR MAINTAINABILITY          **
557660**  30SEP97  CG     CHANGE TO STANDARD                         **
005409**  30OCT98  56     MODIFICATIONS FOR LEAP YEAR                **
010311**  30OCT98  56     CODE CLEANUP AND STANDARDIZATION           **
      *****************************************************************
      /
      **********************
       ENVIRONMENT DIVISION.
      **********************
 
      ***************
       DATA DIVISION.
      ***************
 
       WORKING-STORAGE SECTION.
 
53-062 COPY XCWWPGWS REPLACING '$VAR1' BY 'XSDU1680'.
       COPY XCWTDTTB.
       COPY XCWWWKDT.
      /
      *****************
       LINKAGE SECTION.
      *****************
 
       COPY XCWLDTLK.
       COPY XCWL1680.
       COPY XCWL1670.
 
      /
       PROCEDURE DIVISION USING LDTLK-PARM-INFO
                                L1680-PARM-INFO
                                L1670-PARM-INFO.
 
      *--------------
       0000-MAINLINE.
      *--------------
 
           SET LDTLK-VALID                    TO TRUE.
           SET L1680-RETRN-OK                 TO TRUE.
 
005409*    IF  L1680-LEAP-YEAR-VALID
005409*        CONTINUE
005409*    ELSE
005409*        SET L1680-DO-NOT-USE-LEAP-YEAR TO TRUE
005409*    END-IF.
 
005409*    MOVE L1680-LEAP-YEAR-SW            TO LDTLK-LEAP-YEAR-SW.
 
           PERFORM  1000-PROCESS-DATE
               THRU 1000-PROCESS-DATE-X.
 
           MOVE LDTLK-VALID-SW                TO L1680-VALID-SW.
 
       0000-MAINLINE-X.
           GOBACK.
      /
      *------------------
       1000-PROCESS-DATE.
      *------------------
 
           IF  L1680-COMPUTE-DAYS-BETWEEN
               PERFORM  2000-DAYS-BETWEEN
                   THRU 2000-DAYS-BETWEEN-X
               GO TO 1000-PROCESS-DATE-X
           END-IF.
 
           MOVE WWKDT-ZERO-DT TO L1680-INTERNAL-2.
 
005409     IF L1680-INTERNAL-1 = WWKDT-ZERO-DT
005409         MOVE WWKDT-ZERO-DT TO L1680-INTERNAL-2
005409         GO TO 1000-PROCESS-DATE-X
005409     END-IF.
005409     IF L1680-INTERNAL-1 = WWKDT-LOW-DT
005409         MOVE WWKDT-LOW-DT  TO L1680-INTERNAL-2
005409         GO TO 1000-PROCESS-DATE-X
005409     END-IF.
005409     IF L1680-INTERNAL-1 = WWKDT-HIGH-DT
005409         MOVE WWKDT-HIGH-DT TO L1680-INTERNAL-2
005409         GO TO 1000-PROCESS-DATE-X
005409     END-IF.
 
           EVALUATE TRUE
 
               WHEN L1680-ADD-Y-M-D
                    PERFORM  3000-ADD-Y-M-D
                        THRU 3000-ADD-Y-M-D-X
 
               WHEN L1680-SUBTRACT-Y-M-D
                    PERFORM  4000-SUBTRACT-Y-M-D
                        THRU 4000-SUBTRACT-Y-M-D-X
 
               WHEN L1680-ADD-M
                    PERFORM  5000-ADD-M
                        THRU 5000-ADD-M-X
 
               WHEN L1680-SUBTRACT-M
                    PERFORM  6000-SUBTRACT-M
                        THRU 6000-SUBTRACT-M-X
 
               WHEN OTHER
                    SET LDTLK-NOT-VALID             TO TRUE
                    SET L1680-RETRN-INVALID-REQUEST TO TRUE
 
           END-EVALUATE.
 
       1000-PROCESS-DATE-X.
           EXIT.
      /
      *------------------
       2000-DAYS-BETWEEN.
      *------------------
 
      *****************************************************************
      * THIS ROUTINE WILL CALCULATE THE NUMBER OF DAYS THAT ARE
      * BETWEEN TWO DATES:  L1680-INTERNAL-1 AND L1680-INTERNAL-2.
      * THE ROUTINE WILL RETURN THE RESULT IN
      * L1680-TOTAL-DAYS. THIS WILL BE POSITIVE IF
      * L1680-INTERNAL-2 IS GREATER THAN L1680-INTERNAL-1.
      *****************************************************************
 
           MOVE ZERO               TO L1680-NUMBER-OF-YEARS.
           MOVE ZERO               TO L1680-NUMBER-OF-MONTHS.
           MOVE ZERO               TO L1680-NUMBER-OF-DAYS.
           MOVE ZERO               TO L1680-TOTAL-DAYS.
005409     MOVE ZERO               TO LDTLK-DAYS-FACTOR.
005409     MOVE ZERO               TO LDTLK-DAYS-IN-YEAR.
 
           IF  L1680-INTERNAL-2 < L1680-INTERNAL-1
               SET L1680-DATES-NOT-IN-ORDER TO TRUE
               PERFORM  2100-SWITCH-DATES
                   THRU 2100-SWITCH-DATES-X
           ELSE
               SET L1680-DATES-IN-ORDER TO TRUE
           END-IF.
 
           PERFORM  2200-DAYS-BETWEEN-CALC
               THRU 2200-DAYS-BETWEEN-CALC-X.
 
           IF  L1680-DATES-NOT-IN-ORDER
               COMPUTE L1680-TOTAL-DAYS       =
                       L1680-TOTAL-DAYS         *  -1
               COMPUTE L1680-NUMBER-OF-YEARS  =
                       L1680-NUMBER-OF-YEARS    *  -1
               COMPUTE L1680-NUMBER-OF-MONTHS =
                       L1680-NUMBER-OF-MONTHS   *  -1
               COMPUTE L1680-NUMBER-OF-DAYS   =
                       L1680-NUMBER-OF-DAYS     *  -1
005409         COMPUTE LDTLK-DAYS-FACTOR      =
005409                 LDTLK-DAYS-FACTOR        *  -1
               PERFORM  2100-SWITCH-DATES
                   THRU 2100-SWITCH-DATES-X
           END-IF.
 
       2000-DAYS-BETWEEN-X.
           EXIT.
 
      *------------------
       2100-SWITCH-DATES.
      *------------------
 
           MOVE L1680-INTERNAL-2   TO LDTLK-DATE-2.
           MOVE L1680-INTERNAL-1   TO L1680-INTERNAL-2.
           MOVE LDTLK-DATE-2       TO L1680-INTERNAL-1.
 
       2100-SWITCH-DATES-X.
           EXIT.
      /
      *-----------------------
       2200-DAYS-BETWEEN-CALC.
      *-----------------------
 
005409*    MOVE LDTLK-LEAP-YEAR-SW TO LDTLK-SAVE-LEAP-SW.
005409*    MOVE LDTLK-LEAP-YEAR-SW TO L1670-LEAP-YEAR-SW.
           MOVE L1680-INTERNAL-1   TO L1670-INTERNAL-DATE.
 
           PERFORM  1670-2000-INTERNAL-YYYYDDD
               THRU 1670-2000-INTERNAL-YYYYDDD-X.
 
005409*    MOVE LDTLK-SAVE-LEAP-SW TO LDTLK-LEAP-YEAR-SW.
 
           IF  L1670-NOT-VALID
               GO TO 2200-DAYS-BETWEEN-CALC-X
           END-IF.
 
           MOVE L1670-YYYY-1       TO LDTLK-JUL2-CCYY.
           MOVE L1670-DDD-1        TO LDTLK-JUL2-DDD.
 
005409*    MOVE LDTLK-LEAP-YEAR-SW TO LDTLK-SAVE-LEAP-SW.
005409*    MOVE LDTLK-LEAP-YEAR-SW TO L1670-LEAP-YEAR-SW.
           MOVE L1680-INTERNAL-2   TO L1670-INTERNAL-DATE.
 
           PERFORM  1670-2000-INTERNAL-YYYYDDD
               THRU 1670-2000-INTERNAL-YYYYDDD-X.
 
005409*    MOVE LDTLK-SAVE-LEAP-SW TO LDTLK-LEAP-YEAR-SW.
 
           IF  L1670-NOT-VALID
               GO TO 2200-DAYS-BETWEEN-CALC-X
           END-IF.
 
           MOVE L1670-YYYY-1       TO LDTLK-JUL1-CCYY.
           MOVE L1670-DDD-1        TO LDTLK-JUL1-DDD.
 
           COMPUTE LDTLK-YEARS = LDTLK-JUL1-CCYY - LDTLK-JUL2-CCYY.
 
005409*** LDTLK-YEARS WILL BE ZERO WHEN THE TWO DATES OCCUR IN THE
005409*** SAME CALENDAR YEAR (IE. LESS THAN A FULL YEAR)
 
           IF  LDTLK-YEARS = ZERO
005409         MOVE 1              TO L1680-YEAR-SUB
               COMPUTE L1680-TOTAL-DAYS
                                      = LDTLK-JUL1-DDD - LDTLK-JUL2-DDD
005409         MOVE LDTLK-JUL2-CCYY        TO LDTLK-LEAP-YEAR
005409         PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409             THRU LEAP-0100-EDIT-LEAP-YEAR-X
 
005409*      TO CALCULATE DAYS IN A YEAR:
005409*      IF IT'S A LEAP YEAR, AND THE FROM-DATE IS FEB 29TH AND
005409*      GREATER, THEN USE 365 DAYS;  IF THE TO-DATE IS UP TO AND
005409*      INCLUDING FEB 28TH, THEN USE 365 DAYS
005409*      (BASICALLY, IF FEB 29TH FALLS IN THE PERIOD, OR IS THE
005409*      TO-DATE, THEN WE WILL USE 366 DAYS IN A YEAR)
 
005409         IF LDTLK-IS-LEAP-YEAR
005409             IF LDTLK-JUL2-DDD > 59
005409                 MOVE +365  TO LDTLK-DAYS-IN-YEAR
005409             END-IF
005409             IF LDTLK-JUL1-DDD < 60
005409                 MOVE +365  TO LDTLK-DAYS-IN-YEAR
005409         END-IF
 
005409         COMPUTE LDTLK-DAYS-FACTOR ROUNDED =
005409                     L1680-TOTAL-DAYS / LDTLK-DAYS-IN-YEAR
005409         MOVE LDTLK-DAYS-IN-YEAR TO
005409                     LDTLK-DAYS-IN-YEAR-ARRAY (L1680-YEAR-SUB)
 
005409         MOVE L1680-TOTAL-DAYS   TO LDTLK-DAYS-REMAINING
 
               PERFORM  9000-COMPUTE-YY-MM-DD
                   THRU 9000-COMPUTE-YY-MM-DD-X
               GO TO 2200-DAYS-BETWEEN-CALC-X
           END-IF.
 
005409*** LDTLK-YEARS WILL BE = 1 AND THE TO DATE IS NOT GREATER
005409*** THAN THE FROM DATE (IE. IT IS LESS THAN OR EQUAL TO ONE
005409*** FULL YEAR)
 
           IF  LDTLK-YEARS = 1
005409*    AND LDTLK-JUL1-DDD > LDTLK-JUL2-DDD
005409     AND LDTLK-JUL1-DDD NOT > LDTLK-JUL2-DDD
005409         MOVE 1                      TO L1680-YEAR-SUB
               MOVE LDTLK-JUL2-CCYY        TO LDTLK-LEAP-YEAR
 
005409*        IF  LDTLK-USE-LEAP-YEAR
005409*            MOVE LDTLK-LEAP-YEAR-SW TO LDTLK-SAVE-LEAP-SW
005409*            PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409*                THRU LEAP-0100-EDIT-LEAP-YEAR-X
005409*            PERFORM  2300-CALC-LEAP-TOTAL-DAYS
005409*                THRU 2300-CALC-LEAP-TOTAL-DAYS-X
005409*        ELSE
005409*            COMPUTE L1680-TOTAL-DAYS =
005409*                         LDTLK-JUL1-DDD + (365 - LDTLK-JUL2-DDD)
005409*        END-IF
 
005409         PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409             THRU LEAP-0100-EDIT-LEAP-YEAR-X
005409         PERFORM  2300-CALC-LEAP-TOTAL-DAYS
005409             THRU 2300-CALC-LEAP-TOTAL-DAYS-X
 
005409         MOVE L1680-TOTAL-DAYS   TO LDTLK-DAYS-REMAINING
 
005409*      TO CALCULATE DAYS IN A YEAR:
005409*      IF THE FROM-YEAR IS A LEAP YEAR, AND THE FROM-DATE IS
005409*      FEB 29TH OR GREATER, THEN USE 365 DAYS;  OTHERWISE USE
005409*      366 DAYS.
005409*      IF THE TO-YEAR IS A LEAP YEAR, AND THE TO-DATE IS FEB 29TH
005409*      OR GREATER, THEN USE 366 DAYS;  OTHERWISE USE 365.
005409*      (BASICALLY, IF FEB 29TH FALLS IN THE PERIOD, OR IS THE
005409*      TO-DATE, THEN WE WILL USE 366 DAYS IN A YEAR)
 
005409         IF LDTLK-IS-LEAP-YEAR
005409             IF LDTLK-JUL2-DDD > 59
005409                 MOVE +365       TO LDTLK-DAYS-IN-YEAR
005409             END-IF
005409         END-IF
005409         IF LDTLK-USE-LEAP-YEAR-FOR-DAYS
005409             IF LDTLK-JUL1-DDD > 59
005409                 MOVE +366       TO LDTLK-DAYS-IN-YEAR
005409             END-IF
005409         END-IF
 
005409         MOVE LDTLK-DAYS-IN-YEAR
005409                     TO LDTLK-DAYS-IN-YEAR-ARRAY (L1680-YEAR-SUB)
005409         COMPUTE LDTLK-DAYS-FACTOR ROUNDED = L1680-TOTAL-DAYS /
005409                     LDTLK-DAYS-IN-YEAR
 
54-001         PERFORM  9000-COMPUTE-YY-MM-DD
54-001             THRU 9000-COMPUTE-YY-MM-DD-X
54-001         GO TO 2200-DAYS-BETWEEN-CALC-X
           END-IF.
 
005409*** THE FOLLOWING LOGIC WILL BE EXECUTED WHEN THERE IS MORE THAN
005409*** ONE YEAR'S DIFFERENCE BETWEEN THE TWO DATES (IE. COULD BE
005409*** ONE YEAR AND A BIT, OR MANY YEARS INBETWEEN)
 
           MOVE LDTLK-JUL2-CCYY                TO LDTLK-LEAP-YEAR.
 
005409*    IF  LDTLK-USE-LEAP-YEAR
005409*        MOVE LDTLK-LEAP-YEAR-SW         TO LDTLK-SAVE-LEAP-SW
005409*        PERFOM   LEAP-0100-EDIT-LEAP-YEAR
005409*            THRU LEAP-0100-EDIT-LEAP-YEAR-X
005409*        IF  LDTLK-USE-LEAP-YEAR
005409*            MOVE LDTLK-SAVE-LEAP-SW     TO LDTLK-LEAP-YEAR-SW
005409*            COMPUTE L1680-TOTAL-DAYS =
005409*                         LDTLK-JUL1-DDD + (366 - LDTLK-JUL2-DDD)
005409*        ELSE
005409*            MOVE LDTLK-SAVE-LEAP-SW     TO LDTLK-LEAP-YEAR-SW
005409*            COMPUTE L1680-TOTAL-DAYS =
005409*                         LDTLK-JUL1-DDD + (365 - LDTLK-JUL2-DDD)
005409*        END-IF
005409*        PERFORM  2300-CALC-LEAP-TOTAL-DAYS
005409*            THRU 2300-CALC-LEAP-TOTAL-DAYS-X
005409*    ELSE
005409*        COMPUTE L1680-TOTAL-DAYS =
005409*                         LDTLK-JUL1-DDD + (365 - LDTLK-JUL2-DDD)
005409*    END-IF.
 
005409** THE FOLLOWING LINES CALCULATE THE TOTAL DAYS BETWEEN TWO DATES,
005409** WITHOUT TAKING INTO ACCOUNT ANY LEAP YEARS, BY REFERENCING THE
005409** FIRST ENTRY IN TDTTB -- WHICH ASSUMES NO LEAP YEAR.
005409** THE LEAP YEAR DAYS ARE ADDED IN AFTERWARDS.
005409****   A) MOVE THE TO-MONTH AND DAY VALUE TO TOTAL DAYS.
005409     COMPUTE L1680-TOTAL-DAYS =
005409                   TDTTB-DAYS-TO-MONTH (L1680-INT-MM-2, 1).
005409     COMPUTE L1680-TOTAL-DAYS = L1680-TOTAL-DAYS + L1680-INT-DD-2.
005409****   B) ADD TO IT (365 - THE FROM MONTH AND DAYS).
005409     COMPUTE L1680-TOTAL-DAYS = L1680-TOTAL-DAYS + (365 -
005409                   TDTTB-DAYS-TO-MONTH (L1680-INT-MM-1, 1) -
005409                   L1680-INT-DD-1).
 
005409****   C) ADD IN THE FULL YEARS OCCURRING INBETWEEN.
           SUBTRACT 1 FROM LDTLK-YEARS.
           COMPUTE L1680-TOTAL-DAYS = L1680-TOTAL-DAYS +
                                (365 * LDTLK-YEARS).
005409** END OF CALCULATIONS USING 365 DAYS IN A YEAR.
 
005409*    ADD 1, LDTLK-JUL2-CCYY GIVING LDTLK-LEAP-YEAR.
005409*    IF  LDTLK-USE-LEAP-YEAR
005409*        PERFORM  2500-COMP-NO-OF-LEAPS
005409*            THRU 2500-COMP-NO-OF-LEAPS-X
005409*            VARYING LDTLK-LEAP-YEAR FROM LDTLK-LEAP-YEAR BY 1
005409*            UNTIL   LDTLK-LEAP-YEAR = LDTLK-JUL1-CCYY
005409*    END-IF.
 
005409     MOVE 1                  TO L1680-YEAR-SUB.
005409     ADD 1, LDTLK-JUL1-CCYY GIVING L1680-JUL1-CCYY-PLUS1.
 
005409** DETERMINE THE NUMBER OF LEAP YEARS OCCURRING BETWEEN THE
005409** TWO DATES AND INCREMENT THE TOTAL DAYS -- AS WELL AS
005409** BUILD THE DAYS IN YEAR ARRAY FOR EACH YEAR BETWEEN THE
005409** FROM DATE AND THE TO DATE.
005409     INITIALIZE LDTLK-DAYS-IN-YEAR-ARRAY-TAB.
005409     PERFORM  2500-COMP-NO-OF-LEAPS
005409         THRU 2500-COMP-NO-OF-LEAPS-X
005409         VARYING LDTLK-LEAP-YEAR FROM LDTLK-LEAP-YEAR BY 1
005409         UNTIL LDTLK-LEAP-YEAR = L1680-JUL1-CCYY-PLUS1.
 
005409** LOOP THRU THE DAYS IN YEAR ARRAY BUILT ABOVE, TO CALCULATE
005409** THE DAYS FACTOR.
005409     MOVE L1680-TOTAL-DAYS   TO LDTLK-DAYS-REMAINING.
005409     MOVE ZERO               TO LDTLK-DAYS-FACTOR.
005409     PERFORM  2400-DETERMINE-FACTOR
005409         THRU 2400-DETERMINE-FACTOR-X
005409         VARYING L1680-YEAR-SUB FROM 1 BY 1
005409         UNTIL LDTLK-DAYS-REMAINING = ZERO.
 
           PERFORM  9000-COMPUTE-YY-MM-DD
               THRU 9000-COMPUTE-YY-MM-DD-X.
 
       2200-DAYS-BETWEEN-CALC-X.
           EXIT.
      /
54-001*--------------------------
54-001 2300-CALC-LEAP-TOTAL-DAYS.
54-001*---------------------------
54-001
005409*    IF  LDTLK-USE-LEAP-YEAR
005409     IF  LDTLK-IS-LEAP-YEAR
005409*        MOVE LDTLK-SAVE-LEAP-SW TO LDTLK-LEAP-YEAR-SW
54-001         COMPUTE L1680-TOTAL-DAYS =
54-001                 LDTLK-JUL1-DDD + (366 - LDTLK-JUL2-DDD)
54-001     ELSE
54-001*        MOVE LDTLK-SAVE-LEAP-SW TO LDTLK-LEAP-YEAR-SW
54-001         COMPUTE L1680-TOTAL-DAYS =
54-001                  LDTLK-JUL1-DDD + (365 - LDTLK-JUL2-DDD)
54-001     END-IF.
54-001
54-001 2300-CALC-LEAP-TOTAL-DAYS-X.
54-001     EXIT.
      /
005409*----------------------
005409 2400-DETERMINE-FACTOR.
005409*----------------------
 
005409     IF LDTLK-DAYS-IN-YEAR-ARRAY (L1680-YEAR-SUB) = 366
005409         IF LDTLK-DAYS-REMAINING < 366
005409             COMPUTE LDTLK-DAYS-FACTOR ROUNDED
005409                     = LDTLK-DAYS-FACTOR
005409                     + (LDTLK-DAYS-REMAINING / 366)
005409             COMPUTE LDTLK-DAYS-REMAINING = 0
005409         ELSE
005409             COMPUTE LDTLK-DAYS-FACTOR ROUNDED
005409                     = LDTLK-DAYS-FACTOR + 1
005409             COMPUTE LDTLK-DAYS-REMAINING
005409                     = LDTLK-DAYS-REMAINING - 366
005409         END-IF
005409     ELSE
005409         IF LDTLK-DAYS-REMAINING < 365
005409             COMPUTE LDTLK-DAYS-FACTOR ROUNDED
005409                     = LDTLK-DAYS-FACTOR
005409                     + (LDTLK-DAYS-REMAINING / 365)
005409             COMPUTE LDTLK-DAYS-REMAINING = 0
005409         ELSE
005409             COMPUTE LDTLK-DAYS-FACTOR ROUNDED
005409                     = LDTLK-DAYS-FACTOR + 1
005409             COMPUTE LDTLK-DAYS-REMAINING
                           = LDTLK-DAYS-REMAINING - 365
005409         END-IF
005409     END-IF.
 
005409 2400-DETERMINE-FACTOR-X.
005409     EXIT.
 
      *----------------------
       2500-COMP-NO-OF-LEAPS.
      *----------------------
 
      *****************************************************************
      * THIS ROUTINE WILL COMPUTE THE NUMBER OF LEAP YEARS THAT HAVE
      * ELAPSED BETWEEN TWO YEARS.  THIS IS USED TO COMPUTE THE ACTUAL
      * NUMBER OF DAYS BETWEEN TWO DATES.
      *****************************************************************
 
           PERFORM  LEAP-0100-EDIT-LEAP-YEAR
               THRU LEAP-0100-EDIT-LEAP-YEAR-X.
 
005409*    IF  LDTLK-USE-LEAP-YEAR
005409     IF  LDTLK-IS-LEAP-YEAR
005409**     WHEN YEAR IS A LEAP YEAR, AND YEAR NOT = TO THE TO-YEAR,
005409**     AND YEAR NOT = TO THE FROM-YEAR, THEN INCREMENT THE
005409**     TOTAL DAYS TO INCLUDE THE LEAP DAY.
005409         IF  LDTLK-LEAP-YEAR NOT = LDTLK-JUL1-CCYY
005409         AND LDTLK-LEAP-YEAR NOT = LDTLK-JUL2-CCYY
                   ADD 1           TO L1680-TOTAL-DAYS
005409         END-IF
005409**     WHEN YEAR IS A LEAP YEAR, AND YEAR = THE FROM-YEAR,
005409**     AND FROM-DAYS < 61 (WHICH INCLUDES JANUARY 1ST TO
005409**     FEBRUARY 29TH), THEN INCREMENT THE TOTAL DAYS TO INCLUDE
005409**     THE LEAP DAY.
005409         IF  LDTLK-LEAP-YEAR = LDTLK-JUL2-CCYY
005409         AND LDTLK-JUL2-DDD < 61
005409             ADD 1           TO L1680-TOTAL-DAYS
005409         END-IF
005409**     WHEN YEAR IS A LEAP YEAR, AND YEAR = THE TO-YEAR, AND
005409**     THE TO-DAYS > 60 (WHICH INCLUDES MARCH 1ST AND ONWARD),
005409**     THEN INCREMEMT THE TOTAL DAYS TO INCLUDE THE LEAP DAY.
005409         IF  LDTLK-LEAP-YEAR = LDTLK-JUL1-CCYY
005409         AND LDTLK-JUL1-DDD > 60
005409             ADD 1           TO L1680-TOTAL-DAYS
005409         END-IF
           END-IF.
 
005409*   TO CALCULATE DAYS IN A YEAR:
005409*     IF THE YEAR IS NOT EQUAL TO THE TO-YEAR
005409*         IF THE YEAR IS A LEAP YEAR
005409*             IF THE FROM-DAYS IS FEB 29TH OR GREATER
005409*                --> THEN USE 365 DAYS; OTHERWISE USE 366 DAYS
005409*         IF THE NEXT YEAR IS A LEAP YEAR
005409*             IF THE FROM-DAYS IS FEB 29TH OR GREATER
005409*                --> THEN USE 366 DAYS; OTHERWISE USE 365 DAYS
005409
005409     IF LDTLK-LEAP-YEAR NOT = LDTLK-JUL1-CCYY
005409         IF  LDTLK-IS-LEAP-YEAR
005409         AND LDTLK-JUL2-DDD > 59
005409             MOVE +365       TO LDTLK-DAYS-IN-YEAR
005409         END-IF
005409         IF  LDTLK-USE-LEAP-YEAR-FOR-DAYS
005409         AND LDTLK-JUL2-DDD > 59
005409             MOVE +366       TO LDTLK-DAYS-IN-YEAR
005409         END-IF
005409     END-IF.
005409
005409*     IF THE YEAR IS EQUAL TO THE TO-YEAR (THE LAST TABLE ENTRY)
005409*         IF THE FROM-MONTH IS > THE TO-MONTH
005409*            --> GO TO EXIT
005409*         IF THE FROM-DAY IS >= THE TO-DAY
005409*            --> GO TO EXIT
005409*         OTHERWISE THERE ARE SOME DAYS LEFT OVER.
005409*     IF THE YEAR IS A LEAP YEAR
005409*         IF THE TO-DAYS IS MARCH 1ST OR GREATER
005409*            --> THEN USE 365 DAYS
005409
005409     IF  LDTLK-LEAP-YEAR = LDTLK-JUL1-CCYY
005409         IF L1680-INT-MM-1 > L1680-INT-MM-2
005409             GO TO 2500-COMP-NO-OF-LEAPS-X
005409         END-IF
005409         IF L1680-INT-DD-2 NOT >  L1680-INT-DD-1
005409             GO TO 2500-COMP-NO-OF-LEAPS-X
005409         END-IF
005409         IF  LDTLK-IS-LEAP-YEAR
005409         AND L1680-INT-MM-2 > 2
005409             MOVE +365       TO LDTLK-DAYS-IN-YEAR
005409         END-IF
005409     END-IF.
005409
005409     MOVE LDTLK-DAYS-IN-YEAR
005409                    TO LDTLK-DAYS-IN-YEAR-ARRAY (L1680-YEAR-SUB).
005409     ADD 1          TO L1680-YEAR-SUB.
 
       2500-COMP-NO-OF-LEAPS-X.
           EXIT.
      /
      *---------------
       3000-ADD-Y-M-D.
      *---------------
 
      *****************************************************************
      * THIS ROUTINE WILL ADD TO L1680-INTERNAL-1 THE
      * FIELDS 1680-NUMBER-OF-YEARS, 1680-NUMBER-OF-MONTHS AND
      * L1680-NUMBER-OF-DAYS.  THE RESULT OF THE COMPUTATION
      * IS STORED IN L1680-INTERNAL-2.
      *****************************************************************
 
           IF  L1680-NUMBER-OF-YEARS NUMERIC
               CONTINUE
           ELSE
               SET LDTLK-NOT-VALID TO TRUE
               GO TO 3000-ADD-Y-M-D-X
           END-IF.
 
           IF  L1680-NUMBER-OF-MONTHS NUMERIC
               CONTINUE
           ELSE
               SET LDTLK-NOT-VALID TO TRUE
               GO TO 3000-ADD-Y-M-D-X
           END-IF.
 
           IF  L1680-NUMBER-OF-DAYS NUMERIC
               CONTINUE
           ELSE
               SET LDTLK-NOT-VALID TO TRUE
               GO TO 3000-ADD-Y-M-D-X
           END-IF.
 
           MOVE L1680-INT-DD-1 TO L1680-INT-DD-2.
           COMPUTE L1680-INT-YYYY-2 =
               L1680-INT-YYYY-1 + L1680-NUMBER-OF-YEARS.
           COMPUTE LDTLK-MONTHS =
               L1680-INT-MM-1 + L1680-NUMBER-OF-MONTHS.
           DIVIDE LDTLK-MONTHS BY 12
               GIVING LDTLK-YEARS
               REMAINDER L1680-INT-MM-2.
           COMPUTE L1680-INT-YYYY-2 =
               L1680-INT-YYYY-2 + LDTLK-YEARS.
 
           IF  L1680-INT-MM-2 = ZERO
               ADD 12          TO L1680-INT-MM-2
               SUBTRACT 1 FROM L1680-INT-YYYY-2
           END-IF.
 
           IF  L1680-INT-DD-2 < 29
               CONTINUE
           ELSE
               PERFORM  3100-REDUCE-DAYS-IN-MTH
                   THRU 3100-REDUCE-DAYS-IN-MTH-X
           END-IF.
 
      *
      * THE FOLLOWING LINES ARE TO IMPROVE PERFORMANCE, SINCE
      * ADMIN OFTEN ADDS A WHOLE NUMBER OF MONTHS.
      *
           IF  L1680-NUMBER-OF-DAYS = ZERO
               GO TO 3000-ADD-Y-M-D-X
           END-IF.
 
           MOVE L1680-INTERNAL-2      TO L1670-INTERNAL-DATE.
 
           PERFORM  1670-2000-INTERNAL-YYYYDDD
               THRU 1670-2000-INTERNAL-YYYYDDD-X.
 
           IF  L1670-NOT-VALID
               MOVE L1670-VALID-SW    TO LDTLK-VALID-SW
               GO TO 3000-ADD-Y-M-D-X
           END-IF.
 
           MOVE L1670-JULIAN-DATE-R-1 TO LDTLK-JUL-1.
           ADD L1680-NUMBER-OF-DAYS LDTLK-JUL1-DDD GIVING
                  LDTLK-TOTAL-DAYS.
 
557660     PERFORM  3200-RED-DAYS-BELOW-MAX
557660         THRU 3200-RED-DAYS-BELOW-MAX-X.
 
           MOVE LDTLK-JUL-1           TO L1670-JULIAN-DATE-R-1.
           PERFORM  1670-6000-YYYYDDD-INTERNAL
               THRU 1670-6000-YYYYDDD-INTERNAL-X.
 
           IF  L1670-NOT-VALID
               MOVE L1670-VALID-SW    TO LDTLK-VALID-SW
               GO TO 3000-ADD-Y-M-D-X
           END-IF.
 
           MOVE L1670-INTERNAL-DATE   TO L1680-INTERNAL-2.
 
       3000-ADD-Y-M-D-X.
           EXIT.
      /
      *------------------------
       3100-REDUCE-DAYS-IN-MTH.
      *------------------------
 
           MOVE L1680-INT-MM-2             TO LDTLK-MM-SUB.
 
005409*    IF  LDTLK-USE-LEAP-YEAR
005409*        MOVE LDTLK-LEAP-YEAR-SW     TO LDTLK-SAVE-LEAP-SW
005409*        MOVE L1680-INT-YYYY-2       TO LDTLK-LEAP-YEAR
005409*        PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409*            THRU LEAP-0100-EDIT-LEAP-YEAR-X
005409*        IF  LDTLK-USE-LEAP-YEAR
005409*            MOVE LDTLK-SAVE-LEAP-SW TO LDTLK-LEAP-YEAR-SW
005409*            MOVE 2                  TO LDTLK-LEAP-SUB
005409*        ELSE
005409*            MOVE LDTLK-SAVE-LEAP-SW TO LDTLK-LEAP-YEAR-SW
005409*            MOVE 1                  TO LDTLK-LEAP-SUB
005409*        END-IF
005409*    ELSE
005409*        MOVE 1                      TO LDTLK-LEAP-SUB
005409*    END-IF.
 
005409     MOVE L1680-INT-YYYY-2          TO LDTLK-LEAP-YEAR.
005409     PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409         THRU LEAP-0100-EDIT-LEAP-YEAR-X.
 
005409     IF LDTLK-IS-LEAP-YEAR
005409         MOVE +2                    TO LDTLK-LEAP-SUB
005409     ELSE
005409         MOVE +1                    TO LDTLK-LEAP-SUB
005409     END-IF.
 
           IF  L1680-INT-DD-2 >
                      TDTTB-DAYS-IN-MONTH (LDTLK-MM-SUB, LDTLK-LEAP-SUB)
               MOVE TDTTB-DAYS-IN-MONTH (LDTLK-MM-SUB, LDTLK-LEAP-SUB)
                                           TO L1680-INT-DD-2
           END-IF.
 
       3100-REDUCE-DAYS-IN-MTH-X.
           EXIT.
 
      *------------------------
557660 3200-RED-DAYS-BELOW-MAX.
      *------------------------
 
      *****************************************************************
      * THIS ROUTINE WILL REDUCE THE JULIAN DAYS FIELD BELOW 365 OR
      * 366 DEPENDING ON LEAP YEAR USE.
      *****************************************************************
 
005409*    IF  LDTLK-DO-NOT-USE-LEAP-YEAR
005409*        IF  LDTLK-TOTAL-DAYS > 365
005409*            SUBTRACT 365                FROM LDTLK-TOTAL-DAYS
005409*            ADD 1                   TO LDTLK-JUL1-CCYY
005409*            GO TO 3200-RED-DAYS-BELOW-MAX
005409*        ELSE
005409*            MOVE LDTLK-TOTAL-DAYS   TO LDTLK-JUL1-DDD
005409*        END-IF
005409*    ELSE
005409*        MOVE LDTLK-LEAP-YEAR-SW     TO LDTLK-SAVE-LEAP-SW
005409*        MOVE LDTLK-JUL1-CCYY        TO LDTLK-LEAP-YEAR
005409*        PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409*            THRU LEAP-0100-EDIT-LEAP-YEAR-X
005409*        PERFORM  3500-TOTAL-DAYS
005409*            THRU 3500-TOTAL-DAYS-X
005409*    END-IF.
 
005409     MOVE LDTLK-JUL1-CCYY        TO LDTLK-LEAP-YEAR.
005409     PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409         THRU LEAP-0100-EDIT-LEAP-YEAR-X.
 
005409     PERFORM  3500-TOTAL-DAYS
005409         THRU 3500-TOTAL-DAYS-X.
 
557660 3200-RED-DAYS-BELOW-MAX-X.
           EXIT.
 
54-001*----------------
54-001 3500-TOTAL-DAYS.
54-001*----------------
 
005409*    IF  LDTLK-USE-LEAP-YEAR
005409     IF  LDTLK-IS-LEAP-YEAR
54-001         IF  LDTLK-TOTAL-DAYS > 366
54-001             SUBTRACT 366             FROM LDTLK-TOTAL-DAYS
54-001             ADD 1                    TO LDTLK-JUL1-CCYY
005409*            MOVE LDTLK-SAVE-LEAP-SW  TO LDTLK-LEAP-YEAR-SW
005409*            GO TO 3500-TOTAL-DAYS-X
005409*        ELSE
005409*            MOVE LDTLK-SAVE-LEAP-SW  TO LDTLK-LEAP-YEAR-SW
005409*            MOVE LDTLK-TOTAL-DAYS    TO LDTLK-JUL1-DDD
54-001         END-IF
54-001     ELSE
005409*        MOVE LDTLK-SAVE-LEAP-SW      TO LDTLK-LEAP-YEAR-SW
54-001         IF  LDTLK-TOTAL-DAYS > 365
54-001             SUBTRACT 365             FROM LDTLK-TOTAL-DAYS
54-001             ADD 1                    TO LDTLK-JUL1-CCYY
005409*            GO TO 3500-TOTAL-DAYS-X
005409*        ELSE
005409*            MOVE LDTLK-TOTAL-DAYS    TO LDTLK-JUL1-DDD
54-001         END-IF
54-001     END-IF.
005409             MOVE LDTLK-TOTAL-DAYS    TO LDTLK-JUL1-DDD.
54-001
54-001 3500-TOTAL-DAYS-X.
54-001     EXIT.
      /
      *--------------------
       4000-SUBTRACT-Y-M-D.
      *--------------------
 
      *****************************************************************
      * THIS ROUTINE WILL SUBTRACT FROM L1680-INTERNAL-1 THE
      * FIELDS 1680-NUMBER-OF-YEARS, 1680-NUMBER-OF-MONTHS AND
      * 1680-NUMBER-OF-DAYS.  THE RESULT OF THE COMPUTATION
      * IS STORED IN L1680-INTERNAL-2.
      *****************************************************************
 
           IF  L1680-NUMBER-OF-YEARS NUMERIC
               CONTINUE
           ELSE
               SET LDTLK-NOT-VALID TO TRUE
               GO TO 4000-SUBTRACT-Y-M-D-X
           END-IF.
 
           IF  L1680-NUMBER-OF-MONTHS NUMERIC
               CONTINUE
           ELSE
               SET LDTLK-NOT-VALID TO TRUE
               GO TO 4000-SUBTRACT-Y-M-D-X
           END-IF.
 
           IF  L1680-NUMBER-OF-DAYS NUMERIC
               CONTINUE
           ELSE
               SET LDTLK-NOT-VALID TO TRUE
               GO TO 4000-SUBTRACT-Y-M-D-X
           END-IF.
 
           MOVE L1680-INT-DD-1 TO L1680-INT-DD-2.
           IF  L1680-NUMBER-OF-YEARS > L1680-INT-YYYY-1
               SET LDTLK-NOT-VALID TO TRUE
               GO TO 4000-SUBTRACT-Y-M-D-X
           END-IF.
 
           COMPUTE L1680-INT-YYYY-2
               = L1680-INT-YYYY-1 - L1680-NUMBER-OF-YEARS.
           COMPUTE LDTLK-MONTHS = L1680-NUMBER-OF-MONTHS / 12.
           COMPUTE L1680-INT-YYYY-2 = L1680-INT-YYYY-2 - LDTLK-MONTHS.
           COMPUTE LDTLK-MONTHS = L1680-NUMBER-OF-MONTHS -
                                   (LDTLK-MONTHS * 12).
 
           IF  LDTLK-MONTHS > L1680-INT-MM-1
               SUBTRACT 1 FROM L1680-INT-YYYY-2
               COMPUTE L1680-INT-MM-2 =
                   (L1680-INT-MM-1 + 12) - LDTLK-MONTHS
           ELSE
               COMPUTE L1680-INT-MM-2 = L1680-INT-MM-1 - LDTLK-MONTHS
           END-IF.
 
           IF  L1680-INT-MM-2 < 01
               SUBTRACT 1 FROM L1680-INT-YYYY-2
               MOVE 12         TO L1680-INT-MM-2
           END-IF.
 
           IF  L1680-INT-DD-2 < 29
               CONTINUE
           ELSE
               PERFORM  4100-REDUCE-DAYS-IN-MTH
                   THRU 4100-REDUCE-DAYS-IN-MTH-X
           END-IF.
 
      *
      * THE FOLLOWING LINES ARE TO IMPROVE PERFORMANCE, SINCE
      * ADMIN OFTEN SUBTRACTS A WHOLE NUMBER OF MONTHS.
      *
           IF  L1680-NUMBER-OF-DAYS = ZERO
               GO TO 4000-SUBTRACT-Y-M-D-X
           END-IF.
 
           MOVE L1680-INTERNAL-2      TO L1670-INTERNAL-DATE.
           PERFORM  1670-2000-INTERNAL-YYYYDDD
               THRU 1670-2000-INTERNAL-YYYYDDD-X.
 
           IF  L1670-NOT-VALID
               MOVE L1670-VALID-SW    TO LDTLK-VALID-SW
               GO TO 4000-SUBTRACT-Y-M-D-X
           END-IF.
 
           MOVE L1670-JULIAN-DATE-R-1 TO LDTLK-JUL-1.
 
           MOVE ZEROS TO L1680-NUMBER-OF-YEARS.
 
           IF L1680-NUMBER-OF-DAYS > 365
             COMPUTE L1680-NUMBER-OF-YEARS =
                     L1680-NUMBER-OF-DAYS / 365
           END-IF.
 
           COMPUTE LDTLK-DAYS =
               L1680-NUMBER-OF-DAYS - (L1680-NUMBER-OF-YEARS * 365).
 
           SUBTRACT L1680-NUMBER-OF-YEARS FROM L1670-YYYY-1.
 
           IF LDTLK-DAYS < L1670-DDD-1
               COMPUTE L1670-DDD-1 = L1670-DDD-1 - LDTLK-DAYS
           ELSE
               SUBTRACT 1 FROM L1670-YYYY-1
               COMPUTE L1670-DDD-1
                     = L1670-DDD-1 + 365 - LDTLK-DAYS
005409*        PERFORM  4050-SAVE-LEAP-YEAR
005409*            THRU 4050-SAVE-LEAP-YEAR-X
005409         PERFORM  4050-ADD-LEAP-DAY
005409             THRU 4050-ADD-LEAP-DAY-X
           END-IF.
 
           PERFORM  1670-6000-YYYYDDD-INTERNAL
               THRU 1670-6000-YYYYDDD-INTERNAL-X.
 
           IF  L1670-NOT-VALID
               MOVE L1670-VALID-SW  TO LDTLK-VALID-SW
               GO TO 4000-SUBTRACT-Y-M-D-X
           END-IF.
 
           MOVE L1670-INTERNAL-DATE TO L1680-INTERNAL-2.
 
       4000-SUBTRACT-Y-M-D-X.
           EXIT.
 
54-001*--------------------
005409*4050-SAVE-LEAP-YEAR.
005409 4050-ADD-LEAP-DAY.
54-001*--------------------
 
005409*    IF  LDTLK-USE-LEAP-YEAR
005409*        MOVE LDTLK-LEAP-YEAR-SW     TO LDTLK-SAVE-LEAP-SW
005409*        MOVE L1670-YYYY-1           TO LDTLK-LEAP-YEAR
005409*        PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409*            THRU LEAP-0100-EDIT-LEAP-YEAR-X
005409*        IF  LDTLK-USE-LEAP-YEAR
005409*            COMPUTE L1670-DDD-1 = L1670-DDD-1 + 1
005409*            MOVE LDTLK-SAVE-LEAP-SW TO LDTLK-LEAP-YEAR-SW
005409*        ELSE
005409*            MOVE LDTLK-SAVE-LEAP-SW TO LDTLK-LEAP-YEAR-SW
005409*        END-IF
005409*    END-IF.
 
005409     MOVE L1670-YYYY-1               TO LDTLK-LEAP-YEAR.
005409     PERFORM LEAP-0100-EDIT-LEAP-YEAR
005409         THRU LEAP-0100-EDIT-LEAP-YEAR-X.
 
005409     IF LDTLK-IS-LEAP-YEAR
005409         COMPUTE L1670-DDD-1 = L1670-DDD-1 + 1
005409     END-IF.
 
005409*4050-SAVE-LEAP-YEAR-X.
005409 4050-ADD-LEAP-DAY-X.
           EXIT.
 
      *----------------------------
       4100-REDUCE-DAYS-IN-MTH.
      *----------------------------
 
           MOVE L1680-INT-MM-2         TO LDTLK-MM-SUB.
005409*    IF  LDTLK-USE-LEAP-YEAR
005409*        MOVE LDTLK-LEAP-YEAR-SW TO LDTLK-SAVE-LEAP-SW
005409*        MOVE L1680-INT-YYYY-2   TO LDTLK-LEAP-YEAR
005409*        PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409*            THRU LEAP-0100-EDIT-LEAP-YEAR-X
005409*        IF  LDTLK-USE-LEAP-YEAR
005409*            MOVE LDTLK-SAVE-LEAP-SW TO LDTLK-LEAP-YEAR-SW
005409*            MOVE 2                  TO LDTLK-LEAP-SUB
005409*        ELSE
005409*            MOVE LDTLK-SAVE-LEAP-SW TO LDTLK-LEAP-YEAR-SW
005409*            MOVE 1                  TO LDTLK-LEAP-SUB
005409*        END-IF
005409*    ELSE
005409*        MOVE 1                      TO LDTLK-LEAP-SUB
005409*    END-IF.
 
005409     MOVE L1680-INT-YYYY-2           TO LDTLK-LEAP-YEAR.
005409     PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409         THRU LEAP-0100-EDIT-LEAP-YEAR-X.
 
005409     IF LDTLK-IS-LEAP-YEAR
005409         MOVE +2                     TO LDTLK-LEAP-SUB
005409     ELSE
005409         MOVE +1                     TO LDTLK-LEAP-SUB
005409     END-IF.
 
           IF  L1680-INT-DD-2 >
                    TDTTB-DAYS-IN-MONTH (LDTLK-MM-SUB, LDTLK-LEAP-SUB)
               MOVE TDTTB-DAYS-IN-MONTH (LDTLK-MM-SUB, LDTLK-LEAP-SUB)
                                           TO L1680-INT-DD-2
           END-IF.
 
       4100-REDUCE-DAYS-IN-MTH-X.
           EXIT.
      /
      *---------------
       5000-ADD-M.
      *---------------
 
      *****************************************************************
      * THIS ROUTINE WILL ADD TO L1680-INTERNAL-1 THE
      * FIELD 1680-NUMBER-OF-MONTHS.
      * THE RESULT OF THE COMPUTATION IS STORED IN
      * L1680-INTERNAL-2.  IT IS NOT ADJUSTED TO TAKE
      * ACCOUNT OF THE NUMBER OF DAYS IN THE MONTH.
      * FOR EXAMPLE, ADDING 1 MONTH TO THE 31ST OF MAY
      * WILL GIVE THE 31ST OF JUNE. THIS PROCESS CORRESPONDS
      * TO THE OLD ADMIN ROUTINE ADD-DATES-1-TO-2-OLD
      * AND IS USED TO SUPPORT BILLING.
      *****************************************************************
 
           IF  L1680-NUMBER-OF-MONTHS NUMERIC
               CONTINUE
           ELSE
               SET LDTLK-NOT-VALID TO TRUE
               GO TO 5000-ADD-M-X
           END-IF.
 
           MOVE L1680-INT-DD-1   TO L1680-INT-DD-2.
           MOVE L1680-INT-YYYY-1 TO L1680-INT-YYYY-2.
           COMPUTE L1680-INT-MM-2 =
               L1680-INT-MM-1 + L1680-NUMBER-OF-MONTHS.
           COMPUTE LDTLK-MONTHS = L1680-INT-MM-2 / 12.
           COMPUTE L1680-INT-YYYY-2 =
               L1680-INT-YYYY-2 + LDTLK-MONTHS.
           COMPUTE L1680-INT-MM-2 =
               L1680-INT-MM-2 - (LDTLK-MONTHS * 12).
 
           IF  L1680-INT-MM-2 = ZERO
               ADD 12            TO L1680-INT-MM-2
               SUBTRACT 1 FROM L1680-INT-YYYY-2
           END-IF.
 
       5000-ADD-M-X.
           EXIT.
 
      /
      *----------------
       6000-SUBTRACT-M.
      *----------------
 
      *****************************************************************
      * THIS ROUTINE WILL SUBTRACT FROM L1680-INTERNAL-1 THE
      * FIELD 1680-NUMBER-OF-MONTHS.
      * THE RESULT OF THE COMPUTATION IS STORED IN
      * L1680-INTERNAL-2.  IT IS NOT ADJUSTED TO TAKE ACCOUNT
      * OF THE NUMBER OF DAYS IN THE MONTH. FOR EXAMPLE,
      * SUBTRACTING 1 MONTH FROM THE 31ST OF MAY GIVES
      * THE 31ST OF APRIL. THIS PROCESS IS NEEDED TO SUPPORT
      * BILLING.
      *****************************************************************
 
           IF  L1680-NUMBER-OF-MONTHS NUMERIC
               CONTINUE
           ELSE
               SET LDTLK-NOT-VALID TO TRUE
010311*        GO TO 4000-SUBTRACT-Y-M-D-X
010311         GO TO 6000-SUBTRACT-M-X
           END-IF.
 
           MOVE L1680-INT-DD-1   TO L1680-INT-DD-2.
           MOVE L1680-INT-YYYY-1 TO L1680-INT-YYYY-2.
           COMPUTE LDTLK-MONTHS = L1680-NUMBER-OF-MONTHS / 12.
           COMPUTE L1680-INT-YYYY-2 = L1680-INT-YYYY-2 - LDTLK-MONTHS.
           COMPUTE LDTLK-MONTHS = L1680-NUMBER-OF-MONTHS -
                                   (LDTLK-MONTHS * 12).
 
           IF  LDTLK-MONTHS > L1680-INT-MM-1
               SUBTRACT 1 FROM L1680-INT-YYYY-2
               COMPUTE L1680-INT-MM-2 =
                   (L1680-INT-MM-1 + 12) - LDTLK-MONTHS
           ELSE
               COMPUTE L1680-INT-MM-2 = L1680-INT-MM-1 - LDTLK-MONTHS
           END-IF.
 
           IF  L1680-INT-MM-2 < 01
               SUBTRACT 1 FROM L1680-INT-YYYY-2
               MOVE 12           TO L1680-INT-MM-2
           END-IF.
 
       6000-SUBTRACT-M-X.
           EXIT.
      /
      *----------------------
       9000-COMPUTE-YY-MM-DD.
      *----------------------
 
      *****************************************************************
      * THIS ROUTINE WILL CALCULATE THE NUMBER OF YEARS, MONTHS
      * AND DAYS BETWEEN TWO DATES, USING THE DATES' INTERNAL
      * FORMAT REPRESENTATIONS.
      ****************************************************************
 
005409*    IF LDTLK-USE-LEAP-YEAR
005409*        MOVE L1680-INT-YYYY-2    TO LDTLK-LEAP-YEAR
005409*        PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409*            THRU LEAP-0100-EDIT-LEAP-YEAR-X
005409*        IF LDTLK-USE-LEAP-YEAR
005409*            MOVE 2        TO LDTLK-LEAP-SUB
005409*        ELSE
005409*            MOVE 1        TO LDTLK-LEAP-SUB
005409*        END-IF
005409*    ELSE
005409*        MOVE 1            TO LDTLK-LEAP-SUB
005409*    END-IF.
 
005409     MOVE L1680-INT-YYYY-2     TO LDTLK-LEAP-YEAR.
005409     PERFORM  LEAP-0100-EDIT-LEAP-YEAR
005409         THRU LEAP-0100-EDIT-LEAP-YEAR-X.
 
005409     IF LDTLK-IS-LEAP-YEAR
005409         MOVE 2            TO LDTLK-LEAP-SUB
005409     ELSE
005409         MOVE 1            TO LDTLK-LEAP-SUB
005409     END-IF.
 
           COMPUTE L1680-NUMBER-OF-YEARS =
               L1680-INT-YYYY-2 - L1680-INT-YYYY-1.
 
           COMPUTE L1680-NUMBER-OF-MONTHS =
               L1680-INT-MM-2 - L1680-INT-MM-1.
      *
      * IN ORDER TO CALCULATE DAYS CORRECTLY, TAKING INTO
      * ACCOUNT THE DIFFERING NUMBERS OF DAYS IN A MONTH, USE
      * THE NUMBER OF DAYS IN THE MONTH PRECEDING THE END
      * MONTH.
      *        LDTLK-MM-SUB WILL CONTAIN THE NUMBER OF THIS MONTH.
      *
           IF  L1680-INT-MM-2 = 1
               MOVE 12           TO LDTLK-MM-SUB
           ELSE
               COMPUTE LDTLK-MM-SUB = L1680-INT-MM-2 - 1
           END-IF.
 
           IF  L1680-INT-DD-1 > L1680-INT-DD-2
           AND L1680-INT-DD-1 >
                      TDTTB-DAYS-IN-MONTH (LDTLK-MM-SUB, LDTLK-LEAP-SUB)
               COMPUTE L1680-NUMBER-OF-DAYS = L1680-INT-DD-2 -
                      TDTTB-DAYS-IN-MONTH (LDTLK-MM-SUB, LDTLK-LEAP-SUB)
           ELSE
               COMPUTE L1680-NUMBER-OF-DAYS =
                   L1680-INT-DD-2 - L1680-INT-DD-1
           END-IF.
      *
      *    CORRECT FOR NEGATIVE NUMBERS OF MONTHS, DAYS
      *
           IF  L1680-INT-DD-1 >
                    TDTTB-DAYS-IN-MONTH (L1680-INT-MM-2, LDTLK-LEAP-SUB)
           AND L1680-INT-DD-2 =
                    TDTTB-DAYS-IN-MONTH (L1680-INT-MM-2, LDTLK-LEAP-SUB)
               MOVE ZERO         TO L1680-NUMBER-OF-DAYS
           ELSE
               IF L1680-INT-DD-1 > L1680-INT-DD-2
                  SUBTRACT 1 FROM L1680-NUMBER-OF-MONTHS
                  ADD TDTTB-DAYS-IN-MONTH (LDTLK-MM-SUB, LDTLK-LEAP-SUB)
                                 TO L1680-NUMBER-OF-DAYS
               END-IF
           END-IF.
 
           IF  L1680-NUMBER-OF-MONTHS < ZERO
               SUBTRACT 1 FROM L1680-NUMBER-OF-YEARS
               ADD 12            TO L1680-NUMBER-OF-MONTHS
           END-IF.
 
       9000-COMPUTE-YY-MM-DD-X.
           EXIT.
      /
      *****************************************************************
      *  PROCESSING COPYBOOKS                                         *
      *****************************************************************
       COPY XCPPLEAP.
      /
      *****************************************************************
      *  LINKAGE PROCESSING COPYBOOKS                                 *
      *****************************************************************
       COPY XCPL1670.
      *****************************************************************
      **                 END OF PROGRAM XSDU1680                     **
      *****************************************************************
