      *************************
       IDENTIFICATION DIVISION.
      *************************
       PROGRAM-ID. XSDU0005.

       COPY XCWWCRHT.

      *****************************************************************
      **  MEMBER :  XSDU0005                                         **
      **  REMARKS:  MIXED CASE SUPPORT.                              **
      **            THIS MODULE PERFORMS MIXED TO UPPER-CASE         **
      **            CONVERSIONS. BASED ON THE REQUEST, IT WILL       **
      **            CONVERT THE LOWER CASE CHARACTERS TO UPPER CASE  **
      **            WITH OR WITHOUT ACCENTS.                         **
      **  DOMAIN :  SY                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
557698**  30SEP97  MM     CREATED FOR RELEASE 5.5                    **
015543**  15DEC99  60     CODE CLEANUP                               **
AP0002**  31MAR00  601    CLIENT SEARCH                              **
MP306B**  26AUG2016  CTS    REINSTATEMENT & SURRENDER RECOMMENDATION **
MP306B**                    NOTICE                                   **  
UYS110**  27NOV20    CTS  CHANGES DONE TO INCLUDE KANA SOUND CNVR    **
128584**  01DEC20    CTS  UYS110-FIX DONE FOR POLICY LEVEL DETAIL    **
128584**                  LINE IN NSBM9565_NSPRT2 REPORT             **
      *****************************************************************
      /
      **********************
       ENVIRONMENT DIVISION.
      **********************
      /
      ***************
       DATA DIVISION.
      ***************

       WORKING-STORAGE SECTION.


       COPY XCWWPGWS REPLACING '$VAR1' BY 'XSDU0005'.
      /
       COPY XCWT0005.
       COPY XCWW0005.
       COPY CCWWINDX.
      /
      *****************
       LINKAGE SECTION.
      *****************
       01  WGLOB-GLOBAL-AREA.
       COPY XCWWGLOB.
       COPY XCWL0005.
      /
       PROCEDURE DIVISION USING WGLOB-GLOBAL-AREA
                                  L0005-PARM-INFO.


      *--------------
       0000-MAINLINE.
      *--------------

           INITIALIZE L0005-OUTPUT-PARM-INFO.

           EVALUATE TRUE

              WHEN L0005-RQST-CONVERT-STRING
                   PERFORM  0005-1000-CONVERT-STRING
                       THRU 0005-1000-CONVERT-STRING-X

              WHEN L0005-RQST-CONVERT-NO-ACCENTS
                   PERFORM  0005-2000-CONVERT-NO-ACCENTS
                       THRU 0005-2000-CONVERT-NO-ACCENTS-X
MP306B
MP306B        WHEN L0005-RQST-CONVERT-UPPER-KANA                       
MP306B             PERFORM  0005-3000-CONVERT-UPPER-KANA
MP306B                THRU  0005-3000-CONVERT-UPPER-KANA-X
UYS110
UYS110        WHEN L0005-RQST-CONVERT-SNDMK-KANA
UYS110             PERFORM  0005-4000-CONVERT-SNDMK-KANA
UYS110                 THRU 0005-4000-CONVERT-SNDMK-KANA-X
UYS110
              WHEN OTHER
                   SET  L0005-RETRN-INVALID-REQUEST TO TRUE

           END-EVALUATE.

           GOBACK.

       0000-MAINLINE-X.
           EXIT.

      /
      *------------------------
       0005-1000-CONVERT-STRING.
      *------------------------

AP0002     IF  WGLOB-COUNTRY-JAPAN
AP0002     AND NOT L0005-FORCE-UPPER
AP0002         MOVE L0005-INPUT-STRING    TO L0005-OUTPUT-STRING
AP0002         GO TO 0005-1000-CONVERT-STRING-X
AP0002     END-IF.

           INITIALIZE                        W0005-INPUT-STRING.
           INITIALIZE                        W0005-OUTPUT-STRING.

           MOVE 1                         TO W0005-COL-IN-SUB.
           MOVE L0005-INPUT-STRING        TO W0005-STRING-UNCONVERTED.

           IF W0005-STRING-UNCONVERTED > SPACES
              CONTINUE
           ELSE
              GO TO 0005-1000-CONVERT-STRING-X
           END-IF.

      *    SET W0005-COL-OUT-SUB TO 2. THIS WILL CAUSE LOWER-CASE
      *    CHARACTERS WITH ACCENTS TO BE CONVERTED TO UPPER-CASE
      *    WHILE RETAINING THEIR ACCENTS.


           SET W0005-CONVERT-WITH-ACCENTS TO TRUE.

           PERFORM  0005-5000-CONVERT
               THRU 0005-5000-CONVERT-X.

           MOVE W0005-STRING-CONVERTED    TO L0005-OUTPUT-STRING.

       0005-1000-CONVERT-STRING-X.
           EXIT.
      /
      *-----------------------------
       0005-2000-CONVERT-NO-ACCENTS.
      *-----------------------------

AP0002     IF  WGLOB-COUNTRY-JAPAN
AP0002     AND NOT L0005-FORCE-UPPER
AP0002         MOVE L0005-INPUT-STRING    TO L0005-OUTPUT-STRING
AP0002         GO TO 0005-2000-CONVERT-NO-ACCENTS-X
AP0002     END-IF.

           INITIALIZE                        W0005-INPUT-STRING.
           INITIALIZE                        W0005-OUTPUT-STRING.

           MOVE 1                         TO W0005-COL-IN-SUB.
           MOVE L0005-INPUT-STRING        TO W0005-STRING-UNCONVERTED.

           IF W0005-STRING-UNCONVERTED > SPACES
              CONTINUE
           ELSE
              GO TO 0005-2000-CONVERT-NO-ACCENTS-X
           END-IF.

      *    SET W0005-COL-OUT-SUB = 3. THIS WILL CAUSE LOWER-CASE
      *    CHARACTERS WITH ACCENTS TO BE CONVERTED TO UPPER-CASE
      *    WHILE DROPPING THEIR ACCENTS.

           SET W0005-CONVERT-WITHOUT-ACCENTS TO TRUE.

           PERFORM  0005-5000-CONVERT
               THRU 0005-5000-CONVERT-X.

           MOVE W0005-STRING-CONVERTED      TO L0005-OUTPUT-STRING.

       0005-2000-CONVERT-NO-ACCENTS-X.
           EXIT.
      /
      *-----------------
       0005-5000-CONVERT.
      *-----------------

           PERFORM VARYING I FROM +1 BY +1
              UNTIL I > +132

              IF W0005-BYTE-UNCONVERTED (I) > SPACES
                 PERFORM  0005-5100-CONVERT-BYTE
                     THRU 0005-5100-CONVERT-BYTE-X
              ELSE
                 MOVE W0005-BYTE-UNCONVERTED (I)
                                          TO W0005-BYTE-CONVERTED (I)
              END-IF

           END-PERFORM.

       0005-5000-CONVERT-X.
           EXIT.
      /
      *-----------------------
       0005-5100-CONVERT-BYTE.
      *-----------------------

            PERFORM VARYING W0005-ROW-SUB FROM +1 BY +1
               UNTIL W0005-BYTE-UNCONVERTED (I) =
                     WS-CONVERSION-LETTER
                           (W0005-ROW-SUB, W0005-COL-IN-SUB)
                  OR W0005-ROW-SUB > WS-NUMBER-ENTRIES
015543         CONTINUE
            END-PERFORM.

            IF W0005-ROW-SUB > WS-NUMBER-ENTRIES
               MOVE W0005-BYTE-UNCONVERTED (I)
                                          TO W0005-BYTE-CONVERTED (I)
            ELSE
               MOVE WS-CONVERSION-LETTER
                          (W0005-ROW-SUB, W0005-COL-OUT-SUB)
                                          TO W0005-BYTE-CONVERTED (I)
            END-IF.

       0005-5100-CONVERT-BYTE-X.
           EXIT.


MP306B
MP306B*------------------------------
MP306B 0005-3000-CONVERT-UPPER-KANA.
MP306B*------------------------------
MP306B
MP306B     INITIALIZE                        W0005-INPUT-STRING.
MP306B     INITIALIZE                        W0005-OUTPUT-STRING.
MP306B
MP306B     MOVE L0005-INPUT-STRING        TO W0005-STRING-CONVERTED.
MP306B
MP306B
MP306B
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¦' BY 'µ'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '°' BY '-'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '[' BY '('.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL ']' BY ')'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¢' BY '('.
MP306B 
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '£' BY ')'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '\' BY '$'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¨' BY '²'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '©' BY '³'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ª' BY '´'.
MP306B 
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '«' BY 'µ'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¬' BY 'Ô'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '­' BY 'Õ'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '®' BY 'Ö'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¯' BY 'Â'.
MP306B 
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'a' BY 'A'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'b' BY 'B'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'c' BY 'C'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'd' BY 'D'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'e' BY 'E'.
MP306B 
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'f' BY 'F'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'g' BY 'G'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'h' BY 'H'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'i' BY 'I'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'j' BY 'J'.
MP306B 
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'k' BY 'K'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'l' BY 'L'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'm' BY 'M'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'n' BY 'N'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'o' BY 'O'.
MP306B 
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'p' BY 'P'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'q' BY 'Q'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'r' BY 'R'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 's' BY 'S'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 't' BY 'T'.
MP306B 
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'u' BY 'U'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'v' BY 'V'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'w' BY 'W'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'x' BY 'X'.
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'y' BY 'Y'.
MP306B 
MP306B     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'z' BY 'Z'.
MP306B 
MP306B
MP306B
MP306B     MOVE W0005-STRING-CONVERTED    TO L0005-OUTPUT-STRING.
MP306B
MP306B 0005-3000-CONVERT-UPPER-KANA-X.
MP306B     EXIT.
MP306B/
MP306B
UYS110*----------------------------
UYS110 0005-4000-CONVERT-SNDMK-KANA.
UYS110*----------------------------
UYS110 
UYS110     INITIALIZE                        W0005-INPUT-STRING.
UYS110     INITIALIZE                        W0005-OUTPUT-STRING.
UYS110
UYS110     MOVE L0005-INPUT-STRING        TO W0005-STRING-CONVERTED.
UYS110
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÄÞ' BY 'Ä '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¶Þ' BY '¶ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'Ìß' BY 'Ì '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'Íß' BY 'Í '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'Ëß' BY 'Ë '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'Êß' BY 'Ê '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'Îß' BY 'Î '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '·Þ' BY '· '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¸Þ' BY '¸ '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¹Þ' BY '¹ '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ºÞ' BY 'º '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '»Þ' BY '» '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '½Þ' BY '½ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¿Þ' BY '¿ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÀÞ' BY 'À '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÁÞ' BY 'Á '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÂÞ' BY 'Â '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÃÞ' BY 'Ã '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÊÞ' BY 'Ê '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ËÞ' BY 'Ë '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÌÞ' BY 'Ì '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÎÞ' BY 'Î '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÍÞ' BY 'Í '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¿Þ' BY '¿ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '³Þ' BY '³ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¼Þ' BY '¼ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¾Þ' BY '¾ '.
UYS110
UYS110     INITIALIZE                        W0005-INPUT-STRING.
UYS110     INITIALIZE                        W0005-OUTPUT-STRING.
UYS110
UYS110     MOVE L0005-INPUT-STRING        TO W0005-STRING-CONVERTED.
UYS110
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÄÞ' BY 'Ä '.
UYS110     INSPECT W0005-STRING-CONVERTED REPLACING ALL '¶Þ' BY '¶ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'Ìß' BY 'Ì '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'Íß' BY 'Í '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'Ëß' BY 'Ë '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'Êß' BY 'Ê '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'Îß' BY 'Î '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '·Þ' BY '· '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¸Þ' BY '¸ '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¹Þ' BY '¹ '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ºÞ' BY 'º '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '»Þ' BY '» '.
128584     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '½Þ' BY '½ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¿Þ' BY '¿ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÀÞ' BY 'À '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÁÞ' BY 'Á '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÂÞ' BY 'Â '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÃÞ' BY 'Ã '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÊÞ' BY 'Ê '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ËÞ' BY 'Ë '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÌÞ' BY 'Ì '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÎÞ' BY 'Î '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL 'ÍÞ' BY 'Í '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¿Þ' BY '¿ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '³Þ' BY '³ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¼Þ' BY '¼ '.
UYS110     INSPECT W0005-STRING-CONVERTED  REPLACING ALL '¾Þ' BY '¾ '.
UYS110
UYS110     MOVE W0005-STRING-CONVERTED    TO L0005-OUTPUT-STRING.
UYS110
UYS110 0005-4000-CONVERT-SNDMK-KANA-X.
UYS110     EXIT.    
      *****************************************************************
      **                 END OF PROGRAM XSDU0005                     **
      *****************************************************************

