      *************************
       IDENTIFICATION DIVISION.
      *************************
       PROGRAM-ID. XSDU0015.

       COPY XCWWCRHT.

      *****************************************************************
      **  MEMBER :  XSDU0015                                         **
      **  REMARKS:  COMPRESS A PASSED FIELD LEAVING ONE OR NO BLANKS **
      **            BETWEEN WORDS AS REQUESTED.                      **
      **            THIS MODULE MOVES THE L0015-INPUT-PARMS TO       **
      **            L0015-OUTPUT-PARMS REMOVING ALL SPACES BETWEEN   **
      **            WORDS, OR LEAVING EXACTLY ONE SPACE BETWEEN      **
      **            WORDS, DEPENDING ON THE REQUEST CODE.            **
      **                                                             **
      **  DOMAIN :  SY                                               **
      **  CLASS  :  UT                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
54-001**  01SEP96  ALW    MODIFICATIONS FOR MAINTAINABILITY          **
009160**  31MAR98  552    CREATED FOR MBCS FIELDS MANIPULATION       **
      *****************************************************************
      /
      **********************
       ENVIRONMENT DIVISION.
      **********************
009160
009160**********************
009160 CONFIGURATION SECTION.
009160**********************
009160*
009160* SPECIAL NAME FOR MBCS CHARACTER SET
009160*
009160 COPY XCWWCSNM.
009160/
      ***************
       DATA DIVISION.
      ***************

       WORKING-STORAGE SECTION.

009160 01  W0015-NEXT-CHAR-CD                 PIC  9(02).
009160     88  W0015-NEXT-CHAR-IS-SPACE        VALUE  01.
009160     88  W0015-NEXT-CHAR-IS-NOT-SPACE    VALUE  00.
009160
009160 COPY XCWWMBCS.

53-062 COPY XCWWPGWS REPLACING '$VAR1' BY 'XSDU0015'.
      /
      *****************
       LINKAGE SECTION.
      *****************

       COPY XCWL0015.
      /
       PROCEDURE DIVISION USING L0015-PARM-INFO.

      *--------------
       0000-MAINLINE.
      *--------------
009160
009160*****************************************************************
009160*-- CHECK WHETHER IT'S UNDER MAINFRAME OR PC ENVIRONMENT.
009160*****************************************************************
009160     PERFORM  MBCS-0000-INIT
009160         THRU MBCS-0000-INIT-X.

           SET        L0015-RETRN-OK TO TRUE.
           MOVE SPACES               TO L0015-COMP-AREA-OUT.
           MOVE ZERO                 TO L0015-IN-SUB1.
           MOVE ZERO                 TO L0015-IN-SUB2.
009160*    MOVE ZERO                 TO L0015-OUT-SUB.
009160     MOVE 1                    TO L0015-OUT-SUB.

           EVALUATE TRUE

              WHEN L0015-RQST-COMPRESS-BLANKS
                   PERFORM  0015-1000-COMPRESS-BLANKS
                       THRU 0015-1000-COMPRESS-BLANKS-X
                       VARYING L0015-IN-SUB1 FROM 1 BY 1
                       UNTIL   L0015-IN-SUB1 > L0015-MAX-LEN
009160                 OR      L0015-OUT-SUB > L0015-MAX-LEN

              WHEN L0015-RQST-COMPRESS-NO-BLANKS
                   PERFORM  0015-2000-COMPRESS-NO-BLANKS
                       THRU 0015-2000-COMPRESS-NO-BLANKS-X
                       VARYING L0015-IN-SUB1 FROM 1 BY 1
                       UNTIL   L0015-IN-SUB1 > L0015-MAX-LEN
009160                 OR      L0015-OUT-SUB > L0015-MAX-LEN

              WHEN OTHER
                   SET     L0015-RETRN-INVALID-REQUEST TO TRUE

           END-EVALUATE.

           GOBACK.

       0000-MAINLINE-X.
           EXIT.

      /
009160*--------------------------
009160 0015-1000-COMPRESS-BLANKS.
009160*--------------------------
009160*
009160*-CHECK WHETHER THE NEXT BYTE IS SOSI, DBCS or SBCS.
009160* SET EITHER DBCS OR SBCS MODE.
009160*
009160     MOVE L0015-COMP-IN-X (L0015-IN-SUB1) TO WMBCS-CS-CHARACTER
009160     PERFORM  MBCS-1000-CHECK
009160         THRU MBCS-1000-CHECK-X.
009160
009160*
009160*-IF NEXT BYTE IS SOSI CHARACTER, MOVE IT TO OUTPUT BUFFER
009160*
009160     IF  WMBCS-CS-IS-SHIFT-IN  OR  WMBCS-CS-IS-SHIFT-OUT
009160         MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                         TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160         ADD +1          TO L0015-OUT-SUB
009160         ADD +1          TO L0015-IN-SUB1
009160     END-IF.
009160
009160*
009160*-PERFORM DIFFERENT PARAGRAPH DEPENDING ON WHETHER CURRENT
009160* CHARACTER IS DBCS OF SBCS
009160*
009160     IF L0015-IN-SUB1 NOT > L0015-MAX-LEN
009160        IF WMBCS-IN-DBCS-MODE
009160           PERFORM  0015-1200-COMPRESS-BLNK-DBCS
009160               THRU 0015-1200-COMPRESS-BLNK-DBCS-X
009160        ELSE
009160           PERFORM  0015-1100-COMPRESS-BLNK-SBCS
009160               THRU 0015-1100-COMPRESS-BLNK-SBCS-X
009160        END-IF
009160     END-IF.
009160
009160 0015-1000-COMPRESS-BLANKS-X.
009160     EXIT.
009160/
009160*--------------------------
009160*0015-1000-COMPRESS-BLANKS.
009160*--------------------------
009160*****************************************************************
009160**  THIS PARAGRAPH WILL LEAVE ONE SPACE BETWEEN WORDS
009160*****************************************************************
009160*
009160*    IF  L0015-COMP-IN-X (L0015-IN-SUB1) NOT = SPACE
009160*        ADD +1          TO L0015-OUT-SUB
009160*        MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160*                        TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160*        GO              TO 0015-1000-COMPRESS-BLANKS-X
009160*    END-IF.
009160*
009160*    IF  L0015-IN-SUB1 = L0015-MAX-LEN
009160*    OR  L0015-OUT-SUB = ZERO
009160*        GO              TO 0015-1000-COMPRESS-BLANKS-X
009160*    END-IF.
009160*
009160*    COMPUTE L0015-IN-SUB2 = (L0015-IN-SUB1 + (+1)).
009160*
009160*    IF  L0015-COMP-IN-X (L0015-IN-SUB2) NOT EQUAL SPACE
009160*        ADD +1          TO L0015-OUT-SUB
009160*        MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160*                        TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160*    END-IF.
009160*
009160*0015-1000-COMPRESS-BLANKS-X.
009160*    EXIT.
009160
009160*-----------------------------
009160 0015-1100-COMPRESS-BLNK-SBCS.
009160*-----------------------------
009160*****************************************************************
009160**  THIS PARAGRAPH WILL LEAVE ONE SPACE BETWEEN WORDS IN SBCS.
009160*****************************************************************
009160
009160     IF  L0015-COMP-IN-X (L0015-IN-SUB1) NOT = SPACE
009160         MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                         TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160         ADD +1          TO L0015-OUT-SUB
009160         GO              TO 0015-1100-COMPRESS-BLNK-SBCS-X
009160     END-IF.
009160
009160     IF  L0015-IN-SUB1 = L0015-MAX-LEN
009160     OR  L0015-OUT-SUB = ZERO
009160         GO              TO 0015-1100-COMPRESS-BLNK-SBCS-X
009160     END-IF.
009160
009160*
009160*--CHECK IF NEXT LOGICAL CHARACTER IS BLANK
009160*
009160     PERFORM  0015-3000-CHECK-NEXT-BLANKS
009160         THRU 0015-3000-CHECK-NEXT-BLANKS-X.
009160
009160     IF  W0015-NEXT-CHAR-IS-NOT-SPACE
009160         MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                         TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160         ADD +1          TO L0015-OUT-SUB
009160     END-IF.
009160
009160 0015-1100-COMPRESS-BLNK-SBCS-X.
009160     EXIT.
009160/
009160*-----------------------------
009160 0015-1200-COMPRESS-BLNK-DBCS.
009160*-----------------------------
009160*****************************************************************
009160**  THIS PARAGRAPH WILL LEAVE ONE DOUBLE SPACE BETWEEN WORDS
009160**  IN DBCS.
009160*****************************************************************
009160*
009160*-- EXIT IF EITHER SUBSCRIPT IS OUT OF RANGE.
009160*
009160     IF (L0015-IN-SUB1 + 1) > L0015-MAX-LEN
009160     OR (L0015-OUT-SUB + 1) > L0015-MAX-LEN
009160         GO              TO 0015-1200-COMPRESS-BLNK-DBCS-X
009160     END-IF.
009160
009160     IF  L0015-COMP-AREA-IN(L0015-IN-SUB1:2) NOT = WMBCS-SPACE
009160         MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                         TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160         ADD +1          TO L0015-OUT-SUB
009160
009160*
009160*-- MOVE THE 2ND BYTE
009160*
009160         ADD +1          TO L0015-IN-SUB1
009160         MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                         TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160         ADD +1          TO L0015-OUT-SUB
009160         GO              TO 0015-1200-COMPRESS-BLNK-DBCS-X
009160     END-IF.
009160*
009160     IF  (L0015-IN-SUB1 + 3)  NOT > L0015-MAX-LEN AND
009160         (L0015-OUT-SUB + 1)  NOT > L0015-MAX-LEN
009160*
009160*--CHECK IF NEXT LOGICAL CHARACTER IS BLANK
009160*
009160         PERFORM  0015-3000-CHECK-NEXT-BLANKS
009160             THRU 0015-3000-CHECK-NEXT-BLANKS-X
009160
009160         IF  W0015-NEXT-CHAR-IS-NOT-SPACE
009160             MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                             TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160             ADD +1          TO L0015-OUT-SUB
009160*
009160*-- MOVE THE 2ND BYTE
009160*
009160             ADD +1          TO L0015-IN-SUB1
009160             MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                             TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160             ADD +1          TO L0015-OUT-SUB
009160         ELSE
009160*
009160*-- ADVANCE TO THE NEXT DOUBLE BYTE
009160*
009160             ADD +1          TO L0015-IN-SUB1
009160         END-IF
009160     END-IF.
009160
009160 0015-1200-COMPRESS-BLNK-DBCS-X.
009160     EXIT.
009160/
009160*-----------------------------
009160 0015-2000-COMPRESS-NO-BLANKS.
009160*-----------------------------
009160*
009160*-CHECK WHETHER THE NEXT BYTE IS SOSI, DBCS or SBCS
009160*
009160     MOVE L0015-COMP-IN-X (L0015-IN-SUB1) TO WMBCS-CS-CHARACTER
009160
009160     PERFORM  MBCS-1000-CHECK
009160         THRU MBCS-1000-CHECK-X
009160*
009160*-IF NEXT BYTE IS SOSI CHARACTER, MOVE IT TO OUTPUT BUFFER
009160*
009160     IF  WMBCS-CS-IS-SHIFT-IN  OR  WMBCS-CS-IS-SHIFT-OUT
009160         MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                         TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160         ADD +1          TO L0015-OUT-SUB
009160         ADD +1          TO L0015-IN-SUB1
009160     END-IF.
009160
009160*
009160*-PERFORM DIFFERENT PARAGRAPH DEPENDING ON WHETHER CURRENT
009160* CHARACTER IS DBCS OF SBCS
009160*
009160     IF L0015-IN-SUB1 NOT > L0015-MAX-LEN
009160        IF WMBCS-IN-DBCS-MODE
009160           PERFORM  0015-2200-COMPRESS-NOBL-DBCS
009160               THRU 0015-2200-COMPRESS-NOBL-DBCS-X
009160        ELSE
009160           PERFORM  0015-2100-COMPRESS-NOBL-SBCS
009160               THRU 0015-2100-COMPRESS-NOBL-SBCS-X
009160        END-IF
009160     END-IF.
009160
009160 0015-2000-COMPRESS-NO-BLANKS-X.
009160     EXIT.
009160
009160*-----------------------------
009160*0015-2000-COMPRESS-NO-BLANKS.
009160*-----------------------------
009160*****************************************************************
009160**  THIS PARAGRAPH WILL LEAVE NO BLANKS BETWEEN WORDS
009160*****************************************************************
009160*
009160*
009160*    IF L0015-COMP-IN-X  (L0015-IN-SUB1) NOT = SPACE
009160*        ADD +1          TO L0015-OUT-SUB
009160*        MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160*                        TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160*    END-IF.
009160*
009160*0015-2000-COMPRESS-NO-BLANKS-X.
009160*    EXIT.
009160
009160*-----------------------------
009160 0015-2100-COMPRESS-NOBL-SBCS.
009160*-----------------------------
009160*****************************************************************
009160**  THIS PARAGRAPH WILL LEAVE NO BLANKS BETWEEN WORDS IN SBCS.
009160*****************************************************************
009160
009160
009160     IF L0015-COMP-IN-X  (L0015-IN-SUB1) NOT = SPACE
009160         MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                         TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160         ADD +1          TO L0015-OUT-SUB
009160     END-IF.
009160
009160 0015-2100-COMPRESS-NOBL-SBCS-X.
009160     EXIT.
009160
009160*-----------------------------
009160 0015-2200-COMPRESS-NOBL-DBCS.
009160*-----------------------------
009160*****************************************************************
009160**  THIS PARAGRAPH WILL LEAVE NO BLANKS BETWEEN WORDS IN DBCS.
009160*****************************************************************
009160*
009160*-- EXIT IF EITHER SUBSCRIPT IS OUT OF RANGE.
009160*
009160     IF (L0015-IN-SUB1 + 1) NOT > L0015-MAX-LEN AND
009160        (L0015-OUT-SUB + 1) NOT > L0015-MAX-LEN
009160        IF L0015-COMP-AREA-IN(L0015-IN-SUB1:2) NOT = WMBCS-SPACE
009160            MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                            TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160            ADD +1          TO L0015-OUT-SUB
009160*
009160*-- MOVE THE 2ND BYTE
009160*
009160            ADD +1          TO L0015-IN-SUB1
009160            MOVE L0015-COMP-IN-X (L0015-IN-SUB1)
009160                            TO L0015-COMP-OUT-X (L0015-OUT-SUB)
009160            ADD +1          TO L0015-OUT-SUB
009160        ELSE
009160*
009160*-- ADVANCE TO NEXT DOUBLE BYTE
009160*
009160            ADD +1          TO L0015-IN-SUB1
009160        END-IF
009160     END-IF.
009160
009160 0015-2200-COMPRESS-NOBL-DBCS-X.
009160     EXIT.
009160
009160/
009160*----------------------------
009160 0015-3000-CHECK-NEXT-BLANKS.
009160*----------------------------
009160*****************************************************************
009160* CHECK WHETHER THE NEXT CHARACTER ( DBCS OR SBCS ) IS BLANK
009160* L0015-IN-SUB1 POINTS TO THE CURRENT CHARACTER.
009160*    IF THE CURRENT CHARACTER IS DBCS, THEN L0015-IN-SUB1 POINTS
009160*    TO THE  FIRST NIBBLE.
009160*****************************************************************
009160
009160     SET W0015-NEXT-CHAR-IS-NOT-SPACE  TO  TRUE.
009160*
009160* POINT L0015-IN-SUB2 TO THE FIRST BYTE OF NEXT LOGICAL
009160* CHARACTER.
009160*
009160     IF WMBCS-IN-DBCS-MODE
009160        COMPUTE  L0015-IN-SUB2 = (L0015-IN-SUB1 + 2)
009160     ELSE
009160        COMPUTE  L0015-IN-SUB2 = (L0015-IN-SUB1 + 1)
009160     END-IF.
009160*
009160* SKIP SOSI CHARACTERS.
009160*
009160     IF L0015-COMP-IN-X (L0015-IN-SUB2) EQUAL WMBCS-SHIFT-OUT
009160        SET  WMBCS-NEXT-IS-DBCS-MODE     TO  TRUE
009160        ADD  1                           TO  L0015-IN-SUB2
009160     ELSE
009160        IF L0015-COMP-IN-X (L0015-IN-SUB2) EQUAL WMBCS-SHIFT-IN
009160           SET  WMBCS-NEXT-IS-SBCS-MODE  TO  TRUE
009160           ADD  1                        TO  L0015-IN-SUB2
009160        ELSE
009160           MOVE WMBCS-CURRENT-CS-MODE    TO  WMBCS-NEXT-CS-MODE
009160        END-IF
009160     END-IF.
009160*
009160* CHECK NEXT CHARACTER FOR SPACE.
009160*
009160     IF WMBCS-NEXT-IS-DBCS-MODE
009160        IF L0015-COMP-AREA-IN(L0015-IN-SUB2:2) = WMBCS-SPACE
009160           SET W0015-NEXT-CHAR-IS-SPACE  TO  TRUE
009160        END-IF
009160     ELSE
009160        IF L0015-COMP-IN-X (L0015-IN-SUB2) = SPACE
009160           SET W0015-NEXT-CHAR-IS-SPACE  TO  TRUE
009160        END-IF
009160     END-IF.
009160
009160 0015-3000-CHECK-NEXT-BLANKS-X.
009160     EXIT.
009160
009160/
009160 COPY XCPPMBCS.
      *****************************************************************
      **                 END OF PROGRAM XSDU0015                     **
      *****************************************************************
