      *************************
       IDENTIFICATION DIVISION.
      *************************
 
       PROGRAM-ID. XSDU1650.
 
       COPY XCWWCRHT.
 
      *****************************************************************
      **  MEMBER :  XSDU1650                                         **
      **  REMARKS:  DATE CONVERSION INTERNAL TO SPECIAL              **
      **            USING THE PASSED LANGUAGE, CONVERT THE INPUT     **
      **            INTERNAL DATE INTO THE SPECIFIED EXTERNAL FORMAT.**
      **            EIGHT POSSIBLE EXTERNAL FORMATS ARE SUPPORTED.   **
      **                                                             **
      **  DOMAIN :  SY                                               **
      **  CLASS  :  UT                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
53-062**  30NOV95  VK     ADD WORKING STORAGE COPYBOOK XCWWPGWS      **
54-001**  01SEP96  GJR    MODIFICATIONS FOR MAINTAINABILITY          **
54-010**  01SEP96  JMG    MODIFICATIONS FOR SPANISH SUPPORT          **
557658**  30SEP97  MS     YEAR 2000 REQUIREMENTS                     **
557697**  30SEP97  GV     MODIFICATIONS FOR SPECIAL FREQUENCY BILLING**
008453**  31MAR98  552    IMPLEMENT MULTIPLE EXTERNAL DATE FROMAT    **
010418**  30OCT98  56     PASS IN WGLOB-GLOBAL-AREA SO TEXT TABLE    **
010418**                  BE ACCESSED BY COMPANY CODE                **
      *****************************************************************
      /
      **********************
       ENVIRONMENT DIVISION.
      **********************
 
      ***************
       DATA DIVISION.
      ***************
 
       WORKING-STORAGE SECTION.
 
008453*--- MONTHS EXTENDED TABLE ---*
008453 01  WS-EXT-TABLE            PIC X(132) VALUE SPACES.
008453 01  WS-EXT-TABLE-R          REDEFINES WS-EXT-TABLE.
008453     03  WS-EXT              OCCURS 12
008453                             PIC X(11).
008453*--- MONTHS ABBREV TABLE ---*
008453 01  WS-MMM-TABLE            PIC X(36) VALUE SPACES.
008453 01  WS-MMM-TABLE-R          REDEFINES WS-MMM-TABLE.
008453     03  WS-MMM              OCCURS 12
008453                             PIC X(3).
008453*--- MONTHS PREFIXES TABLE ---*
008453 01  WS-MONTHS-PREFIXES-TABLE.
008453     03  WS-MONTHS-PREFIXES  PIC X(108) VALUE SPACES.
008453     03  WS-MONTHS-PREFIX-R  REDEFINES WS-MONTHS-PREFIXES.
008453         05  WS-MONTH-PREFIX OCCURS 12 TIMES
008453                             PIC X(09).
008453*--- DAYS SUFFIXES, COMMA AND 'THE ' TABLE ---*
008453 01  WS-DAYS-SUFFIXES-COMMA-TABLE.
008453     03  WS-DAYS-SUFFIXES    PIC X(62) VALUE SPACES.
008453     03  WS-DAYS-SUFFIXES-R  REDEFINES WS-DAYS-SUFFIXES.
008453         05  WS-DAY-SUFFIX   OCCURS 31 TIMES
008453                             PIC X(02).
008453     03  WS-LONG-COMMA       PIC X(01) VALUE SPACES.
008453     03  WS-LONG-THE         PIC X(04) VALUE SPACES.
 
53-062 COPY XCWWPGWS REPLACING '$VAR1' BY 'XSDU1650'.
 
008453*COPY XCWTDTTB.
008453*COPY XCWTDTPR.
       COPY XCWWWKDT.
54-001 COPY XCWL0015.
008453 COPY XCWL2490.
008453*
010418*01  WGLOB-GLOBAL-AREA.
010418*COPY XCWWGLOB.
 
      *****************
       LINKAGE SECTION.
      *****************
010418 01  WGLOB-GLOBAL-AREA.
010418 COPY XCWWGLOB.
 
       COPY XCWLDTLK.
 
       COPY XCWL1650.
      /
010418*PROCEDURE DIVISION USING LDTLK-PARM-INFO
010418*                         L1650-PARM-INFO.
010418 PROCEDURE DIVISION USING WGLOB-GLOBAL-AREA
010418                          LDTLK-PARM-INFO
010418                          L1650-PARM-INFO.
      *--------------
       0000-MAINLINE.
      *--------------
 
           SET LDTLK-VALID    TO TRUE.
           SET L1650-RETRN-OK TO TRUE.
 
008453*    EVALUATE TRUE
 
008453*        WHEN LDTLK-USER-LANG-ENGLISH
008453*             MOVE +1 TO LDTLK-LANG-SUB
 
008453*        WHEN LDTLK-USER-LANG-FRENCH
008453*             MOVE +2 TO LDTLK-LANG-SUB
 
008453*        WHEN LDTLK-USER-LANG-SPANISH
008453*             MOVE +3 TO LDTLK-LANG-SUB
 
008453*        WHEN OTHER
008453*             MOVE +1 TO LDTLK-LANG-SUB
 
008453*    END-EVALUATE.
 
           PERFORM  1000-PROCESS-DATE
               THRU 1000-PROCESS-DATE-X.
 
           MOVE LDTLK-VALID-SW TO L1650-VALID-SW.
 
           GOBACK.
 
       0000-MAINLINE-X.
           EXIT.
      /
      *------------------
       1000-PROCESS-DATE.
      *------------------
 
           IF  L1650-INTERNAL-DATE = WWKDT-ZERO-DT
               MOVE SPACES          TO L1650-CONVERT-DATE
               SET  LDTLK-NOT-VALID TO TRUE
               GO TO 1000-PROCESS-DATE-X
           END-IF.
 
           MOVE L1650-INTERNAL-DATE TO LDTLK-DATE-1.
 
           EVALUATE TRUE
 
557658*        WHEN L1650-INTERNAL-MMDDYY
557658*             PERFORM  2000-INTERNAL-MMDDYY
557658*                 THRU 2000-INTERNAL-MMDDYY-X
 
557658*        WHEN L1650-INTERNAL-DDMMYY
557658*             PERFORM  3000-INTERNAL-DDMMYY
557658*                 THRU 3000-INTERNAL-DDMMYY-X
 
557658*        WHEN L1650-INTERNAL-YYMMDD
557658*             PERFORM  4000-INTERNAL-YYMMDD
557658*                 THRU 4000-INTERNAL-YYMMDD-X
 
               WHEN L1650-INTERNAL-MMDDYY-W-SLASH
                    PERFORM  5000-INT-MMDDYY-SLASH
                        THRU 5000-INT-MMDDYY-SLASH-X
 
557697         WHEN L1650-INTERNAL-MMDDYY-SL-SFB
557697              PERFORM  5100-INT-MMDDYY-SLASH-SFB
557697                  THRU 5100-INT-MMDDYY-SLASH-SFB-X
557697
               WHEN L1650-INTERNAL-DDMMYY-W-SLASH
                    PERFORM  6000-INT-DDMMYY-SLASH
                        THRU 6000-INT-DDMMYY-SLASH-X
 
557697         WHEN L1650-INTERNAL-DDMMYY-SL-SFB
557697              PERFORM  6100-INT-DDMMYY-SLASH-SFB
557697                  THRU 6100-INT-DDMMYY-SLASH-SFB-X
557697
               WHEN L1650-INTERNAL-LONG
                    PERFORM  7000-INTERNAL-LONG
                        THRU 7000-INTERNAL-LONG-X
 
557697         WHEN L1650-INTERNAL-LONG-SFB
557697              PERFORM  7100-INTERNAL-LONG-SFB
557697                  THRU 7100-INTERNAL-LONG-SFB-X
557697
               WHEN L1650-INTERNAL-MMMDDYYYY
                    PERFORM  8000-INTERNAL-MMMDDYYYY
                        THRU 8000-INTERNAL-MMMDDYYYY-X
 
557697         WHEN L1650-INTERNAL-MMMDDYYYY-SFB
557697              PERFORM  8100-INT-MMMDDYYYY-SFB
557697                  THRU 8100-INT-MMMDDYYYY-SFB-X
557697
               WHEN L1650-INTERNAL-MMMMMMDDYYYY
                    PERFORM  9000-INT-MMMMMMDDYYYY
                        THRU 9000-INT-MMMMMMDDYYYY-X
 
               WHEN OTHER
                    SET LDTLK-NOT-VALID             TO TRUE
                    SET L1650-RETRN-INVALID-REQUEST TO TRUE
 
           END-EVALUATE.
 
       1000-PROCESS-DATE-X.
           EXIT.
      /
557658*---------------------
557658*2000-INTERNAL-MMDDYY.
557658*---------------------
 
557658*    MOVE LDTLK-DD-1   TO LDTLK-USA-DD.
557658*    MOVE LDTLK-MM-1   TO LDTLK-USA-MM.
557658*    MOVE LDTLK-YYYY-1 TO LDTLK-USA-YY.
557658*    MOVE LDTLK-USA    TO L1650-CONVERT-DATE.
 
557658*2000-INTERNAL-MMDDYY-X.
557658*    EXIT.
 
557658*---------------------
557658*3000-INTERNAL-DDMMYY.
557658*---------------------
 
557658*    MOVE LDTLK-DD-1   TO LDTLK-CAN-DD.
557658*    MOVE LDTLK-MM-1   TO LDTLK-CAN-MM.
557658*    MOVE LDTLK-YYYY-1 TO LDTLK-CAN-YY.
557658*    MOVE LDTLK-CAN    TO L1650-CONVERT-DATE.
 
557658*3000-INTERNAL-DDMMYY-X.
557658*    EXIT.
 
557658*---------------------
557658*4000-INTERNAL-YYMMDD.
557658*---------------------
 
557658*    MOVE LDTLK-DD-1   TO LDTLK-SORT-DD.
557658*    MOVE LDTLK-MM-1   TO LDTLK-SORT-MM.
557658*    MOVE LDTLK-YYYY-1 TO LDTLK-SORT-YY.
557658*    MOVE LDTLK-SORT   TO L1650-CONVERT-DATE.
 
557658*4000-INTERNAL-YYMMDD-X.
557658*    EXIT.
 
      *----------------------
       5000-INT-MMDDYY-SLASH.
      *----------------------
 
           MOVE LDTLK-DD-1    TO LDTLK-MOD-USA-DD.
           MOVE LDTLK-MM-1    TO LDTLK-MOD-USA-MM.
           MOVE LDTLK-YYYY-1  TO LDTLK-MOD-USA-CCYY.
           MOVE '/'           TO LDTLK-MOD-USA-SLASH-1.
           MOVE '/'           TO LDTLK-MOD-USA-SLASH-2.
           MOVE LDTLK-MOD-USA TO L1650-CONVERT-DATE.
 
       5000-INT-MMDDYY-SLASH-X.
           EXIT.
 
557697*--------------------------
557697 5100-INT-MMDDYY-SLASH-SFB.
557697*--------------------------
557697
557697     MOVE LDTLK-DD-1    TO LDTLK-MOD-USA-DD.
557697     MOVE LDTLK-MM-1    TO LDTLK-MOD-USA-MM.
557697
557697     IF  LDTLK-YYYY-1 = ZEROS
557697         MOVE SPACES    TO LDTLK-MOD-USA-CCYY-SFB
557697         MOVE SPACE     TO LDTLK-MOD-USA-SLASH-2
557697     ELSE
557697         MOVE LDTLK-YYYY-1
557697                        TO LDTLK-MOD-USA-CCYY
557697         MOVE '/'       TO LDTLK-MOD-USA-SLASH-2
557697     END-IF.
557697
557697     MOVE '/'           TO LDTLK-MOD-USA-SLASH-1.
557697     MOVE LDTLK-MOD-USA TO L1650-CONVERT-DATE.
557697
557697 5100-INT-MMDDYY-SLASH-SFB-X.
557697     EXIT.
557697
      *----------------------
       6000-INT-DDMMYY-SLASH.
      *----------------------
 
           MOVE LDTLK-DD-1    TO LDTLK-MOD-CAN-DD.
           MOVE LDTLK-MM-1    TO LDTLK-MOD-CAN-MM.
           MOVE LDTLK-YYYY-1  TO LDTLK-MOD-CAN-CCYY.
           MOVE '/'           TO LDTLK-MOD-CAN-SLASH-1.
           MOVE '/'           TO LDTLK-MOD-CAN-SLASH-2.
           MOVE LDTLK-MOD-CAN TO L1650-CONVERT-DATE.
 
       6000-INT-DDMMYY-SLASH-X.
           EXIT.
 
557697*--------------------------
557697 6100-INT-DDMMYY-SLASH-SFB.
557697*--------------------------
557697
557697     MOVE LDTLK-DD-1    TO LDTLK-MOD-CAN-DD.
557697     MOVE LDTLK-MM-1    TO LDTLK-MOD-CAN-MM.
557697
557697     IF  LDTLK-YYYY-1 = ZEROS
557697         MOVE SPACES    TO LDTLK-MOD-CAN-CCYY-SFB
557697         MOVE SPACE     TO LDTLK-MOD-CAN-SLASH-2
557697     ELSE
557697         MOVE LDTLK-YYYY-1
557697                        TO LDTLK-MOD-CAN-CCYY
557697         MOVE '/'       TO LDTLK-MOD-CAN-SLASH-2
557697     END-IF.
557697
557697     MOVE '/'           TO LDTLK-MOD-CAN-SLASH-1.
557697     MOVE LDTLK-MOD-CAN TO L1650-CONVERT-DATE.
557697
557697 6100-INT-DDMMYY-SLASH-SFB-X.
557697     EXIT.
557697
      *-------------------
       7000-INTERNAL-LONG.
      *-------------------
008453
008453     PERFORM  9800-LOAD-DAYS-TABLE
008453         THRU 9800-LOAD-DAYS-TABLE-X.
008453
008453     PERFORM  9900-LOAD-MONTHS-TABLE
008453         THRU 9900-LOAD-MONTHS-TABLE-X.
 
           MOVE LDTLK-DD-1                   TO LDTLK-LONG-DD.
           MOVE LDTLK-YYYY-1                 TO LDTLK-LONG-CCYY.
 
008453*    MOVE TDTTB-MONTH-FULL (LDTLK-MM-1, LDTLK-LANG-SUB)
008453*                                      TO LDTLK-LONG-MONTH.
008453     MOVE WS-EXT(LDTLK-MM-1)           TO LDTLK-LONG-MONTH.
 
008453*    MOVE TDTPR-DAY-SUFFIX (LDTLK-DD-1, LDTLK-LANG-SUB)
008453*                                      TO LDTLK-LONG-NN.
008453     MOVE WS-DAY-SUFFIX (LDTLK-DD-1)   TO LDTLK-LONG-NN.
 
008453*    MOVE TDTPR-THE (LDTLK-LANG-SUB)   TO LDTLK-LONG-THE.
008453     MOVE WS-LONG-THE                  TO LDTLK-LONG-THE.
008453*    MOVE TDTPR-COMMA (LDTLK-LANG-SUB) TO LDTLK-LONG-COMMA.
008453     MOVE WS-LONG-COMMA                TO LDTLK-LONG-COMMA.
 
008453*    MOVE TDTPR-MONTH-PREFIX (LDTLK-MM-1, LDTLK-LANG-SUB)
008453*                                      TO LDTLK-LONG-DAY-OF.
008453     MOVE WS-MONTH-PREFIX (LDTLK-MM-1) TO LDTLK-LONG-DAY-OF.
 
           MOVE LDTLK-LONG-DATE              TO L1650-CONVERT-DATE.
 
           MOVE L1650-CONVERT-DATE           TO L0015-COMP-AREA-IN.
           PERFORM  0015-1000-COMPRESS-BLANKS
               THRU 0015-1000-COMPRESS-BLANKS-X.
           MOVE L0015-COMP-AREA-OUT          TO L1650-CONVERT-DATE.
 
       7000-INTERNAL-LONG-X.
           EXIT.
 
557697*-----------------------
557697 7100-INTERNAL-LONG-SFB.
557697*-----------------------
008453
008453     PERFORM  9800-LOAD-DAYS-TABLE
008453         THRU 9800-LOAD-DAYS-TABLE-X.
008453
008453     PERFORM  9900-LOAD-MONTHS-TABLE
008453         THRU 9900-LOAD-MONTHS-TABLE-X.
557697
557697     MOVE LDTLK-DD-1                   TO LDTLK-LONG-DD.
557697
557697     IF  LDTLK-YYYY-1 = ZEROS
557697         MOVE SPACES                   TO LDTLK-LONG-CCYY-SFB
557697         MOVE SPACES                   TO LDTLK-LONG-COMMA
557697     ELSE
557697         MOVE LDTLK-YYYY-1             TO LDTLK-LONG-CCYY
008453*        MOVE TDTPR-COMMA (LDTLK-LANG-SUB)
008453*                                      TO LDTLK-LONG-COMMA
008453         MOVE WS-LONG-COMMA            TO LDTLK-LONG-COMMA
557697     END-IF.
557697
008453*    MOVE TDTTB-MONTH-FULL (LDTLK-MM-1, LDTLK-LANG-SUB)
008453*                                      TO LDTLK-LONG-MONTH.
008453     MOVE WS-EXT(LDTLK-MM-1)           TO LDTLK-LONG-MONTH.
557697
008453*    MOVE TDTPR-DAY-SUFFIX (LDTLK-DD-1, LDTLK-LANG-SUB)
008453*                                      TO LDTLK-LONG-NN.
008453     MOVE WS-DAY-SUFFIX (LDTLK-DD-1)   TO LDTLK-LONG-NN.
557697
008453*    MOVE TDTPR-THE (LDTLK-LANG-SUB)   TO LDTLK-LONG-THE.
008453     MOVE WS-LONG-THE                  TO LDTLK-LONG-THE.
557697
008453*    MOVE TDTPR-MONTH-PREFIX (LDTLK-MM-1, LDTLK-LANG-SUB)
008453*                                      TO LDTLK-LONG-DAY-OF.
008453     MOVE WS-MONTH-PREFIX (LDTLK-MM-1) TO LDTLK-LONG-DAY-OF.
557697
557697     MOVE LDTLK-LONG-DATE              TO L1650-CONVERT-DATE.
557697
557697     MOVE L1650-CONVERT-DATE           TO L0015-COMP-AREA-IN.
557697     PERFORM  0015-1000-COMPRESS-BLANKS
557697         THRU 0015-1000-COMPRESS-BLANKS-X.
557697     MOVE L0015-COMP-AREA-OUT          TO L1650-CONVERT-DATE.
557697
557697 7100-INTERNAL-LONG-SFB-X.
557697     EXIT.
557697
      *------------------------
       8000-INTERNAL-MMMDDYYYY.
      *------------------------
 
           MOVE LDTLK-DD-1          TO LDTLK-ABBREV-DD.
           MOVE LDTLK-YYYY-1        TO LDTLK-ABBREV-CCYY.
 
008453*    MOVE TDTTB-MONTH-ABBREV (LDTLK-MM-1, LDTLK-LANG-SUB)
008453*                             TO LDTLK-ABBREV-MMM.
008453*--- GET THE ABRREV MONTHS TABLE FROM WGLOB --*
008453     MOVE WGLOB-MOS-ABBR-TXT  TO WS-MMM-TABLE.
008453     MOVE WS-MMM(LDTLK-MM-1)  TO LDTLK-ABBREV-MMM.
 
           MOVE '.'                 TO LDTLK-ABBREV-PERIOD.
           MOVE ','                 TO LDTLK-ABBREV-COMMA.
           MOVE LDTLK-ABBREV-DATE   TO L1650-CONVERT-DATE.
 
           MOVE L1650-CONVERT-DATE  TO L0015-COMP-AREA-IN.
           PERFORM  0015-1000-COMPRESS-BLANKS
               THRU 0015-1000-COMPRESS-BLANKS-X.
           MOVE L0015-COMP-AREA-OUT TO L1650-CONVERT-DATE.
 
       8000-INTERNAL-MMMDDYYYY-X.
           EXIT.
 
557697*----------------------------
557697 8100-INT-MMMDDYYYY-SFB.
557697*----------------------------
557697
557697     MOVE LDTLK-DD-1          TO LDTLK-ABBREV-DD.
557697     IF LDTLK-YYYY-1 = ZEROS
557697         MOVE SPACES          TO LDTLK-ABBREV-CCYY-SFB
557697         MOVE SPACES          TO LDTLK-ABBREV-COMMA
557697     ELSE
557697         MOVE LDTLK-YYYY-1    TO LDTLK-ABBREV-CCYY
557697         MOVE ','             TO LDTLK-ABBREV-COMMA
557697     END-IF.
557697
008453*    MOVE TDTTB-MONTH-ABBREV (LDTLK-MM-1, LDTLK-LANG-SUB)
008453*                             TO LDTLK-ABBREV-MMM.
008453*--- GET THE ABRREV MONTHS TABLE FROM WGLOB --*
008453     MOVE WGLOB-MOS-ABBR-TXT  TO WS-MMM-TABLE.
008453     MOVE WS-MMM(LDTLK-MM-1)  TO LDTLK-ABBREV-MMM.
557697
557697     MOVE '.'                 TO LDTLK-ABBREV-PERIOD.
557697     MOVE LDTLK-ABBREV-DATE   TO L1650-CONVERT-DATE.
557697
557697     MOVE L1650-CONVERT-DATE  TO L0015-COMP-AREA-IN.
557697     PERFORM  0015-1000-COMPRESS-BLANKS
557697         THRU 0015-1000-COMPRESS-BLANKS-X.
557697     MOVE L0015-COMP-AREA-OUT TO L1650-CONVERT-DATE.
557697
557697 8100-INT-MMMDDYYYY-SFB-X.
557697     EXIT.
557697
      *----------------------
       9000-INT-MMMMMMDDYYYY.
      *----------------------
 
008453     PERFORM  9900-LOAD-MONTHS-TABLE
008453         THRU 9900-LOAD-MONTHS-TABLE-X.
008453
           MOVE LDTLK-DD-1          TO LDTLK-MOD-DD.
           MOVE LDTLK-YYYY-1        TO LDTLK-MOD-CCYY.
 
008453*    MOVE TDTTB-MONTH-FULL (LDTLK-MM-1, LDTLK-LANG-SUB)
008453*                             TO LDTLK-MOD-MMMMMM.
008453     MOVE WS-EXT(LDTLK-MM-1)  TO LDTLK-MOD-MMMMMM.
 
           MOVE SPACE               TO LDTLK-MOD-SPACE-1.
           MOVE ','                 TO LDTLK-MOD-COMMA.
           MOVE SPACE               TO LDTLK-MOD-SPACE-2.
           MOVE LDTLK-MODIFIED-DATE TO L1650-CONVERT-DATE.
 
           MOVE L1650-CONVERT-DATE  TO L0015-COMP-AREA-IN.
           PERFORM  0015-1000-COMPRESS-BLANKS
               THRU 0015-1000-COMPRESS-BLANKS-X.
           MOVE L0015-COMP-AREA-OUT TO L1650-CONVERT-DATE.
 
       9000-INT-MMMMMMDDYYYY-X.
           EXIT.
      /
008453*---------------------
008453 9800-LOAD-DAYS-TABLE.
008453*---------------------
008453*
008453*--- SET UP USER LANG TO CALL 2490 ---*
008453     MOVE LDTLK-USER-LANG              TO WGLOB-USER-LANG.
008453*
008453*--- GET MONTHS PREFIXES TABLE INTO THE WS FIELD --*
008453     PERFORM 2490-1000-BUILD-PARM-INFO
008453         THRU 2490-1000-BUILD-PARM-INFO-X
008453     MOVE 'XSDU1640'                   TO L2490-TXT-SRC-ID
008453     MOVE '00003'                      TO L2490-TXT-SRC-REF-ID
008453     PERFORM 2490-1000-RETRIEVE-TEXT
008453         THRU 2490-1000-RETRIEVE-TEXT-X.
008453     MOVE L2490-TXT-STR-TXT TO WS-MONTHS-PREFIXES-TABLE.
008453
008453*--- GET DAYS, COMMA AND 'THE ' TABLE INTO WS FIELD --*
008453     MOVE '00004'                      TO L2490-TXT-SRC-REF-ID
008453     PERFORM 2490-1000-RETRIEVE-TEXT
008453         THRU 2490-1000-RETRIEVE-TEXT-X.
008453     MOVE L2490-TXT-STR-TXT TO WS-DAYS-SUFFIXES-COMMA-TABLE.
008453
008453 9800-LOAD-DAYS-TABLE-X.
008453     EXIT.
008453
008453*-----------------------
008453 9900-LOAD-MONTHS-TABLE.
008453*-----------------------
008453*
008453*--- SET UP USER LANG TO CALL 2490 ---*
008453     MOVE LDTLK-USER-LANG              TO WGLOB-USER-LANG.
008453*
008453*--- GET THE EXTENDED MONTHS TABLE INTO THE WS FIELD --*
008453     PERFORM 2490-1000-BUILD-PARM-INFO
008453         THRU 2490-1000-BUILD-PARM-INFO-X
008453     MOVE 'XSDU1640'                   TO L2490-TXT-SRC-ID
008453     MOVE '00002'                      TO L2490-TXT-SRC-REF-ID
008453     PERFORM 2490-1000-RETRIEVE-TEXT
008453         THRU 2490-1000-RETRIEVE-TEXT-X.
008453     MOVE L2490-TXT-STR-TXT TO WS-EXT-TABLE.
008453
008453 9900-LOAD-MONTHS-TABLE-X.
008453     EXIT.
      /
      *****************************************************************
      *  LINKAGE PROCESSING COPYBOOKS                                 *
      *****************************************************************
54-001 COPY XCPL0015.
008453 COPY XCPS2490.
008453 COPY XCPL2490.
      *****************************************************************
      **                 END OF PROGRAM XSDU1650                     **
      *****************************************************************
