      *************************
       IDENTIFICATION DIVISION.
      *************************

       PROGRAM-ID. XSLU0020.

       COPY XCWWCRHT.

      *****************************************************************
      **  MEMBER :  XSLU0020                                         **
      **  REMARKS:  NEW BUSINESS AND ADMIN SECURITY EXIT PROGRAM.    **
      **            THIS MODULE PROCESSES REQUESTS FOR A USER TO     **
      **            CONNECT, DISCONNECT OR LOGOFF THE ADMIN OR NBS   **
      **            APPLICATIONS.  IT ALSO PROCESSES REQUESTS TO     **
      **            DETERMINE THE STATUS OF AN APPLICATION, OR       **
      **            INITIALIZE, RESET, CLOSE OR PROHIBIT ACCESS TO   **
      **            AN APPLICATION.                                  **
      **                                                             **
      **  DOMAIN :  SY                                               **
      **  CLASS  :  UT                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
008453**  31MAR98  552    ADD DATE FORMATTING TO GLOBAL AREA         **
008455**  31MAR98  552    ADD NUMERIC FORMATTING TO GLOBAL AREA      **
007766**  30OCT98  56     ARCHITECTURE CHANGES TO SUPPORT PASSING    **
007766**                  PARAMETERS VIA AN ADDRESS                  **
005409**  30OCT98  56     MODIFICATIONS FOR LEAP YEAR                **
009909**  30OCT98  56     REMOVE TERMINAL COUNTER ON MAST            **
010418**  30OCT98  56     ADD SUB-CO TO THE KEY OF USER              **
014590**  15DEC99  60     ARCHITECTURAL CHANGES                      **
014590**  15DEC99  60     ARCHITECTURAL CHANGES                      **
016141**  30JUN00  602J   JAPANESE CURRENCY SYMBOL                   **
017150**  09FEB01  612J   CURRENCY SCALING                           **
PF 13 **  6.2      BMB    PATHFINDER 1.2 APPLIED AS PER 1.3 RELEASE  **
MP161N**  21DEC11  CTS    CHANGES TO MAKE WEBSERVICE WORKING WHILE   **
MP161N**                  BATCH RUN.                                 **
      *****************************************************************
      /
      **********************
       ENVIRONMENT DIVISION.
      **********************

      ***************
       DATA DIVISION.
      ***************

       WORKING-STORAGE SECTION.

       COPY XCWWPGWS REPLACING '$VAR1' BY 'XSLU0020'.

       COPY SQLCA.
       COPY XCWLPTR.

014590*COPY XCWL0030.


       01  WS-WORKING-STORAGE.
           05  WS-SUB                       PIC S9(04) COMP.
           05  WS-DELETE-COUNTER            PIC S9(04) COMP.
           05  WS-HOLD-COMPANY-CODE         PIC X(02).
      /
       COPY XCWWWKDT.
       COPY XCWLDTLK.
      /
       COPY XCWL1640.
      /
       COPY CCFWMAST.
       COPY CCFRMAST.
      /
       COPY CCFWUSER.
       COPY CCFRUSER.
      /
       COPY XCFWUSES.
014590 COPY XCFWUSEB.
       COPY XCFRUSES.
      /
       COPY CCFWEDIT.
       COPY CCFREDIT.
      /
016141 COPY XCFWXTAB.
016141 COPY XCFRXTAB.

       COPY CCWW0010.
      /
       COPY XCFWCTRY.
       COPY XCFRCTRY.
      /
       COPY XCFWCRCY.
       COPY XCFRCRCY.
      /
      *****************
       LINKAGE SECTION.
      *****************

       01   DFHCOMMAREA.

       02  WGLOB-GLOBAL-AREA.
       COPY XCWWGLOB.
       COPY XCWL0020.
      /

      ********************
       PROCEDURE DIVISION.
      ********************


      *--------------
       0000-MAINLINE.
      *--------------


      *
      * INITIALIZATION
      *

007766     SET ADDRESS OF L0020-PARM-AREA    TO WGLOB-PARM-ADDR-PTR (1).

           MOVE WGLOB-COMPANY-CODE         TO WS-HOLD-COMPANY-CODE.
           MOVE L0020-CO-ID                TO WGLOB-COMPANY-CODE.

      *
      * PROCESS REQUEST
      *

           EVALUATE TRUE

           WHEN L0020-REQ-APPL-STATUS
                PERFORM  3000-PROCESS-STATUS
                    THRU 3000-PROCESS-STATUS-X

           WHEN L0020-REQ-SIGN-ON
                PERFORM  3100-PROCESS-SIGN-ON
                    THRU 3100-PROCESS-SIGN-ON-X

           WHEN L0020-REQ-DISCONNECT
                PERFORM  3200-PROCESS-DISCONNECT
                    THRU 3200-PROCESS-DISCONNECT-X

           WHEN L0020-REQ-LOGOFF
                PERFORM  3300-PROCESS-LOGOFF
                    THRU 3300-PROCESS-LOGOFF-X

           WHEN L0020-REQ-INIT-APPL
                PERFORM  3400-PROCESS-MASTI
                    THRU 3400-PROCESS-MASTI-X

           WHEN L0020-REQ-CLOSE-APPL
                PERFORM  3500-PROCESS-MASTO
                    THRU 3500-PROCESS-MASTO-X

           WHEN L0020-REQ-FORCE-INIT-APPL
                PERFORM  3600-PROCESS-FORCE
                    THRU 3600-PROCESS-FORCE-X

           WHEN L0020-REQ-PROHIBIT-ACCESS
                PERFORM  3700-PROCESS-STOP
                    THRU 3700-PROCESS-STOP-X

           WHEN L0020-REQ-START-ACCESS
                PERFORM  3800-PROCESS-START
                    THRU 3800-PROCESS-START-X

           WHEN L0020-REQ-CONNECT
                PERFORM  3900-PROCESS-CONNECT
                    THRU 3900-PROCESS-CONNECT-X

           END-EVALUATE.

      *
      * FINIALIZATION
      *

           MOVE WS-HOLD-COMPANY-CODE TO WGLOB-COMPANY-CODE.

       COPY XCCPRETN.

           GOBACK.

       0000-MAINLINE-X.
           EXIT.
      /
      *--------------------
       3000-PROCESS-STATUS.
      *--------------------

           PERFORM  MAST-1000-READ
               THRU MAST-1000-READ-X.

008453*    INTIALIZE DATE AND NUMERIC FORMATTING PARAMETERS
008453*
008453     PERFORM  3010-INITIALIZE-FORMAT-PARMS
008453         THRU 3010-INITIALIZE-FORMAT-PARMS-X.
008453
MP161N*    IF  NOT WMAST-IO-OK
MP161N*    OR  RMAST-APPL-CTL-PRCES-DT = WWKDT-ZERO-DT
MP161N*    OR  NOT RMAST-APPL-STAT-AVAILABLE
MP161N     IF  (NOT WMAST-IO-OK
MP161N     OR  RMAST-APPL-CTL-PRCES-DT = WWKDT-ZERO-DT
MP161N     OR  NOT RMAST-APPL-STAT-AVAILABLE)
MP161N     AND NOT L0020-CONCURRENT-YES           
               SET L0020-RES-CLOSE-APPL      TO TRUE
               GO TO 3000-PROCESS-STATUS-X
           END-IF.
           IF  RMAST-STOP-SIGN-ON
               SET L0020-RES-PROHIBIT-ACCESS TO TRUE
           ELSE
               SET L0020-RES-INIT-APPL       TO TRUE
           END-IF.
008453*
           MOVE RMAST-APPL-CTL-PRCES-DT      TO L0020-PROCESS-DATE.
           MOVE RMAST-APPL-CTL-PRCES-DT      TO L1640-INTERNAL-DATE.
           PERFORM  1640-2000-INTERNAL-TO-EXT
               THRU 1640-2000-INTERNAL-TO-EXT-X.
           MOVE L1640-EXTERNAL-DATE          TO L0020-PROCESS-DATE-DISP.

014590     IF  L0020-USER-SESN-ID = SPACE
               MOVE RMAST-APPL-CTL-CTRY-CD   TO L0020-COUNTRY-CODE
               MOVE RMAST-APPL-CTL-CRCY-CD   TO L0020-CURRENCY-CODE
               GO TO 3000-PROCESS-STATUS-X
           END-IF.

014590     MOVE L0020-USER-SESN-ID           TO WUSES-USER-SESN-ID.
010418
010418     PERFORM  USES-1000-READ
010418         THRU USES-1000-READ-X.
010418
010418     IF  WUSES-IO-OK
010418         MOVE RUSES-USER-SESN-BTCH-NUM TO L0020-BATCH-NUMBER
010418     END-IF.

           MOVE RMAST-APPL-CTL-CTRY-CD       TO L0020-COUNTRY-CODE.
           MOVE RMAST-APPL-CTL-CRCY-CD       TO L0020-CURRENCY-CODE.

       3000-PROCESS-STATUS-X.
           EXIT.
      /
008453******************************
008453 3010-INITIALIZE-FORMAT-PARMS.
008453******************************
008453*
008453***  IF 3270 ENVIRONMENT, OVERRIDE DATE PARAMETERS WITH DEFAULT
008453*
008453     IF  WGLOB-ENVRMNT-BATCH OR
008453         WGLOB-ENVRMNT-GUI
008453         PERFORM  3011-INITIALIZE-DATE-PARMS
008453             THRU 3011-INITIALIZE-DATE-PARMS-X
008453     ELSE
008453         MOVE W0010-DEF-DT-FRMT-CD           TO
008453                                       WGLOB-DT-FRMT-CD
008455         MOVE W0010-DEF-DT-SEPARATOR-SYMBL   TO
008453                                       WGLOB-DT-SEPARATOR-SYMBL
008455         MOVE W0010-DEF-DT-ZERO-SUPRES-IND   TO
008453                                       WGLOB-DT-ZERO-SUPRES-IND
008453     END-IF.
008453*
008453*    INTIALIZE NUMERIC FORMATTING PARAMETERS
008453*
008453     PERFORM  3012-INITIALIZE-NUM-PARMS
008453         THRU 3012-INITIALIZE-NUM-PARMS-X.

016141     PERFORM  9000-SET-CRCY-SYMBL
016141         THRU 9000-SET-CRCY-SYMBL-X.

008453
008453 3010-INITIALIZE-FORMAT-PARMS-X.
008453     EXIT.
008453
008453
008453****************************
008453 3011-INITIALIZE-DATE-PARMS.
008453****************************
008453*
008453***  GET FORMATTING PARAMETERS FROM CTRY TABLE
008453*
008453     MOVE WGLOB-COMPANY-CODE         TO WCTRY-CO-ID.
008453     MOVE L0020-COUNTRY-CODE         TO WCTRY-CTRY-CD.
008453
008453     PERFORM  CTRY-1000-READ
008453         THRU CTRY-1000-READ-X.
008453
008453     IF WCTRY-IO-OK
008453         MOVE RCTRY-CTRY-DT-FRMT-CD TO WGLOB-DT-FRMT-CD
008453         MOVE RCTRY-CTRY-DT-SPRT-CD TO WGLOB-DT-SEPARATOR-SYMBL
008453         MOVE RCTRY-CTRY-LEAD-ZERO-IND
008455                                    TO WGLOB-DT-ZERO-SUPRES-IND
008453         GO TO   3011-INITIALIZE-DATE-PARMS-X
008453     END-IF.
008453
008453     MOVE WGLOB-COMPANY-CODE         TO WCTRY-CO-ID.
008453     MOVE RMAST-APPL-CTL-CTRY-CD     TO WCTRY-CTRY-CD.
008453
008453     PERFORM  CTRY-1000-READ
008453         THRU CTRY-1000-READ-X.
008453
008453     IF WCTRY-IO-OK
008453         MOVE RCTRY-CTRY-DT-FRMT-CD TO WGLOB-DT-FRMT-CD
008453         MOVE RCTRY-CTRY-DT-SPRT-CD TO WGLOB-DT-SEPARATOR-SYMBL
008453         MOVE RCTRY-CTRY-LEAD-ZERO-IND
008455                                    TO WGLOB-DT-ZERO-SUPRES-IND
008453     ELSE
008453         MOVE W0010-DEF-DT-FRMT-CD           TO
008453                                       WGLOB-DT-FRMT-CD
008455         MOVE W0010-DEF-DT-SEPARATOR-SYMBL   TO
008453                                       WGLOB-DT-SEPARATOR-SYMBL
008455         MOVE W0010-DEF-DT-ZERO-SUPRES-IND   TO
008453                                       WGLOB-DT-ZERO-SUPRES-IND
008453     END-IF.
008453
008453 3011-INITIALIZE-DATE-PARMS-X.
008453     EXIT.
008455
008455
008455****************************
008453 3012-INITIALIZE-NUM-PARMS.
008455****************************
008455*
008455***  GET FORMATTING PARAMETERS FROM CRCY TABLE
008455*
008455     MOVE WGLOB-COMPANY-CODE         TO WCRCY-CO-ID.
008455     MOVE L0020-CURRENCY-CODE        TO WCRCY-CRCY-CD.
008455
008455     PERFORM  CRCY-1000-READ
008455         THRU CRCY-1000-READ-X.
008455
008455     IF WCRCY-IO-OK
008455         MOVE RCRCY-CRCY-SYMBL-CD       TO WGLOB-CRCY-SYMBL
008455         MOVE RCRCY-CRCY-THOU-SPRT-CD   TO WGLOB-THOUSANDS-SYMBL
008455         MOVE RCRCY-CRCY-DCML-SPRT-CD   TO WGLOB-DCML-SYMBL
008455         MOVE RCRCY-CRCY-NEG-PLACE-CD   TO WGLOB-SIGN-POSN-CD
008455         MOVE RCRCY-CRCY-PLACE-CD       TO WGLOB-CRCY-POSN-CD
017150         MOVE RCRCY-CRCY-SCALE-QTY      TO WGLOB-CRCY-SCALE-QTY
008455         GO TO  3012-INITIALIZE-NUM-PARMS-X
008455     END-IF.
008453
008455     MOVE WGLOB-COMPANY-CODE         TO WCRCY-CO-ID.
008455     MOVE RMAST-APPL-CTL-CRCY-CD     TO WCRCY-CRCY-CD.
008455
008455     PERFORM  CRCY-1000-READ
008455         THRU CRCY-1000-READ-X.
008455
008455     IF WCRCY-IO-OK
008455         MOVE RCRCY-CRCY-SYMBL-CD       TO WGLOB-CRCY-SYMBL
008455         MOVE RCRCY-CRCY-THOU-SPRT-CD   TO WGLOB-THOUSANDS-SYMBL
008455         MOVE RCRCY-CRCY-DCML-SPRT-CD   TO WGLOB-DCML-SYMBL
008455         MOVE RCRCY-CRCY-NEG-PLACE-CD   TO WGLOB-SIGN-POSN-CD
008455         MOVE RCRCY-CRCY-PLACE-CD       TO WGLOB-CRCY-POSN-CD
017150         MOVE RCRCY-CRCY-SCALE-QTY      TO WGLOB-CRCY-SCALE-QTY
008453     ELSE
008455         MOVE W0010-DEF-CRCY-SYMBL      TO WGLOB-CRCY-SYMBL
008455         MOVE W0010-DEF-THOUSANDS-SYMBL TO WGLOB-THOUSANDS-SYMBL
008455         MOVE W0010-DEF-DCML-SYMBL      TO WGLOB-DCML-SYMBL
008455         MOVE W0010-DEF-SIGN-POSN-CD    TO WGLOB-SIGN-POSN-CD
008455         MOVE W0010-DEF-CRCY-POSN-CD    TO WGLOB-CRCY-POSN-CD
017150         MOVE W0010-DEF-CRCY-SCALE-QTY  TO WGLOB-CRCY-SCALE-QTY
008455     END-IF.
008455
008455 3012-INITIALIZE-NUM-PARMS-X.
008455     EXIT.

      /
      *---------------------
       3100-PROCESS-SIGN-ON.
      *---------------------

           PERFORM  MAST-1000-READ-FOR-UPDATE
               THRU MAST-1000-READ-FOR-UPDATE-X.

           IF  NOT WMAST-IO-OK
               SET L0020-RES-CLOSE-APPL      TO TRUE
               GO TO 3100-PROCESS-SIGN-ON-X
           END-IF.

           IF  WMAST-COMPANY-NOT-REQUIRED
               MOVE L0020-CO-ID              TO WEDIT-ETBL-VALU-ID
               PERFORM  COMP-1000-EDIT-COMPANY
                   THRU COMP-1000-EDIT-COMPANY-X
               IF  WEDIT-IO-OK
                   CONTINUE
               ELSE
                   PERFORM  MAST-3000-UNLOCK
                       THRU MAST-3000-UNLOCK-X
                   SET L0020-RES-DATA-ERROR  TO TRUE
                   MOVE HIGH-VALUES          TO L0020-CO-ID
                   GO TO 3100-PROCESS-SIGN-ON-X
               END-IF
           END-IF.

MP161N*    IF  RMAST-APPL-CTL-PRCES-DT       =  WWKDT-ZERO-DT
MP161N*    OR  RMAST-APPL-STAT-CD  NOT       =  '1'
MP161N     IF  (RMAST-APPL-CTL-PRCES-DT       =  WWKDT-ZERO-DT
MP161N     OR  RMAST-APPL-STAT-CD  NOT       =  '1')
MP161N     AND NOT L0020-CONCURRENT-YES
               PERFORM  MAST-3000-UNLOCK
                   THRU MAST-3000-UNLOCK-X
               SET L0020-RES-CLOSE-APPL      TO TRUE
               GO TO 3100-PROCESS-SIGN-ON-X
           END-IF.

010418     PERFORM  3150-EDIT-AGAINST-USES
010418         THRU 3150-EDIT-AGAINST-USES-X.
010418     IF  WUSES-IO-OK
010418         IF  L0020-RES-EDITS-FAILURE
010418             PERFORM  MAST-3000-UNLOCK
010418                 THRU MAST-3000-UNLOCK-X
010418             GO TO 3100-PROCESS-SIGN-ON-X
010418         ELSE
010418             PERFORM  MAST-2000-REWRITE
010418                 THRU MAST-2000-REWRITE-X
010418             GO TO 3100-PROCESS-SIGN-ON-X
010418         END-IF
010418     END-IF.

           IF  RMAST-STOP-SIGN-ON
               PERFORM  MAST-3000-UNLOCK
                   THRU MAST-3000-UNLOCK-X
               SET L0020-RES-PROHIBIT-ACCESS TO TRUE
               GO TO 3100-PROCESS-SIGN-ON-X
           END-IF.

008453     MOVE WGLOB-COMPANY-CODE           TO WCRCY-CO-ID.
008453     MOVE L0020-CURRENCY-CODE          TO WCRCY-CRCY-CD.
008453     PERFORM  CRCY-1000-READ
008453         THRU CRCY-1000-READ-X.

008453     IF  WCRCY-IO-OK
008455         MOVE RCRCY-CRCY-SYMBL-CD       TO WGLOB-CRCY-SYMBL
008455         MOVE RCRCY-CRCY-THOU-SPRT-CD   TO WGLOB-THOUSANDS-SYMBL
008455         MOVE RCRCY-CRCY-DCML-SPRT-CD   TO WGLOB-DCML-SYMBL
008455         MOVE RCRCY-CRCY-NEG-PLACE-CD   TO WGLOB-SIGN-POSN-CD
008455         MOVE RCRCY-CRCY-PLACE-CD       TO WGLOB-CRCY-POSN-CD
017150         MOVE RCRCY-CRCY-SCALE-QTY      TO WGLOB-CRCY-SCALE-QTY
016141         PERFORM  9000-SET-CRCY-SYMBL
016141             THRU 9000-SET-CRCY-SYMBL-X
           ELSE
               PERFORM  MAST-3000-UNLOCK
                   THRU MAST-3000-UNLOCK-X
               SET L0020-RES-DATA-ERROR      TO TRUE
               MOVE HIGH-VALUES              TO L0020-CURRENCY-CODE
               GO TO 3100-PROCESS-SIGN-ON-X
           END-IF.

008453     MOVE WGLOB-COMPANY-CODE           TO WCTRY-CO-ID.
008453     MOVE L0020-COUNTRY-CODE           TO WCTRY-CTRY-CD.
008453     PERFORM  CTRY-1000-READ
008453         THRU CTRY-1000-READ-X.

008453     IF  WCTRY-IO-OK
008453         MOVE RCTRY-CTRY-DT-FRMT-CD TO WGLOB-DT-FRMT-CD
008453         MOVE RCTRY-CTRY-DT-SPRT-CD TO WGLOB-DT-SEPARATOR-SYMBL
008453         MOVE RCTRY-CTRY-LEAD-ZERO-IND
008455                                    TO WGLOB-DT-ZERO-SUPRES-IND
           ELSE
               PERFORM  MAST-3000-UNLOCK
                   THRU MAST-3000-UNLOCK-X
               SET L0020-RES-DATA-ERROR      TO TRUE
               MOVE HIGH-VALUES              TO L0020-COUNTRY-CODE
               GO TO 3100-PROCESS-SIGN-ON-X
           END-IF.

           SET L0020-RES-SIGN-ON             TO TRUE.

           IF  RMAST-APPL-CTL-BTCH-NUM > +9998
               MOVE 0                        TO RMAST-APPL-CTL-BTCH-NUM
           END-IF.

           ADD +1                            TO RMAST-APPL-CTL-BTCH-NUM.

           MOVE RMAST-APPL-CTL-BTCH-NUM      TO L0020-BATCH-NUMBER.
           MOVE RMAST-APPL-CTL-PRCES-DT      TO L0020-PROCESS-DATE.
           MOVE RMAST-APPL-CTL-PRCES-DT      TO L1640-INTERNAL-DATE.
           PERFORM  1640-2000-INTERNAL-TO-EXT
               THRU 1640-2000-INTERNAL-TO-EXT-X.
           MOVE L1640-EXTERNAL-DATE          TO L0020-PROCESS-DATE-DISP.
           PERFORM  MAST-2000-REWRITE
               THRU MAST-2000-REWRITE-X.

       3100-PROCESS-SIGN-ON-X.
           EXIT.
      /
      *-----------------------
       3150-EDIT-AGAINST-USES.
      *-----------------------

014590     MOVE L0020-USER-SESN-ID           TO WUSES-USER-SESN-ID.
      ****************************************************************
      ** READ THE USES RECORD FOR THE APPLICATION BEING SIGNED ON   **
      ** TO.  IF THE USER IS NOT ALREADY SIGNED ON, INCREMENT THE   **
      ** TERMINAL COUNTER.  IF THE USES RECORD IS FOUND, PREVENT    **
      ** THE USER FROM SIGNING ON TO THE SAME APPLICATION WITH      **
      ** DIFFERENT PROCESS DATES, CURRENCY, OR COUNTRY CODES.       **
      ****************************************************************

           PERFORM  USES-1000-READ
               THRU USES-1000-READ-X.

           IF  WUSES-IO-NOT-FOUND
009909         CONTINUE
           ELSE
010418         MOVE RUSES-USER-SESN-BTCH-NUM TO L0020-BATCH-NUMBER
010418         SET L0020-RES-SIGN-ON         TO TRUE
               IF  L0020-PROCESS-DATE  NOT = RUSES-USER-SESN-PRCES-DT
               OR  L0020-COUNTRY-CODE  NOT = RUSES-USER-SESN-CTRY-CD
               OR  L0020-CURRENCY-CODE NOT = RUSES-USER-SESN-CRCY-CD
                   SET L0020-RES-EDITS-FAILURE
                                             TO TRUE
010418             GO TO 3150-EDIT-AGAINST-USES-X
               END-IF
           END-IF.

       3150-EDIT-AGAINST-USES-X.
           EXIT.
      /
      *------------------------
       3200-PROCESS-DISCONNECT.
      *------------------------

010418     MOVE LOW-VALUES                TO WUSER-KEY.
010418     MOVE L0020-USER-ID             TO WUSER-USER-ID.
010418     MOVE WWKDT-LOW-TS              TO WUSER-USER-SESN-TS.
010418     MOVE HIGH-VALUES               TO WUSER-ENDBR-KEY.
010418     MOVE L0020-USER-ID             TO WUSER-ENDBR-USER-ID.
010418     MOVE WWKDT-HIGH-TS             TO WUSER-ENDBR-USER-SESN-TS.

010418     PERFORM  USER-1000-BROWSE
010418         THRU USER-1000-BROWSE-X.

010418     PERFORM  USER-2000-READ-NEXT
010418         THRU USER-2000-READ-NEXT-X.

010418     IF NOT WUSER-IO-EOF
               SET L0020-RES-DISCONNECT   TO TRUE
           ELSE
               SET L0020-RES-LOGOFF       TO TRUE
           END-IF.

010418     PERFORM  USER-3000-END-BROWSE
010418         THRU USER-3000-END-BROWSE-X.

       3200-PROCESS-DISCONNECT-X.
           EXIT.
      /
      *--------------------
       3300-PROCESS-LOGOFF.
      *--------------------

009909     PERFORM  MAST-1000-READ
009909         THRU MAST-1000-READ-X.

           IF  WMAST-IO-OK
               CONTINUE
           ELSE
               SET L0020-RES-CLOSE-APPL     TO TRUE
               GO TO 3300-PROCESS-LOGOFF-X
           END-IF.

010418     MOVE LOW-VALUES                  TO WUSER-KEY.
010418     MOVE L0020-USER-ID               TO WUSER-USER-ID.
010418     MOVE WWKDT-LOW-TS                TO WUSER-USER-SESN-TS.
010418     MOVE HIGH-VALUES                 TO WUSER-ENDBR-KEY.
010418     MOVE L0020-USER-ID               TO WUSER-ENDBR-USER-ID.
010418     MOVE WWKDT-HIGH-TS               TO WUSER-ENDBR-USER-SESN-TS.

010418     PERFORM  USER-1000-BROWSE
010418         THRU USER-1000-BROWSE-X.

010418     PERFORM  USER-2000-READ-NEXT
010418         THRU USER-2000-READ-NEXT-X.

010418     IF WUSER-IO-EOF
010418        PERFORM  USER-3000-END-BROWSE
010418            THRU USER-3000-END-BROWSE-X
              SET L0020-RES-LOGOFF          TO TRUE
              GO TO 3300-PROCESS-LOGOFF-X
           END-IF.

010418     PERFORM  USER-3000-END-BROWSE
010418         THRU USER-3000-END-BROWSE-X.

014590     MOVE L0020-USER-SESN-ID          TO WUSES-USER-SESN-ID.

           PERFORM  USES-1000-READ
               THRU USES-1000-READ-X.

           IF  WUSES-IO-NOT-FOUND
               PERFORM  3320-DELETE-ALL-USER-RECS
                   THRU 3320-DELETE-ALL-USER-RECS-X
           END-IF.

           SET L0020-RES-LOGOFF             TO TRUE.

       3300-PROCESS-LOGOFF-X.
           EXIT.

      *--------------------------
       3320-DELETE-ALL-USER-RECS.
      *--------------------------

010418     MOVE LOW-VALUES                  TO WUSER-KEY.
010418     MOVE L0020-USER-ID               TO WUSER-USER-ID.
010418     MOVE WWKDT-LOW-TS                TO WUSER-USER-SESN-TS.
010418     MOVE HIGH-VALUES                 TO WUSER-ENDBR-KEY.
010418     MOVE L0020-USER-ID               TO WUSER-ENDBR-USER-ID.
010418     MOVE WWKDT-HIGH-TS               TO WUSER-ENDBR-USER-SESN-TS.
010418     PERFORM  USER-1000-DELETE-KEY-RANGE
010418         THRU USER-1000-DELETE-KEY-RANGE-X.

       3320-DELETE-ALL-USER-RECS-X.
           EXIT.
      /
      *-------------------
       3400-PROCESS-MASTI.
      *-------------------

           PERFORM  MAST-1000-READ-FOR-UPDATE
               THRU MAST-1000-READ-FOR-UPDATE-X.

           IF  WMAST-IO-OK
               CONTINUE
           ELSE
               SET L0020-RES-PROHIBIT-ACCESS TO TRUE
               GO TO 3400-PROCESS-MASTI-X
           END-IF.

009909     MOVE L0020-CO-ID                 TO WUSEB-CO-ID.
PF 13 *    SET  WUSEB-USER-SESN-STAT-CONN TO TRUE.
PF 13      SET  WUSEB-USER-SESN-STAT-API-CONN TO TRUE.
           MOVE WUSEB-KEY                   TO WUSEB-ENDBR-KEY.
009909     PERFORM  USEB-4000-BROWSE-INDEX
009909         THRU USEB-4000-BROWSE-INDEX-X.
009909
009909     PERFORM  USEB-5000-READ-NEXT-INDEX
009909         THRU USEB-5000-READ-NEXT-INDEX-X.
009909
009909     IF  WUSEB-IO-OK
009909         PERFORM  USEB-6000-END-BROWSE-INDEX
009909             THRU USEB-6000-END-BROWSE-INDEX-X
               PERFORM  MAST-3000-UNLOCK
                   THRU MAST-3000-UNLOCK-X
               SET L0020-RES-SIGN-ON        TO TRUE
               GO TO 3400-PROCESS-MASTI-X
           END-IF.

009909     PERFORM  USEB-6000-END-BROWSE-INDEX
009909         THRU USEB-6000-END-BROWSE-INDEX-X.
009909
           IF  NOT RMAST-APPL-STAT-BTCH-COMPLETE
           AND NOT RMAST-APPL-STAT-UNAVAILABLE
               PERFORM  MAST-3000-UNLOCK
                   THRU MAST-3000-UNLOCK-X
               SET L0020-RES-FORCE-INIT-APPL TO TRUE
               GO TO 3400-PROCESS-MASTI-X
           END-IF.

           MOVE L0020-PROCESS-DATE-DISP     TO L1640-EXTERNAL-DATE.
           PERFORM  1640-3000-EXTERNAL-TO-INT
               THRU 1640-3000-EXTERNAL-TO-INT-X.

           IF  L1640-NOT-VALID
               PERFORM  MAST-3000-UNLOCK
                   THRU MAST-3000-UNLOCK-X
               SET L0020-RES-DATA-ERROR     TO TRUE
               MOVE HIGH-VALUES             TO L0020-PROCESS-DATE-DISP
               GO TO 3400-PROCESS-MASTI-X
           END-IF.

           SET RMAST-APPL-STAT-AVAILABLE    TO TRUE.
           MOVE L0020-CURRENCY-CODE         TO RMAST-APPL-CTL-CRCY-CD.
           MOVE L0020-COUNTRY-CODE          TO RMAST-APPL-CTL-CTRY-CD.
           MOVE L1640-INTERNAL-DATE         TO RMAST-APPL-CTL-PRCES-DT.
           MOVE L1640-INTERNAL-DATE         TO L0020-PROCESS-DATE.
           PERFORM  MAST-2000-REWRITE
               THRU MAST-2000-REWRITE-X.
           SET L0020-RES-INIT-APPL          TO TRUE.

       3400-PROCESS-MASTI-X.
           EXIT.
      /
      *-------------------
       3500-PROCESS-MASTO.
      *-------------------

           PERFORM  MAST-1000-READ-FOR-UPDATE
               THRU MAST-1000-READ-FOR-UPDATE-X.

           IF  WMAST-IO-OK
               CONTINUE
           ELSE
               SET L0020-RES-PROHIBIT-ACCESS TO TRUE
               GO TO 3500-PROCESS-MASTO-X
           END-IF.

009909     MOVE L0020-CO-ID                  TO WUSEB-CO-ID.
PF 13 *    SET  WUSEB-USER-SESN-STAT-CONN TO TRUE.
PF 13      SET  WUSEB-USER-SESN-STAT-API-CONN TO TRUE.
           MOVE LOW-VALUES                   TO WUSEB-USER-ID.
           MOVE WUSEB-KEY                    TO WUSEB-ENDBR-KEY.
           MOVE HIGH-VALUES                  TO WUSEB-ENDBR-USER-ID.

009909     PERFORM  USEB-4000-BROWSE-INDEX
009909         THRU USEB-4000-BROWSE-INDEX-X.
009909
009909     PERFORM  USEB-5000-READ-NEXT-INDEX
009909         THRU USEB-5000-READ-NEXT-INDEX-X.
009909
           EVALUATE TRUE

           WHEN NOT RMAST-APPL-STAT-AVAILABLE
                PERFORM  MAST-3000-UNLOCK
                    THRU MAST-3000-UNLOCK-X
                SET L0020-RES-PROHIBIT-ACCESS TO TRUE

009909     WHEN  WUSEB-IO-OK
                PERFORM  MAST-3000-UNLOCK
                    THRU MAST-3000-UNLOCK-X
                SET L0020-RES-SIGN-ON        TO TRUE

           WHEN OTHER
                SET L0020-RES-CLOSE-APPL     TO TRUE
                SET RMAST-APPL-STAT-UNAVAILABLE TO TRUE
                IF  RMAST-APPL-CTL-BTCH-NUM > +9997
                    MOVE ZERO                TO RMAST-APPL-CTL-BTCH-NUM
                END-IF
                PERFORM  MAST-2000-REWRITE
                    THRU MAST-2000-REWRITE-X

           END-EVALUATE.

009909     PERFORM  USEB-6000-END-BROWSE-INDEX
009909         THRU USEB-6000-END-BROWSE-INDEX-X.
009909
       3500-PROCESS-MASTO-X.
           EXIT.
      /
      *-------------------
       3600-PROCESS-FORCE.
      *-------------------

           PERFORM  MAST-1000-READ-FOR-UPDATE
               THRU MAST-1000-READ-FOR-UPDATE-X.

           IF  WMAST-IO-OK
               IF  RMAST-APPL-STAT-BTCH-IN-PRGRS
                   SET RMAST-APPL-STAT-BTCH-COMPLETE TO TRUE
                   SET L0020-RES-FORCE-INIT-APPL     TO TRUE
                   PERFORM  MAST-2000-REWRITE
                       THRU MAST-2000-REWRITE-X
               ELSE
                   SET L0020-RES-PROHIBIT-ACCESS TO TRUE
                   PERFORM  MAST-3000-UNLOCK
                       THRU MAST-3000-UNLOCK-X
               END-IF
           ELSE
               SET L0020-RES-PROHIBIT-ACCESS  TO TRUE
           END-IF.

       3600-PROCESS-FORCE-X.
           EXIT.
      /
      *------------------
       3700-PROCESS-STOP.
      *------------------

           PERFORM  MAST-1000-READ-FOR-UPDATE
               THRU MAST-1000-READ-FOR-UPDATE-X.

           IF  NOT WMAST-IO-OK
               SET L0020-RES-CLOSE-APPL       TO TRUE
           ELSE
               SET RMAST-STOP-SIGN-ON         TO TRUE
               PERFORM  MAST-2000-REWRITE
                   THRU MAST-2000-REWRITE-X
               SET L0020-RES-PROHIBIT-ACCESS  TO TRUE
           END-IF.

       3700-PROCESS-STOP-X.
           EXIT.
      /
      *-------------------
       3800-PROCESS-START.
      *-------------------

           PERFORM  MAST-1000-READ-FOR-UPDATE
               THRU MAST-1000-READ-FOR-UPDATE-X.

           IF  NOT WMAST-IO-OK
               SET L0020-RES-CLOSE-APPL   TO TRUE
           ELSE
               MOVE 'N'                   TO RMAST-STOP-SIGN-ON-IND
               PERFORM  MAST-2000-REWRITE
                   THRU MAST-2000-REWRITE-X
               SET L0020-RES-START-ACCESS TO TRUE
           END-IF.

       3800-PROCESS-START-X.
           EXIT.

      *--------------------
       3900-PROCESS-CONNECT.
      *--------------------

           PERFORM  MAST-1000-READ
               THRU MAST-1000-READ-X.

           IF  NOT WMAST-IO-OK
               SET L0020-RES-CLOSE-APPL      TO TRUE
               GO TO 3900-PROCESS-CONNECT-X
           END-IF.

           IF  RMAST-APPL-CTL-PRCES-DT       =  WWKDT-ZERO-DT
           OR  RMAST-APPL-STAT-CD  NOT       =  '1'
               SET L0020-RES-CLOSE-APPL      TO TRUE
               GO TO 3900-PROCESS-CONNECT-X
           END-IF.

           IF  RMAST-STOP-SIGN-ON
               SET L0020-RES-PROHIBIT-ACCESS TO TRUE
               GO TO 3900-PROCESS-CONNECT-X
           END-IF.

008453     MOVE WGLOB-COMPANY-CODE           TO WCRCY-CO-ID.
008453     MOVE L0020-CURRENCY-CODE          TO WCRCY-CRCY-CD.
008453     PERFORM  CRCY-1000-READ
008453         THRU CRCY-1000-READ-X.

008453     IF  WCRCY-IO-OK
008455         MOVE RCRCY-CRCY-SYMBL-CD       TO WGLOB-CRCY-SYMBL
008455         MOVE RCRCY-CRCY-THOU-SPRT-CD   TO WGLOB-THOUSANDS-SYMBL
008455         MOVE RCRCY-CRCY-DCML-SPRT-CD   TO WGLOB-DCML-SYMBL
008455         MOVE RCRCY-CRCY-NEG-PLACE-CD   TO WGLOB-SIGN-POSN-CD
008455         MOVE RCRCY-CRCY-PLACE-CD       TO WGLOB-CRCY-POSN-CD
017150         MOVE RCRCY-CRCY-SCALE-QTY      TO WGLOB-CRCY-SCALE-QTY
016141         PERFORM  9000-SET-CRCY-SYMBL
016141             THRU 9000-SET-CRCY-SYMBL-X
           ELSE
               SET L0020-RES-DATA-ERROR      TO TRUE
               MOVE HIGH-VALUES              TO L0020-CURRENCY-CODE
               GO TO 3900-PROCESS-CONNECT-X
           END-IF.

008453     MOVE WGLOB-COMPANY-CODE           TO WCTRY-CO-ID.
008453     MOVE L0020-COUNTRY-CODE           TO WCTRY-CTRY-CD.
008453     PERFORM  CTRY-1000-READ
008453         THRU CTRY-1000-READ-X.

008453     IF  WCTRY-IO-OK
008453         MOVE RCTRY-CTRY-DT-FRMT-CD    TO WGLOB-DT-FRMT-CD
008453         MOVE RCTRY-CTRY-DT-SPRT-CD    TO WGLOB-DT-SEPARATOR-SYMBL
008453         MOVE RCTRY-CTRY-LEAD-ZERO-IND TO WGLOB-DT-ZERO-SUPRES-IND
           ELSE
               SET L0020-RES-DATA-ERROR      TO TRUE
               MOVE HIGH-VALUES              TO L0020-COUNTRY-CODE
               GO TO 3900-PROCESS-CONNECT-X
           END-IF.

           SET L0020-RES-CONNECT             TO TRUE.

           MOVE RMAST-APPL-CTL-BTCH-NUM      TO L0020-BATCH-NUMBER.
           MOVE RMAST-APPL-CTL-PRCES-DT      TO L0020-PROCESS-DATE.
           MOVE RMAST-APPL-CTL-PRCES-DT      TO L1640-INTERNAL-DATE.
           PERFORM  1640-2000-INTERNAL-TO-EXT
               THRU 1640-2000-INTERNAL-TO-EXT-X.
           MOVE L1640-EXTERNAL-DATE          TO L0020-PROCESS-DATE-DISP.

       3900-PROCESS-CONNECT-X.
           EXIT.
      /
016141*--------------------
016141 9000-SET-CRCY-SYMBL.
016141*--------------------
016141*
016141*  TRANSLATE THE CURRENCY SYMBOL FROM IDENTIFIER TO THE ACTUAL
016141*  CODE FOR DISPLAY
016141*
016141
016141     MOVE WGLOB-CRCY-SYMBL             TO WXTAB-ETBL-VALU-ID.
016141     MOVE 'CSYMB'                      TO WXTAB-ETBL-TYP-ID.
016141     MOVE WGLOB-USER-LANG              TO WXTAB-ETBL-LANG-CD.
016141
016141     PERFORM  XTAB-1000-READ
016141         THRU XTAB-1000-READ-X.
016141
016141     IF WXTAB-IO-OK
016141         MOVE RXTAB-ETBL-DESC-TXT      TO WGLOB-CRCY-SYMBL
016141     ELSE
016141         SET L0020-RES-DATA-ERROR      TO TRUE
016141     END-IF.
016141
016141 9000-SET-CRCY-SYMBL-X.
016141     EXIT.
      /
       COPY CCPECOMP.
       COPY XCPL1640.
      /
      *****************************************************************
      *  FILE I/O PROCESS MODULES
      *****************************************************************
       COPY CCPNEDIT.
016141 COPY XCPNXTAB.
      /
       COPY CCPNMAST.
       COPY CCPUMAST.
      /
       COPY CCPAUSER.
       COPY CCPBUSER.
       COPY CCPNUSER.
       COPY CCPUUSER.
       COPY CCPXUSER.
       COPY CCPCUSER.
010418 COPY CCPGUSER.
      /
       COPY XCPNUSES.
014590 COPY XCPBUSEB.
      /
008453 COPY XCPNCTRY.
008455 COPY XCPNCRCY.

      *****************************************************************
      *  ERROR HANDLING ROUTINES
      *****************************************************************
       COPY XCCP0030.
      /
      *
      *****************************************************************
      **                 END OF PROGRAM XSLU0020                     **
      *****************************************************************
