      *************************
       IDENTIFICATION DIVISION.
      *************************

       PROGRAM-ID. XSLU8320.

       COPY XCWWCRHT.

      *****************************************************************
      **  MEMBER :  XSLU8320                                         **
      **  REMARKS:  ADDRESS LOOKUP                                   **
      **                                                             **
      **  DOMAIN :  CL                                               **
      **  CLASS  :  UT                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
LOC014**  31MAR00  601    NEW                                        **
      *****************************************************************
      /
      **********************
       ENVIRONMENT DIVISION.
      **********************

      ***************
       DATA DIVISION.
      ***************

       WORKING-STORAGE SECTION.

       COPY XCWWPGWS REPLACING '$VAR1' BY 'XSLU8320'.

       COPY SQLCA.
       COPY XCWLPTR.
      /
      ****************************************************************
      *  COMMON COPYBOOKS                                            *
      ****************************************************************
       COPY XCWWWKDT.
      /
       01  WS-WORK-AREAS.
           05  FILLER                           PIC X(01).
      /
      ****************************************************************
      *  I/O COPYBOOKS                                               *
      ****************************************************************
       COPY CCFWPSAD.
       COPY CCFRPSAD.
      /
      ****************************************************************
      *  CALLED MODULE PARAMETER INFORMATION                         *
      ****************************************************************
      /
      *****************
       LINKAGE SECTION.
      *****************
       01  DFHCOMMAREA.
           03  WGLOB-GLOBAL-AREA.
       COPY XCWWGLOB.
       COPY XCWL8320.
      /
      ********************
       PROCEDURE DIVISION.
      ********************

      *--------------
       0000-MAINLINE.
      *--------------

           SET ADDRESS OF L8320-PARM-INFO    TO WGLOB-PARM-ADDR-PTR (1).

           PERFORM  8320-0000-MAINLINE
               THRU 8320-0000-MAINLINE-X.


       COPY XCCPRETN.

       0000-MAINLINE-X.
           GOBACK.
      /
      ****************************************************************
      *  PROCESSING COPYBOOKS                                        *
      ****************************************************************
      /
       COPY XCPP8320.
      /
      ****************************************************************
      *  LINKAGE PROCESSING COPYBOOKS                                *
      ****************************************************************
      /
       COPY CCPBPSAD.
      /
      ****************************************************************
      *  FILE I/O PROCESS MODULES                                    *
      ****************************************************************
       COPY CCPNPSAD.
      /
      ****************************************************************
      *  ERROR HANDLING ROUTINES                                     *
      ****************************************************************
       COPY XCCP0030.

      *****************************************************************
      **                 END OF PROGRAM XSLU8320                     **
      *****************************************************************
