      *************************
       IDENTIFICATION DIVISION.
      *************************

       PROGRAM-ID. XSOM0160.

       COPY XCWWCRHT.

      *****************************************************************
      **  MEMBER :  XSOM0160                                         **
      **  REMARKS:  BROWSE, CREATE, INQUIRE, MAINTAIN, AND DELETE    **
      **            ENTRIES ON THE USCL TABLE.                       **
      **                                                             **
      **            THIS MODULE ALLOWS THE USER TO INQUIRE ON AND    **
      **            MAINTAIN ENTRIES ON THE USCL TABLE.              **
      **                                                             **
      **  DOMAIN :  SY                                               **
      **  CLASS  :  PD                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
53-062**  30NOV95  VK     ARCHITECTURE CHANGES TO SUPPORT GRAPHICAL  **
53-062**                  USER INTERFACE                             **
53-067**  30NOV95  VK     CHANGES TO SUPPORT I/O PROGRAMS            **
53-064**  30NOV95  TJS    SET MORE DATA INDICATOR FOR GUI            **
54-001**  01SEP96  MIG    MODIFICATIONS FOR MAINTAINABILITY          **
554712**  30SEP97  MM     REMOVE SINGLE LANGUAGE DESCRIPTION FROM    **
554712**                  DATABASE TABLES, INSTEAD, READ FROM XTAB.  **
557659**  30SEP97  MM     REPLACE RUSCL-SECUR-APPL-DEFN-CD WITH      **
557659**                  NEW FIELD RUSCL-SECUR-APPL-USE-TXT         **
557660**  30SEP97  CG     CHANGE TO STANDARD                         **
557708**  30SEP97  MM     NEW CICS ABEND PROCESSING                  **
007766**  30OCT98  56     ARCHITECTURE CHANGES TO SUPPORT PASSING    **
007766**                  PARAMETERS VIA AN ADDRESS                  **
006002**  15DEC99  60     CHANGES FOR SELECTION BOX                  **
012624**  15DEC99  60     GLOBAL SECURITY CHANGES                    **
013578**  15DEC99  60     REMOVAL OF 3270 LOGIC, MIR RENAMES         **
014660**  15DEC99  60     MESSAGE SUPPORT - REMOVAL OF XCPPMEXT      **
014590**  15DEC99  60     ARCHITECTURAL CHANGES                      **
016221**  09FEB01  612J   SYSTEM SECURITY EDIT                       **
SESCAP**  31OCT04  AC     SESSION CAP ENHANCEMENT                    **
      *****************************************************************

      /
      **********************
       ENVIRONMENT DIVISION.
      **********************
      *
      ***************
       DATA DIVISION.
      ***************

       WORKING-STORAGE SECTION.

53-062 COPY XCWWPGWS REPLACING '$VAR1' BY 'XSOM0160'.

       COPY SQLCA.
007766 COPY XCWLPTR.


014590*COPY XCWL0030.


       01  WS-WORKING-STORAGE.
           05  WS-SUB                       PIC S9(04) VALUE ZERO COMP.
           05  WS-MAX-BROWSE-LINES          PIC S9(04) VALUE +10  COMP.
           05  WS-BUS-FCN-ID                PIC X(04).
               88  WS-BUS-FCN-ID-VALID      VALUE '1940' '1941' '1942'
                                                  '1943' '1944'.
               88  WS-BUS-FCN-RETRIEVE      VALUE '1940'.
               88  WS-BUS-FCN-CREATE        VALUE '1941'.
               88  WS-BUS-FCN-UPDATE        VALUE '1942'.
               88  WS-BUS-FCN-DELETE        VALUE '1943'.
               88  WS-BUS-FCN-LIST          VALUE '1944'.
           05  WS-SECURITY-CLASS-LEVEL-IND  PIC X(01).
54-001         88  WS-SECURITY-CLASS-LEVEL-VALID VALUES '1' THRU '9'.
           05  WS-CONFIDENTIAL-ACCESS-IND   PIC X(01).
               88  WS-CONFIDENTIAL-ACCESS-VALID  VALUES 'B' 'C' 'N' 'P'.
006002*    05  WS-SECUR-DESC-TXT            PIC X(50).
006002     05  WS-SECUR-DESC-TXT            PIC X(80).
012624     05  WS-CTL-ACCT-ACCS-IND         PIC X(01).
012624         88  WS-CTL-ACCT-ACCS-VALID   VALUE 'Y' 'N'.
SESCAP     05  WS-SESN-CTL-IND              PIC X(01).
SESCAP         88  WS-SESN-CTL-VALID        VALUE 'Y' 'N'.        
SESCAP     05  WS-MIN-MAX-SESN-NUM          PIC 9(05) VALUE 0.
SESCAP     05  WS-MAX-MAX-SESN-NUM          PIC 9(05) VALUE 99999.
SESCAP     05  WS-MAX-SESN-NUM              PIC 9(05).

      /
54-001******************************************************************
54-001*  COMMON COPYBOOKS                                              *
54-001******************************************************************
       COPY XCWEBLCH.
012624 COPY XCWL0280.
012624 COPY XCWL0290.
      /
54-001******************************************************************
54-001*  INPUT PARAMETER INFORMATION                                   *
54-001******************************************************************
007766*01  WGLOB-GLOBAL-AREA.
007766*COPY XCWWGLOB.
      /
       COPY XCFWUSCL.
       COPY XCFRUSCL.
      /
       COPY XCFWXTAB.
       COPY XCFRXTAB.
      /
016221 COPY XCFWBPFS.
016221 COPY XCFRBPFS.
      /      
       COPY XCWWWKDT.
      /
      *****************
       LINKAGE SECTION.
      *****************

      *
007766 01 WGLOB-GLOBAL-AREA.
007766 COPY XCWWGLOB.
       COPY XCWM0160.
      /

       PROCEDURE DIVISION USING WGLOB-GLOBAL-AREA
53-062                          MIR-PARM-AREA.


      *--------------
       0000-MAINLINE.
      *--------------
      *
           SET MIR-RETRN-OK              TO  TRUE.

557708     PERFORM  ABND-1000-HANDLE-ABEND
557708         THRU ABND-1000-HANDLE-ABEND-X.

           PERFORM  INIT-1000-INITIALIZE
               THRU INIT-1000-INITIALIZE-X.
      *
           PERFORM  2000-PROCESS-REQUEST
               THRU 2000-PROCESS-REQUEST-X.
      *
           PERFORM  EXIT-1000-FINALIZE
               THRU EXIT-1000-FINALIZE-X.

           GOBACK.

       0000-MAINLINE-X.
           EXIT.
      /
      *--------------------
       2000-PROCESS-REQUEST.
      *--------------------

           PERFORM  9300-SETUP-MSIN-REFERENCE
               THRU 9300-SETUP-MSIN-REFERENCE-X.

           MOVE MIR-BUS-FCN-ID        TO WS-BUS-FCN-ID.
      *
      *    PROCESS SCREEN FUNCTIONS
      *
54-001     EVALUATE TRUE

54-001         WHEN WS-BUS-FCN-RETRIEVE
                  PERFORM  2100-PROCESS-RETRIEVE
                      THRU 2100-PROCESS-RETRIEVE-X

54-001         WHEN WS-BUS-FCN-CREATE
                  PERFORM  2200-PROCESS-CREATE
                      THRU 2200-PROCESS-CREATE-X

54-001         WHEN WS-BUS-FCN-UPDATE
                  PERFORM  2300-PROCESS-UPDATE
                      THRU 2300-PROCESS-UPDATE-X

54-001         WHEN WS-BUS-FCN-DELETE
                  PERFORM  2400-PROCESS-DELETE
                      THRU 2400-PROCESS-DELETE-X

54-001         WHEN WS-BUS-FCN-LIST
                  PERFORM  2500-PROCESS-LIST
                      THRU 2500-PROCESS-LIST-X

               WHEN OTHER
      *MSG: INVALID BUSINESS FUNCTION @1 FOR PROGRAM @2
                    SET MIR-RETRN-INVALD-RQST     TO  TRUE
                    MOVE 'XS00000237' TO  WGLOB-MSG-REF-INFO
                    MOVE MIR-BUS-FCN-ID
                                      TO WGLOB-MSG-PARM (1)
                    MOVE 'XSOM0160'   TO WGLOB-MSG-PARM (2)
                    PERFORM  0260-1000-GENERATE-MESSAGE
                        THRU 0260-1000-GENERATE-MESSAGE-X

54-001     END-EVALUATE.
      *
       2000-PROCESS-REQUEST-X.
           EXIT.
      /
      *---------------------
       2100-PROCESS-RETRIEVE.
      *---------------------
      *
           MOVE MIR-SECUR-CLAS-ID     TO WUSCL-SECUR-CLAS-ID.

           PERFORM  USCL-1000-READ
               THRU USCL-1000-READ-X.
      *
           IF  WUSCL-IO-OK
               PERFORM  9200-MOVE-RECORD-TO-SCREEN
                   THRU 9200-MOVE-RECORD-TO-SCREEN-X
           ELSE
               PERFORM  9100-BLANK-DATA-FIELDS
                   THRU 9100-BLANK-DATA-FIELDS-X
               MOVE WUSCL-KEY         TO WGLOB-MSG-PARM (1)
               MOVE 'XS00000001'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.
      *
       2100-PROCESS-RETRIEVE-X.
           EXIT.
      /
      *--------------------
       2200-PROCESS-CREATE.
      *--------------------
      *
           MOVE MIR-SECUR-CLAS-ID     TO WUSCL-SECUR-CLAS-ID.

           PERFORM  USCL-1000-READ
               THRU USCL-1000-READ-X.
      *
           IF  WUSCL-IO-OK
               PERFORM  9200-MOVE-RECORD-TO-SCREEN
                   THRU 9200-MOVE-RECORD-TO-SCREEN-X
               MOVE WUSCL-KEY         TO WGLOB-MSG-PARM (1)
               MOVE 'XS00000003'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               GO TO 2200-PROCESS-CREATE-X
54-001     END-IF.
      *
           PERFORM  2210-CREATE-EDITS
               THRU 2210-CREATE-EDITS-X.
      *
           IF  WGLOB-MSG-ERROR-SW > ZERO
               GO TO 2200-PROCESS-CREATE-X
54-001     END-IF.
      *
           MOVE MIR-SECUR-CLAS-ID     TO WUSCL-SECUR-CLAS-ID.
           PERFORM  USCL-1000-CREATE
               THRU USCL-1000-CREATE-X.
           PERFORM  USCL-1000-WRITE
               THRU USCL-1000-WRITE-X.
           PERFORM  9200-MOVE-RECORD-TO-SCREEN
               THRU 9200-MOVE-RECORD-TO-SCREEN-X.
      *
       2200-PROCESS-CREATE-X.
           EXIT.
      *
      *------------------
       2210-CREATE-EDITS.
      *------------------
      *
           IF  MIR-SECUR-CLAS-ID = SPACE
               MOVE 'XS01600005'      TO WGLOB-MSG-REF-INFO
557660         PERFORM 0260-1000-GENERATE-MESSAGE
557660            THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.
      *
       2210-CREATE-EDITS-X.
           EXIT.
      /
      *----------------------
       2300-PROCESS-UPDATE.
      *----------------------
      *
           MOVE MIR-SECUR-CLAS-ID     TO WUSCL-SECUR-CLAS-ID.

           PERFORM  USCL-1000-READ-FOR-UPDATE
               THRU USCL-1000-READ-FOR-UPDATE-X.

           IF  WUSCL-IO-NOT-FOUND
               PERFORM  9100-BLANK-DATA-FIELDS
                   THRU 9100-BLANK-DATA-FIELDS-X
               MOVE WUSCL-KEY         TO WGLOB-MSG-PARM (1)
               MOVE 'XS00000006'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               GO TO 2300-PROCESS-UPDATE-X
54-001     END-IF.

           PERFORM  2330-UPDATE-EDITS
               THRU 2330-UPDATE-EDITS-X.

           PERFORM  USCL-2000-REWRITE
               THRU USCL-2000-REWRITE-X.

           IF  WGLOB-MSG-ERROR-SW > ZERO
               MOVE 'XS00000008'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
           ELSE
               MOVE 'XS00000007'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.
      *
       2300-PROCESS-UPDATE-X.
           EXIT.
      /
      *--------------------
       2330-UPDATE-EDITS.
      *--------------------
      *
554712*    IF  MIR-ETBL-DESC-TXT NOT = SPACE
554712*        PERFORM  2331-EDIT-SEC-CLASS-DESC
554712*            THRU 2331-EDIT-SEC-CLASS-DESC-X
554712*    ELSE
554712*        MOVE RUSCL-SECUR-DESC-TXT     TO MIR-ETBL-DESC-TXT
554712*    END-IF.
012614*
012624*    IF  MIR-MSG-SECUR-CLAS-CD NOT = SPACE
012614*        PERFORM  2332-EDIT-MSG-CLASS
012614*            THRU 2332-EDIT-MSG-CLASS-X
012614*    ELSE
012614*        MOVE RUSCL-MSG-SECUR-CLAS-CD
012614*                               TO MIR-MSG-SECUR-CLAS-CD
012624*    END-IF.
      *
           IF  MIR-SECUR-CNFD-ACCS-CD NOT = SPACE
               PERFORM  2333-EDIT-CONFIDENTIAL-IND
                   THRU 2333-EDIT-CONFIDENTIAL-IND-X
           ELSE
               MOVE RUSCL-SECUR-CNFD-ACCS-CD
                                      TO MIR-SECUR-CNFD-ACCS-CD
54-001     END-IF.
      *
           IF  MIR-SECUR-LVL-CD NOT = SPACE
               PERFORM  2334-EDIT-CLASS-LEVEL-IND
                   THRU 2334-EDIT-CLASS-LEVEL-IND-X
           ELSE
               MOVE RUSCL-SECUR-LVL-CD               TO MIR-SECUR-LVL-CD
54-001     END-IF.
      *
012624*    IF  MIR-SECUR-APPL-USE-TXT NOT = SPACE
012624     IF  MIR-SECUR-CLAS-UWG-AMT NOT = SPACES
012624*        PERFORM  2335-EDIT-APPL-DEFN
012624*            THRU 2335-EDIT-APPL-DEFN-X
012624         PERFORM  2335-EDIT-SECUR-CLAS-UWG-AMT
012624             THRU 2335-EDIT-SECUR-CLAS-UWG-AMT-X
           ELSE
557659*        MOVE RUSCL-SECUR-APPL-DEFN-CD TO MIR-SECUR-APPL-USE-TXT
012624*        MOVE RUSCL-SECUR-APPL-USE-TXT
012624*                               TO MIR-SECUR-APPL-USE-TXT
012624         PERFORM  0290-1000-BUILD-PARM-INFO
012624             THRU 0290-1000-BUILD-PARM-INFO-X
012624         COMPUTE L0290-INPUT-NUMBER = RUSCL-SECUR-CLAS-UWG-AMT
012624                                    * 100
012624         MOVE 2                 TO L0290-PRECISION
012624         MOVE LENGTH OF MIR-SECUR-CLAS-UWG-AMT
012624                                TO L0290-MAX-OUT-LEN
012624         PERFORM  0290-1000-NUMERIC-FORMAT
012624             THRU 0290-1000-NUMERIC-FORMAT-X
012624         MOVE L0290-OUTPUT-DATA TO  MIR-SECUR-CLAS-UWG-AMT
012624     END-IF.
      *
012624     IF MIR-SECUR-CLAS-MAX-AMT NOT = SPACE
012624         PERFORM  2336-EDIT-SECUR-CLAS-MAX-AMT
012624             THRU 2336-EDIT-SECUR-CLAS-MAX-AMT-X
012624     ELSE
012624         PERFORM  0290-1000-BUILD-PARM-INFO
012624             THRU 0290-1000-BUILD-PARM-INFO-X
012624         COMPUTE L0290-INPUT-NUMBER = RUSCL-SECUR-CLAS-MAX-AMT
012624                                    * 100
012624         MOVE +2                    TO L0290-PRECISION
012624         MOVE LENGTH OF MIR-SECUR-CLAS-MAX-AMT
012624                                    TO L0290-MAX-OUT-LEN
012624         PERFORM  0290-1000-NUMERIC-FORMAT
012624             THRU 0290-1000-NUMERIC-FORMAT-X
012624         MOVE L0290-OUTPUT-DATA TO MIR-SECUR-CLAS-MAX-AMT
012624     END-IF.
      *
012624     IF MIR-CTL-ACCT-ACCS-IND NOT = SPACE
012624         PERFORM  2337-EDIT-CTL-ACCT-ACCS-IND
012624             THRU 2337-EDIT-CTL-ACCT-ACCS-IND-X
012624     ELSE
012624         MOVE RUSCL-CTL-ACCT-ACCS-IND
012624                                TO MIR-CTL-ACCT-ACCS-IND
012624     END-IF.
      *
           MOVE RUSCL-SECUR-USER-CTR  TO MIR-SECUR-USER-CTR.
      *
SESCAP     IF MIR-SESN-CTL-IND NOT = SPACES
SESCAP        PERFORM  2338-EDIT-SESN-CTL-IND
SESCAP            THRU 2338-EDIT-SESN-CTL-IND-X
SESCAP     ELSE
SESCAP        MOVE RUSCL-SESN-CTL-IND   TO MIR-SESN-CTL-IND
SESCAP     END-IF.
SESCAP     IF MIR-MAX-SESN-NUM NOT = SPACES
SESCAP        PERFORM  2339-EDIT-MAX-SESN-NUM
SESCAP            THRU 2339-EDIT-MAX-SESN-NUM-X
SESCAP     ELSE
SESCAP        MOVE RUSCL-MAX-SESN-NUM TO MIR-MAX-SESN-NUM
SESCAP     END-IF.
      *
       2330-UPDATE-EDITS-X.
           EXIT.
      /
554712*-------------------------
554712*2331-EDIT-SEC-CLASS-DESC.
554712*-------------------------
554712*
554712*    IF  MIR-ETBL-DESC-TXT = EBLCH-BLANK-FIELD-CHAR
554712*        MOVE SPACES          TO MIR-ETBL-DESC-TXT
554712*    END-IF.
554712*
554712*    MOVE MIR-ETBL-DESC-TXT         TO RUSCL-SECUR-DESC-TXT.
554712*
554712*2331-EDIT-SEC-CLASS-DESC-X.
554712*    EXIT.
      /
012624*--------------------
012624*2332-EDIT-MSG-CLASS.
012624*--------------------
012624*
012624*    IF  MIR-MSG-SECUR-CLAS-CD = EBLCH-BLANK-FIELD-CHAR
012624*        MOVE SPACES            TO MIR-MSG-SECUR-CLAS-CD
012624*    END-IF.
012624*
012624*    MOVE MIR-MSG-SECUR-CLAS-CD TO WXTAB-ETBL-VALU-ID.
012624*    PERFORM  MSGC-1000-EDIT-MESSAGE-CLASS
012624*        THRU MSGC-1000-EDIT-MESSAGE-CLASS-X.
012624*
012624*    IF  WXTAB-IO-OK
012624*        MOVE MIR-MSG-SECUR-CLAS-CD
012624*                               TO RUSCL-MSG-SECUR-CLAS-CD
012624*    ELSE
012624*        MOVE 'XS01600001'      TO WGLOB-MSG-REF-INFO
012624*        PERFORM  0260-1000-GENERATE-MESSAGE
012624*            THRU 0260-1000-GENERATE-MESSAGE-X
012624*    END-IF.
012624*
012624*2332-EDIT-MSG-CLASS-X.
012624*    EXIT.
      /
      *---------------------------
       2333-EDIT-CONFIDENTIAL-IND.
      *---------------------------
      *
           IF  MIR-SECUR-CNFD-ACCS-CD = EBLCH-BLANK-FIELD-CHAR
               MOVE SPACES            TO MIR-SECUR-CNFD-ACCS-CD
54-001     END-IF.

           MOVE MIR-SECUR-CNFD-ACCS-CD    TO WS-CONFIDENTIAL-ACCESS-IND.

           IF  WS-CONFIDENTIAL-ACCESS-VALID
               MOVE MIR-SECUR-CNFD-ACCS-CD
                                      TO RUSCL-SECUR-CNFD-ACCS-CD
           ELSE
               MOVE 'XS01600002'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.

       2333-EDIT-CONFIDENTIAL-IND-X.
           EXIT.
      /
      *--------------------------
       2334-EDIT-CLASS-LEVEL-IND.
      *--------------------------
      *
           IF  MIR-SECUR-LVL-CD = EBLCH-BLANK-FIELD-CHAR
               MOVE SPACES            TO MIR-SECUR-LVL-CD
54-001     END-IF.
      *
           MOVE MIR-SECUR-LVL-CD      TO WS-SECURITY-CLASS-LEVEL-IND.

           IF  WS-SECURITY-CLASS-LEVEL-VALID
               MOVE MIR-SECUR-LVL-CD  TO RUSCL-SECUR-LVL-CD
           ELSE
               MOVE 'XS01600003'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.
      *
       2334-EDIT-CLASS-LEVEL-IND-X.
           EXIT.
      /
      *-----------------------
012624*2335-EDIT-APPL-DEFN.
012624 2335-EDIT-SECUR-CLAS-UWG-AMT.
      *-----------------------
      *
012624*    IF  MIR-SECUR-APPL-USE-TXT = EBLCH-BLANK-FIELD-CHAR
012624     IF  MIR-SECUR-CLAS-UWG-AMT = EBLCH-BLANK-FIELD-CHAR
012624         MOVE ZEROS             TO MIR-SECUR-CLAS-UWG-AMT
012624*        MOVE SPACES            TO MIR-SECUR-APPL-USE-TXT
012624     END-IF.

557659*    MOVE MIR-SECUR-APPL-USE-TXT      TO RUSCL-SECUR-APPL-DEFN-CD.
012624*    MOVE MIR-SECUR-APPL-USE-TXT      TO RUSCL-SECUR-APPL-USE-TXT.

012624     MOVE 'N'                         TO  L0280-SIGN-IND.
012624     MOVE 2                           TO  L0280-PRECISION.
012624     MOVE LENGTH OF MIR-SECUR-CLAS-UWG-AMT TO L0280-INPUT-SIZE.
012624     COMPUTE L0280-LENGTH = L0280-INPUT-SIZE - 3.
012624     MOVE MIR-SECUR-CLAS-UWG-AMT      TO L0280-INPUT-DATA.
012624     PERFORM  0280-1000-NUMERIC-EDIT
012624         THRU 0280-1000-NUMERIC-EDIT-X.

012624     IF L0280-OK
012624        MOVE L0280-OUTPUT-DOLLAR       TO RUSCL-SECUR-CLAS-UWG-AMT
012624         PERFORM  0290-1000-BUILD-PARM-INFO
012624             THRU 0290-1000-BUILD-PARM-INFO-X
012624        COMPUTE L0290-INPUT-NUMBER = RUSCL-SECUR-CLAS-UWG-AMT
012624                                   * 100
012624        MOVE +2                TO L0290-PRECISION
012624        MOVE LENGTH OF MIR-SECUR-CLAS-UWG-AMT
012624                               TO L0290-MAX-OUT-LEN
012624        PERFORM  0290-1000-NUMERIC-FORMAT
012624            THRU 0290-1000-NUMERIC-FORMAT-X
012624        MOVE L0290-OUTPUT-DATA TO MIR-SECUR-CLAS-UWG-AMT
012624     ELSE
012624*MSG : THE UNDERWRITING MAXIMUM SHOULD BE NUMERIC
012624        MOVE 'XS01600006'             TO  WGLOB-MSG-REF-INFO
012624        PERFORM  0260-1000-GENERATE-MESSAGE
012624            THRU 0260-1000-GENERATE-MESSAGE-X
012624     END-IF.

012624*2335-EDIT-APPL-DEFN-X.
012624 2335-EDIT-SECUR-CLAS-UWG-AMT-X.
           EXIT.
      /
012624*----------------------------
012624 2336-EDIT-SECUR-CLAS-MAX-AMT.
012624*----------------------------
012624
012624     IF MIR-SECUR-CLAS-MAX-AMT = EBLCH-BLANK-FIELD-CHAR
012624         MOVE ZERO              TO MIR-SECUR-CLAS-MAX-AMT
012624     END-IF.
012624
012624     MOVE MIR-SECUR-CLAS-MAX-AMT   TO L0280-INPUT-DATA.
012624     MOVE 'N'                      TO L0280-SIGN-IND.
012624     MOVE +2                       TO L0280-PRECISION.
012624     MOVE LENGTH OF MIR-SECUR-CLAS-MAX-AMT
012624                                  TO L0280-INPUT-SIZE.
012624     COMPUTE L0280-LENGTH = L0280-INPUT-SIZE - 3.
012624     PERFORM  0280-1000-NUMERIC-EDIT
012624         THRU 0280-1000-NUMERIC-EDIT-X.
012624
012624     IF L0280-OK
012624         MOVE L0280-OUTPUT-DOLLAR
012624                                TO RUSCL-SECUR-CLAS-MAX-AMT
012624         PERFORM  0290-1000-BUILD-PARM-INFO
012624             THRU 0290-1000-BUILD-PARM-INFO-X
012624         COMPUTE L0290-INPUT-NUMBER = RUSCL-SECUR-CLAS-MAX-AMT
012624                                    * 100
012624         MOVE +2                TO L0290-PRECISION
012624         MOVE LENGTH OF MIR-SECUR-CLAS-MAX-AMT
012624                                TO L0290-MAX-OUT-LEN
012624         PERFORM  0290-1000-NUMERIC-FORMAT
012624             THRU 0290-1000-NUMERIC-FORMAT-X
012624         MOVE L0290-OUTPUT-DATA TO MIR-SECUR-CLAS-MAX-AMT
012624     ELSE
012624         MOVE 'XS01600008'      TO WGLOB-MSG-REF-INFO
012624         PERFORM  0260-1000-GENERATE-MESSAGE
012624             THRU 0260-1000-GENERATE-MESSAGE-X
012624     END-IF.
012624
012624 2336-EDIT-SECUR-CLAS-MAX-AMT-X.
012624     EXIT.
      /
012624*---------------------------
012624 2337-EDIT-CTL-ACCT-ACCS-IND.
012624*---------------------------
012624
012624     IF MIR-CTL-ACCT-ACCS-IND = EBLCH-BLANK-FIELD-CHAR
012624        MOVE 'N'                TO MIR-CTL-ACCT-ACCS-IND
012624     END-IF.
012624
012624     MOVE MIR-CTL-ACCT-ACCS-IND TO WS-CTL-ACCT-ACCS-IND.
012624     IF  WS-CTL-ACCT-ACCS-VALID
012624         MOVE MIR-CTL-ACCT-ACCS-IND
012624                                TO RUSCL-CTL-ACCT-ACCS-IND
012624     ELSE
012624* MSG: INVALID ACCOUNT ACCESS INDICATOR
012624          MOVE 'XS01600009'  TO WGLOB-MSG-REF-INFO
012624          PERFORM  0260-1000-GENERATE-MESSAGE
012624              THRU 0260-1000-GENERATE-MESSAGE-X
012624     END-IF.
012624
012624 2337-EDIT-CTL-ACCT-ACCS-IND-X.
012624     EXIT.
      /
SESCAP*-----------------------
SESCAP 2338-EDIT-SESN-CTL-IND.
SESCAP*-----------------------
SESCAP     IF MIR-SESN-CTL-IND = EBLCH-BLANK-FIELD-CHAR
SESCAP        MOVE 'N'                TO MIR-SESN-CTL-IND
SESCAP     END-IF.
SESCAP     MOVE MIR-SESN-CTL-IND TO WS-SESN-CTL-IND.
SESCAP     IF  WS-SESN-CTL-VALID
SESCAP         MOVE MIR-SESN-CTL-IND TO RUSCL-SESN-CTL-IND
SESCAP     ELSE
SESCAP* MSG: INVALID SESSION CONTROL INDICATOR
SESCAP         MOVE 'XS01600010'  TO WGLOB-MSG-REF-INFO
SESCAP         PERFORM  0260-1000-GENERATE-MESSAGE
SESCAP             THRU 0260-1000-GENERATE-MESSAGE-X
SESCAP     END-IF.
SESCAP 2338-EDIT-SESN-CTL-IND-X.
SESCAP     EXIT.
SESCAP*-----------------------
SESCAP 2339-EDIT-MAX-SESN-NUM.
SESCAP*-----------------------
SESCAP     IF MIR-MAX-SESN-NUM = EBLCH-BLANK-FIELD-CHAR
SESCAP         MOVE ZERO              TO MIR-MAX-SESN-NUM
SESCAP     END-IF.
SESCAP
SESCAP     MOVE MIR-MAX-SESN-NUM      TO L0280-INPUT-DATA.
SESCAP     MOVE 'N'                   TO L0280-SIGN-IND.
SESCAP     MOVE 5                     TO L0280-LENGTH.
SESCAP     MOVE 0                     TO L0280-PRECISION.
SESCAP     PERFORM  0280-1000-NUMERIC-EDIT
SESCAP         THRU 0280-1000-NUMERIC-EDIT-X.
SESCAP     IF L0280-OK
SESCAP         MOVE L0280-OUTPUT      TO WS-MAX-SESN-NUM
SESCAP         MOVE WS-MAX-SESN-NUM   TO RUSCL-MAX-SESN-NUM
SESCAP         MOVE RUSCL-MAX-SESN-NUM TO MIR-MAX-SESN-NUM
SESCAP     ELSE
SESCAP* MSG: INVALID MAXIMUM NUMBER OF SESSIONS
SESCAP         MOVE 'XS01600011'      TO WGLOB-MSG-REF-INFO
SESCAP         PERFORM  0260-1000-GENERATE-MESSAGE
SESCAP             THRU 0260-1000-GENERATE-MESSAGE-X
SESCAP         GO TO 2339-EDIT-MAX-SESN-NUM-X
SESCAP     END-IF.
SESCAP     IF WS-MAX-SESN-NUM < WS-MIN-MAX-SESN-NUM
SESCAP     OR WS-MAX-SESN-NUM > WS-MAX-MAX-SESN-NUM
SESCAP* MSG: MAXIMUM NUMBER OF SESSIONS OUT OF RANGE
SESCAP         MOVE 'XS01600012'      TO WGLOB-MSG-REF-INFO
SESCAP         PERFORM  0260-1000-GENERATE-MESSAGE
SESCAP             THRU 0260-1000-GENERATE-MESSAGE-X
SESCAP         GO TO 2339-EDIT-MAX-SESN-NUM-X
SESCAP     END-IF.
SESCAP 2339-EDIT-MAX-SESN-NUM-X.
SESCAP     EXIT.
      *--------------------
       2400-PROCESS-DELETE.
      *--------------------
      *
016221     PERFORM  2420-DELETE-EDIT              
016221         THRU 2420-DELETE-EDIT-X.
           
016221     IF  WGLOB-MSG-ERROR-SW > ZEROS
016221         GO TO  2400-PROCESS-DELETE-X
016221     END-IF.
           
           MOVE MIR-SECUR-CLAS-ID     TO WUSCL-SECUR-CLAS-ID.

           PERFORM  USCL-1000-READ-FOR-UPDATE
               THRU USCL-1000-READ-FOR-UPDATE-X.

           IF  WUSCL-IO-OK
               CONTINUE
           ELSE
               MOVE WUSCL-KEY         TO WGLOB-MSG-PARM (1)
               MOVE 'XS00000010'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.
      *

           IF  RUSCL-SECUR-USER-CTR > ZERO
               PERFORM  USCL-3000-UNLOCK
                   THRU USCL-3000-UNLOCK-X
               PERFORM  9200-MOVE-RECORD-TO-SCREEN
                   THRU 9200-MOVE-RECORD-TO-SCREEN-X
               MOVE 'XS01600004'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               GO TO 2400-PROCESS-DELETE-X
54-001     END-IF.

           PERFORM  USCL-1000-DELETE
               THRU USCL-1000-DELETE-X.
           MOVE 'XS00000011'          TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-1000-GENERATE-MESSAGE
               THRU 0260-1000-GENERATE-MESSAGE-X.

           PERFORM  9100-BLANK-DATA-FIELDS
               THRU 9100-BLANK-DATA-FIELDS-X.

       2400-PROCESS-DELETE-X.
           EXIT.
      /
016221*----------------
016221 2420-DELETE-EDIT.
016221*----------------
       
016221     MOVE  LOW-VALUES        TO  WBPFS-KEY.
016221     MOVE HIGH-VALUES        TO  WBPFS-ENDBR-KEY.

016221     MOVE MIR-SECUR-CLAS-ID  TO WBPFS-SECUR-CLAS-ID.
016221     MOVE MIR-SECUR-CLAS-ID  TO WBPFS-ENDBR-SECUR-CLAS-ID.

016221     PERFORM  BPFS-1000-BROWSE            
016221         THRU BPFS-1000-BROWSE-X.

016221     IF  WBPFS-IO-OK
016221         PERFORM  BPFS-2000-READ-NEXT         
016221             THRU BPFS-2000-READ-NEXT-X
016221         IF  WBPFS-IO-OK
016221*MSG: PLEASE DELETE REFEREINTIAL RECORD(S) FIRST-
016221*     DELETE NOT PROCESSED
016221             MOVE 'XS01600007'      TO WGLOB-MSG-REF-INFO
016221             PERFORM  0260-1000-GENERATE-MESSAGE
016221                 THRU 0260-1000-GENERATE-MESSAGE-X
016221         END-IF
      
016221         PERFORM  BPFS-3000-END-BROWSE        
016221             THRU BPFS-3000-END-BROWSE-X
016221     END-IF.
016221 2420-DELETE-EDIT-X.
           EXIT.
      /
      *--------------------
       2500-PROCESS-LIST.
      *--------------------
      *
           MOVE SPACES                TO MIR-SECUR-CLAS-ID-G.
012624*    MOVE SPACES                TO MIR-MSG-SECUR-CLAS-CD-G.
012624     MOVE SPACES                TO MIR-SECUR-CLAS-UWG-AMT-G.
012624     MOVE SPACES                TO MIR-SECUR-CLAS-MAX-AMT-G.
012624     MOVE SPACES                TO MIR-CTL-ACCT-ACCS-IND-G.
           MOVE SPACES                TO MIR-SECUR-CNFD-ACCS-CD-G.
           MOVE SPACES                TO MIR-SECUR-USER-CTR-G.
012624*    MOVE SPACES                TO MIR-ETBL-DESC-TXT-G.
SESCAP     MOVE SPACES                TO MIR-SESN-CTL-IND-G.
SESCAP     MOVE SPACES                TO MIR-MAX-SESN-NUM-G.
      *
           MOVE LOW-VALUES            TO WUSCL-KEY.
           MOVE HIGH-VALUES           TO WUSCL-ENDBR-KEY.
           MOVE MIR-SECUR-CLAS-ID     TO WUSCL-SECUR-CLAS-ID.
      *
           PERFORM  USCL-1000-BROWSE
               THRU USCL-1000-BROWSE-X.
      *
           IF  WUSCL-IO-EOF
53-064         MOVE 'XS00000034'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               GO TO 2500-PROCESS-LIST-X
           ELSE
               PERFORM  USCL-2000-READ-NEXT
                   THRU USCL-2000-READ-NEXT-X
               IF  WUSCL-IO-EOF
                  MOVE 'XS00000025'   TO WGLOB-MSG-REF-INFO
                  PERFORM  0260-1000-GENERATE-MESSAGE
                      THRU 0260-1000-GENERATE-MESSAGE-X
                  GO TO 2500-PROCESS-LIST-X
54-001         END-IF
54-001     END-IF.
      *
           PERFORM  2510-PROCESS-LIST-READ
557660         THRU 2510-PROCESS-LIST-READ-X
               VARYING WS-SUB FROM +1 BY +1
               UNTIL WS-SUB > WS-MAX-BROWSE-LINES
               OR    WUSCL-IO-EOF.

           IF  WUSCL-IO-EOF
               MOVE 'XS00000025'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
           ELSE
               MOVE 'XS00000014'      TO WGLOB-MSG-REF-INFO
53-064         SET WGLOB-MORE-DATA-EXISTS TO TRUE
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.

           PERFORM  USCL-3000-END-BROWSE
               THRU USCL-3000-END-BROWSE-X.
      *
       2500-PROCESS-LIST-X.
           EXIT.
      /
      *-------------------------
       2510-PROCESS-LIST-READ.
      *-------------------------
      *
           MOVE RUSCL-SECUR-CLAS-ID   TO MIR-SECUR-CLAS-ID-T (WS-SUB).
012624*    MOVE RUSCL-MSG-SECUR-CLAS-CD
012624*                            TO MIR-MSG-SECUR-CLAS-CD-T  (WS-SUB).
           MOVE RUSCL-SECUR-CNFD-ACCS-CD
                                   TO MIR-SECUR-CNFD-ACCS-CD-T (WS-SUB).
           MOVE RUSCL-SECUR-USER-CTR  TO MIR-SECUR-USER-CTR-T (WS-SUB).
012624     MOVE RUSCL-CTL-ACCT-ACCS-IND  TO MIR-CTL-ACCT-ACCS-IND-T
012624                                      (WS-SUB).
012624*    PERFORM  3000-GET-SEC-CLASS-DESC
012624*        THRU 3000-GET-SEC-CLASS-DESC-X
554712*    MOVE RUSCL-SECUR-DESC-TXT  TO MIR-ETBL-DESC-TXT-T (WS-SUB).
012624*    MOVE WS-SECUR-DESC-TXT     TO MIR-ETBL-DESC-TXT-T (WS-SUB).

012624     PERFORM  0290-1000-BUILD-PARM-INFO
012624         THRU 0290-1000-BUILD-PARM-INFO-X.
012624     COMPUTE L0290-INPUT-NUMBER =  RUSCL-SECUR-CLAS-UWG-AMT
012624                                *  100.
012624     MOVE 2                     TO L0290-PRECISION.
012624     MOVE LENGTH OF MIR-SECUR-CLAS-UWG-AMT
012624                                TO L0290-MAX-OUT-LEN.
012624     PERFORM  0290-1000-NUMERIC-FORMAT
012624         THRU 0290-1000-NUMERIC-FORMAT-X.
012624     MOVE L0290-OUTPUT-DATA TO MIR-SECUR-CLAS-UWG-AMT-T (WS-SUB).

012624     PERFORM  0290-1000-BUILD-PARM-INFO
012624         THRU 0290-1000-BUILD-PARM-INFO-X.
012624     COMPUTE L0290-INPUT-NUMBER =  RUSCL-SECUR-CLAS-MAX-AMT
012624                                *  100.
012624     MOVE 2                     TO L0290-PRECISION.
012624     MOVE LENGTH OF MIR-SECUR-CLAS-MAX-AMT
012624                                TO L0290-MAX-OUT-LEN.
012624     PERFORM  0290-1000-NUMERIC-FORMAT
012624         THRU 0290-1000-NUMERIC-FORMAT-X.
012624     MOVE L0290-OUTPUT-DATA TO MIR-SECUR-CLAS-MAX-AMT-T (WS-SUB).
SESCAP     MOVE RUSCL-SESN-CTL-IND TO MIR-SESN-CTL-IND-T (WS-SUB).
SESCAP     MOVE RUSCL-MAX-SESN-NUM    TO  MIR-MAX-SESN-NUM-T (WS-SUB).

           PERFORM  USCL-2000-READ-NEXT
               THRU USCL-2000-READ-NEXT-X.

           IF  WS-SUB = WS-MAX-BROWSE-LINES
               IF  WUSCL-IO-OK
                   MOVE RUSCL-SECUR-CLAS-ID
                                      TO MIR-SECUR-CLAS-ID
54-001        END-IF
54-001     END-IF.
      *
       2510-PROCESS-LIST-READ-X.
           EXIT.
      /
012624*-----------------------
012624*3000-GET-SEC-CLASS-DESC.
012624*-----------------------
012624*
012624*    READ 'XTAB' TABLE RECORD TYPE 'USCL' KEYED ON THE
012624*    SECURITY CLASS ID TO GET THE SECURITY CALSS
012624*    DESCRIPTION FOR DISPLAY
012624*
012624*    MOVE RUSCL-SECUR-CLAS-ID   TO WXTAB-ETBL-VALU-ID.
012624*
012624*    PERFORM  USCL-2000-DESC
012624*        THRU USCL-2000-DESC-X.
012624*
012624*    IF WXTAB-IO-OK
012624*       MOVE RXTAB-ETBL-DESC-TXT              TO WS-SECUR-DESC-TXT
012624*    ELSE
012624*       MOVE SPACES             TO WS-SECUR-DESC-TXT
012624*    END-IF.
012624*
012624*3000-GET-SEC-CLASS-DESC-X.
012624*    EXIT.
      /
      *-----------------------
       9100-BLANK-DATA-FIELDS.
      *-----------------------
      *
012624*    MOVE SPACES                TO MIR-MSG-SECUR-CLAS-CD.
           MOVE SPACES                TO MIR-SECUR-CNFD-ACCS-CD.
           MOVE SPACES                TO MIR-SECUR-LVL-CD.
012624*    MOVE SPACES                TO MIR-SECUR-APPL-USE-TXT.
012624     MOVE ZEROS                 TO MIR-SECUR-CLAS-UWG-AMT.
012624     MOVE ZEROS                 TO MIR-SECUR-CLAS-MAX-AMT.
012624     MOVE 'N'                   TO MIR-CTL-ACCT-ACCS-IND.
           MOVE SPACES                TO MIR-SECUR-USER-CTR.
012624*    MOVE SPACES                TO MIR-ETBL-DESC-TXT.
SESCAP     MOVE 'N'                   TO MIR-SESN-CTL-IND.
SESCAP     MOVE ZEROS                 TO MIR-MAX-SESN-NUM.
      *
       9100-BLANK-DATA-FIELDS-X.
           EXIT.
      /
      *---------------------------
       9200-MOVE-RECORD-TO-SCREEN.
      *---------------------------
      *
           MOVE RUSCL-SECUR-CLAS-ID   TO MIR-SECUR-CLAS-ID.
012624*    MOVE RUSCL-MSG-SECUR-CLAS-CD
012624*                               TO MIR-MSG-SECUR-CLAS-CD.
           MOVE RUSCL-SECUR-CNFD-ACCS-CD
                                      TO MIR-SECUR-CNFD-ACCS-CD.
           MOVE RUSCL-SECUR-LVL-CD    TO MIR-SECUR-LVL-CD.
012624     MOVE RUSCL-CTL-ACCT-ACCS-IND
012624                                TO MIR-CTL-ACCT-ACCS-IND.
557659*    MOVE RUSCL-SECUR-APPL-DEFN-CD TO MIR-SECUR-APPL-USE-TXT.
012624*    MOVE RUSCL-SECUR-APPL-USE-TXT
012624*                               TO MIR-SECUR-APPL-USE-TXT.
012624     PERFORM  0290-1000-BUILD-PARM-INFO
012624         THRU 0290-1000-BUILD-PARM-INFO-X.
012624     COMPUTE L0290-INPUT-NUMBER = RUSCL-SECUR-CLAS-UWG-AMT
012624                                * 100.
012624     MOVE 2                     TO  L0290-PRECISION.
012624     MOVE LENGTH OF MIR-SECUR-CLAS-UWG-AMT TO L0290-MAX-OUT-LEN.
012624     PERFORM  0290-1000-NUMERIC-FORMAT
012624         THRU 0290-1000-NUMERIC-FORMAT-X.
012624     MOVE L0290-OUTPUT-DATA     TO  MIR-SECUR-CLAS-UWG-AMT.
012624     PERFORM  0290-1000-BUILD-PARM-INFO
012624         THRU 0290-1000-BUILD-PARM-INFO-X.
012624     COMPUTE L0290-INPUT-NUMBER = RUSCL-SECUR-CLAS-MAX-AMT
012624                                * 100.
012624     MOVE 2                     TO  L0290-PRECISION.
012624     MOVE LENGTH OF MIR-SECUR-CLAS-MAX-AMT TO L0290-MAX-OUT-LEN.
012624     PERFORM  0290-1000-NUMERIC-FORMAT
012624         THRU 0290-1000-NUMERIC-FORMAT-X.
012624     MOVE L0290-OUTPUT-DATA     TO  MIR-SECUR-CLAS-MAX-AMT.
           MOVE RUSCL-SECUR-USER-CTR  TO MIR-SECUR-USER-CTR.
012624*    PERFORM  3000-GET-SEC-CLASS-DESC
012624*        THRU 3000-GET-SEC-CLASS-DESC-X
012624*    MOVE RUSCL-SECUR-DESC-TXT     TO MIR-ETBL-DESC-TXT.
012624*    MOVE WS-SECUR-DESC-TXT     TO MIR-ETBL-DESC-TXT.
      *
SESCAP     MOVE RUSCL-SESN-CTL-IND TO MIR-SESN-CTL-IND.
SESCAP*    PERFORM  0290-1000-BUILD-PARM-INFO
SESCAP*        THRU 0290-1000-BUILD-PARM-INFO-X.
SESCAP*    MOVE RUSCL-MAX-SESN-NUM TO L0290-INPUT-NUMBER.
SESCAP*    MOVE 0                     TO  L0290-PRECISION.
SESCAP*    MOVE 'N'                   TO L0290-SIGN-IND
SESCAP*    MOVE LENGTH OF MIR-MAX-SESN-NUM TO L0290-MAX-OUT-LEN.
SESCAP*    PERFORM  0290-1000-NUMERIC-FORMAT
SESCAP*        THRU 0290-1000-NUMERIC-FORMAT-X.
SESCAP*    MOVE L0290-OUTPUT-DATA     TO  MIR-MAX-SESN-NUM.
SESCAP     MOVE RUSCL-MAX-SESN-NUM    TO  MIR-MAX-SESN-NUM.
SESCAP*
       9200-MOVE-RECORD-TO-SCREEN-X.
           EXIT.
      /
      *--------------------------
       9300-SETUP-MSIN-REFERENCE.
      *--------------------------
      *
           MOVE SPACES                TO WGLOB-MSIN-REFERENCE.
           MOVE WGLOB-COMPANY-CODE    TO WGLOB-REF-COMPANY-CODE.
      *
       9300-SETUP-MSIN-REFERENCE-X.
           EXIT.
      /
       COPY XCPPINIT.
      *
       COPY XCPPEXIT.
      /
       COPY XCPEMSGC.
      /
       COPY XCCL0260.
      /
012624 COPY XCPS0290.
012624 COPY XCPL0280.
012624 COPY XCPL0290.
      /
014660*COPY XCPPMEXT.
      /
554712 COPY XCPEUSCL.
      /
557708*COPY XCCPHNDL.
557708 COPY XCCPABND.
       COPY XCCP0030.
      *****************************************************************
      *  FILE I/O PROCESS MODULES
      *****************************************************************
       COPY XCPBUSCL.
      /
       COPY XCPNUSCL.
      /
016221 COPY XCPBBPFS.
      / 
       COPY XCPNXTAB.
      /
       COPY XCPUUSCL.
      /
       COPY XCPAUSCL.
      /
       COPY XCPCUSCL.
      /
       COPY XCPXUSCL.
      *****************************************************************
      **                 END OF PROGRAM XSOM0160                     **
      *****************************************************************
