NTPROD* $SET INITCALL(UTILS.LBR)
      *************************
       IDENTIFICATION DIVISION.
      *************************

       PROGRAM-ID. XSOM0010.

       COPY XCWWCRHT.

      *****************************************************************
      **  MEMBER :  XSOM0010                                         **
      **  REMARKS:  SERVER CONTROL PROGRAM                           **
      **            THIS PROGRAM WILL PROCESS THE FOLLOWING REQUESTS **
      **            FROM THE CLIENT.                                 **
      **                                                             **
      **            1 - LOGIN                                        **
      **                THIS FUNCTION WILL ROUTE DATA TO THE         **
      **                SIGN-ON PROCESS DRIVER IN ORDER TO PROCESS   **
      **                THE INITIAL LOGIN SCREEN.                    **
      **                                                             **
      **            2 - SECURITY VALIDATION                          **
      **                THIS FUNCTION WILL VALIDATE A USER'S RIGHT   **
      **                TO UTILIZE A PARTICULAR PROCESS FLOW OR      **
      **                OR BUSINESS FUNCTION.                        **
      **                                                             **
      **            3 - TRANSACTION                                  **
      **                THIS FUNCTION WILL ROUTE DATA TO THE         **
      **                APPROPRIATE PROCESS DRIVER AND RETURN THE    **
      **                REQUIRED DATA BACK TO THE CLIENT.            **
      **                                                             **
      **  DOMAIN :  SY                                               **
      **  CLASS  :                                                   **
      *****************************************************************
      **  DATE    AUTHOR   DESCRIPTION                               **
      **                                                             **
54-010**  01JAN97  MHB     SPANISH                                   **
557658**  01SEP97  REC     USE NEW DATE/TIME UTILITY MODULES FOR Y2K **
557663**  01SEP97  REC     APPLICATION WORK AREA SHOULD BE A FIXED   **
557663**                   PART OF THE SIR                           **
557699**  01SEP97  REC     ADD SUPPORT FOR NEW AUDIT FACILITY        **
557708**  01SEP97  REC     CHANGE HANDLE ABEND PROCESSING            **
557756**  30SEP97  MS      MULTIPLE LANGUAGE SUPPORT                 **
008445**  31MAR98  GV      CHANGE TO MIR GENERATION                  **
008453**  31MAR98  552     IMPLEMENT MULTIPLE EXTERNAL DATE FORMAT   **
008455**  31MAR98  552     EXTENSIVE NUMERIC FORMATTING              **
010299**  31MAR98  552     REPOSITION INITIALIZE OF COMMAREA LENGTH  **
007684**  30OCT98  56      CHECKPOINT/RESTART                        **
007766**  30OCT98  56      ARCHITECTURE CHANGES TO SUPPORT PASSING   **
007766**                   PARAMETERS VIA AN ADDRESS                 **
010314**  30OCT98  56      INCREASE MSG AREA TO HOLD NEW POLI SCREEN **
010418**  30OCT98  56      MODIFICATIONS REQUIRED TO SUPPORT MULTI-CO**
014035**  30OCT98  56V     CODE CLEANUP & STANDATDIZATION            **
013578**  15DEC99  60      REMOVAL OF 3270 SUPPORT                   **
014590**  15DEC99  60      ARCHITECTURAL CHANGES                     **
015543**  15DEC99  60      CODE CLEANUP                              **
015858**  15DEC99  60      MODIFICATIONS TO SUPPORT BETTER TRACKING  **
015858**                   OF EXECUTING PROGRAM IN ERROR LOG         **
016227**  30JUN00  602J    CODE CLEANUP                              **
017150**  09FEB01  612J    CURRENCY SCALING                          **
PF 1.2**           612J    CHANGE COMP TO BINARY                     **
PF 1.2**           612J    ADDITION OF LOOPBACK CONTROL CODE FOR     **
PF 1.2**                   COMMUNICATIONS TESTING                    **
PF 1.2**           612J    SINGLE P-STEP SUPPORT                     **
017618**  09FEB01  612J    ONLY CLEAN UP TWRK RELATED TO CURRENT     **
017618**                   PROCESS ID                                **
01AR01**  16MAY01  MAW    ARCHITECTURAL CHANGES TO SUPPORT MULTIPLE  **
01AR01**                  CICS ENVIRONMENTS                          **
B10135**  01AUG01  EKM    SYSTEM FUTURE DATING                       **
B00316**  22JUL02  AT     ELIMINATE ORPHANED MSIN ROWS               **
      **                                                             **
PF 13 ** -----  RETROFITTED PATHFINDER RELEASE 1.3 CODE  ----------- **
016761**  6.2       REMOVE WGLOB-GUI-RETRN-CD, ADD WGLOB-RETURN-ABEND**
018273**  6.2       PATHFINDER 1.2                                   **
016770**  6.2       USES TABLE ACCESS TUNING                         **
PF 13 **  1.3       PATHFINDER 1.3                                   **
PF 13 **            - SUPPORT FOR MULTPILE BUSINESS FUNCTIONS ON     **
PF 13 **              P-STEP INTERFACE                               **
PF 13 **            - RATIONALIZATION OF SESSION VARIABLES ON THE    **
PF 13 **              SIR RECORD                                     **
PF 13 ** ----------------------------------------------------------- **
SESCAP**  31OCT04  AC     SESSION CAP ENHANCEMENT                    **
P02613**  02FEB05  AC     SET UP DEFAULT DATE FORMAT  FIELDS         **
PIRAEX**  09MAR06  CTS    PREVENT USERS WHO DO NOT HAVE BPFS REC FOR **
PIRAEX**                  SIGNON FLOW TO LOGIN INTO NATIVE INGENIUM  **
MP1669**  07NOV11  CTS    CHANGES DONE FOR RETAIN MIR VALUE IN CASE  **
MP1669**                  UNDO PROCESS FORCED TO NOT COMMITED        **
Q11699**  23JAN12  CTS    CHANGES FOR STOPPING THE ERROR MESSAGE DUE **
Q11699**                  TO THE VIRTUAL UNDO CALL                   **
      *****************************************************************
      /
      **********************
       ENVIRONMENT DIVISION.
      **********************

      ***************
       DATA DIVISION.
      ***************

       WORKING-STORAGE SECTION.

       COPY XCWWPGWS REPLACING '$VAR1' BY 'XSOM0010'.

       COPY SQLCA.
       COPY XCWLPTR.

       01  WS-WORK-AREAS.
PF 1.2*    05  WS-SUB                           PIC S9(04) COMP   
PF 1.2     05  WS-SUB                           PIC S9(04) BINARY
                                                           VALUE 0.
PF 1.2*    05  WS-MAX-LSIR-MESSAGE-CTR          PIC S9(04) COMP   
PF 1.2     05  WS-MAX-LSIR-MESSAGE-CTR          PIC S9(04) BINARY
PF 13                                                      VALUE 5.
PF 13 *                                                    VALUE 10.
           05  WS-DISPLAY-7-0                   PIC 9(07).
           05  WS-DISPLAY-S7-0                  PIC -9(07).
PF 1.2*    05  WS-MIR-START-COORDINATE          PIC S9(04) COMP.
PF 1.2     05  WS-MIR-START-COORDINATE          PIC S9(04) BINARY.
PF 13      05  WS-MIR-HOLD-COORDINATE           PIC S9(04) BINARY.
           05  WS-MIR-PROCESSING-IND            PIC X(01).
               88  WS-MIR-PROCESSING-COMPLETE   VALUE 'Y'.
               88  WS-MIR-PROCESSING-INCOMPLETE VALUE 'N'.
PF 13      05  WS-SYS-TIMESTAMP.
PF 13          10  WS-SYS-TS-DATE.
PF 13              15  WS-SYS-TS-DT-YYYY        PIC 9(04).
PF 13              15  FILLER                   PIC X(01).
PF 13              15  WS-SYS-TS-DT-MM          PIC 9(02).
PF 13              15  FILLER                   PIC X(01).
PF 13              15  WS-SYS-TS-DT-DD          PIC 9(02).
PF 13          10  FILLER                       PIC X(01).
PF 13          10  WS-SYS-TS-TIME.
PF 13              15  WS-SYS-TS-HR             PIC 9(02).
PF 13              15  FILLER                   PIC X(01).
PF 13              15  WS-SYS-TS-MI             PIC 9(02).
PF 13              15  FILLER                   PIC X(01).
PF 13              15  WS-SYS-TS-SEC            PIC 9(02).
PF 13              15  FILLER                   PIC X(01).
PF 13              15  WS-SYS-TS-MS             PIC 9(06).
PF 13      05  WS-SYS-TIME.
PF 13          10  WS-SYS-HR                    PIC 9(02).
PF 13          10  WS-SYS-MI                    PIC 9(02).
PF 13          10  WS-SYS-SEC                   PIC 9(02).
PF 13      05  WS-SUMMARY-BYPASS-IND            PIC X(01).
PF 13          88  WS-SUMMARY-BYPASS-YES        VALUE 'Y'.
PF 13          88  WS-SUMMARY-BYPASS-NO         VALUE 'N'.
MP1669     05  WS-HIGHEST-MIR-RETRN-CD          PIC X(02).
MP1669         88  WS-HIGHEST-RETRN-ERROR-OVRID VALUE '03'.
      *
      *  DEFAULT SETTINGS WHEN NOT SUPPLIED BY SIR
      *
015543     05  WS-DEFAULT-EDIT-LANG-CD          PIC X(01)  VALUE 'E'.
015543     05  WS-DEFAULT-USER-LANG-CD          PIC X(01)  VALUE 'E'.
015543     05  WS-DEFAULT-MSG-SECUR-CLAS-CD     PIC X(01)  VALUE 'A'.
015543     05  WS-DEFAULT-DT-FRMT-CD            PIC X(01)  VALUE 'D'.
015543     05  WS-DEFAULT-DT-SEPARATOR-SYMBL    PIC X(01)  VALUE '-'.
015543     05  WS-DEFAULT-DT-ZERO-SUPRES-IND    PIC X(01)  VALUE 'N'.
015543     05  WS-DEFAULT-MIR-QTY               PIC X(02)  VALUE '01'.
017150     05  WS-DEFAULT-CRCY-SCALE-QTY        PIC 9(01)  VALUE ZERO.
PIRAEX     05  WS-TXT-SRC-REF-ID                PIC X(05) 
PIRAEX                                          VALUE SPACES. 
PIRAEX     05  WS-TIME                          PIC X(07).
PIRAEX     05  WS-TIME-N                        REDEFINES
PIRAEX         WS-TIME                          PIC 9(07).
 
       01  WS-HOLD-LSIR-MSG-AREA                    PIC X(30000).
       01  WS-MIR-INTERFACE.
           05  WS-MIR-CONTROL-FIELDS.
               10  WS-MIR-BUS-FCN-ID                PIC X(04).
                   88  WS-MIR-LOGIN                 VALUE '0064'.
PF 1.2             88  WS-MIR-BF-SIGN-IN            VALUE '0011'.
               10  WS-MIR-LEN                       PIC 9(05).
               10  WS-MIR-RETRN-CD                  PIC X(02).
                   88  WS-MIR-RETRN-OK              VALUE '00'.
                   88  WS-MIR-RETRN-EDIT-ERROR      VALUE '01'.
                   88  WS-MIR-RETRN-RQST-FAILED     VALUE '02'.
MP1669             88  WS-MIR-RETRN-ERROR-OVRID     VALUE '03'.
PF 13              88  WS-MIR-RETRN-DT-CHG-WARN     VALUE '07'.
                   88  WS-MIR-RETRN-INVALD-RQST     VALUE '99'.
015543     05  MIR-REMAINDER                        PIC X(29989).
      *
      * COPYBOOKS
      *

       01 WGLOB-GLOBAL-AREA.
       COPY XCWWGLOB.

       COPY XCWLSIR.

       COPY XCWL0012.
      /
014590*COPY XCWL0030.
NTDEV  COPY XCWL0035.
       COPY XCWL1610.
       COPY XCWL1611.
       COPY XCWL0280.
       COPY XCWL1580.
       COPY XCWL1640.
PF 13  COPY XCWL2490.
       COPY XCWL8095.

       COPY XCWWWKDT.

01AR01 COPY XCWWENVT.
PF 13  COPY XCWWTIME.

B10135 COPY XCWWFUTD.

       COPY XCWLDTLK.

       COPY XCFWAPPL.
       COPY XCFRAPPL.

       COPY XCFWBFCN.
       COPY XCFRBFCN.

       COPY XCFWBPFL.
       COPY XCFRBPFL.

       COPY XCFWBPFS.
       COPY XCFRBPFS.

       COPY XCFWUSCL.
       COPY XCFRUSCL.

PF 13 *COPY XCFWUSEC.
PF 13 *COPY XCFRUSEC.

       COPY XCFWUSES.
       COPY XCFRUSES.
PIRAEX
PIRAEX COPY CCFWUSAU.
PIRAEX COPY CCFRUSAU.

       LINKAGE SECTION.

       01  DFHCOMMAREA.
           05  FILLER      PIC X(1)      OCCURS 640 TO 32767
                                         DEPENDING ON EIBCALEN.

      ********************
       PROCEDURE DIVISION.
      ********************

      *-------------
       0000-MAINLINE.
      *-------------

           EXEC CICS HANDLE ABEND
                LABEL(9000-PROCESS-ABEND)
           END-EXEC.

      *
      *  PROCESS THE REQUEST FROM THE CLIENT
      *
           MOVE DFHCOMMAREA                   TO LSIR-PARM-AREA.
           MOVE LSIR-MSG-AREA                 TO WS-HOLD-LSIR-MSG-AREA.
PF 13 *    INITIALIZE  LSIR-RETURN-CD.
PF 13      INITIALIZE  LSIR-OUTPUT-AREA.
PF 13      MOVE ZEROS                         TO LSIR-TASK-ID.
PF 13      INITIALIZE  LSIR-ERROR-MSG-AREA.
PF 13      INITIALIZE  LSIR-TESTING-AREA.

PF 1.2*   THE FOLLOWING "IF" STATEMENT IS TO ALLOW A QUICK TEST TO
PF 1.2*   DETERMINE THAT PROPER COMMUNICATIONS WITH THE CICS REGION
PF 1.2*   HAVE BEEN ESTABLISHED.  IT CAN ALSO BE USED FOR PERFORMANCE
PF 1.2*   TESTING THE CICS GATEWAYS USED TO COMMUNICATE WITH INGENIUM
PF 1.2*
PF 1.2     IF  LSIR-PRCES-LOOPBACK
PF 1.2         SET LSIR-LOOPBACK-SUCCESSFUL   TO TRUE
PF 1.2         MOVE 'LOOPBACK FROM XSOM0010'  TO LSIR-TESTING-AREA-MISC
PF 1.2         MOVE  LSIR-PARM-AREA           TO DFHCOMMAREA
PF 1.2         EXEC CICS RETURN
PF 1.2         END-EXEC
PF 1.2     END-IF.
           
PF 13 *  IF WE HAVE A FAILURE HERE, THE ABEND HANDLER WILL ALSO FAIL SINCE
PF 13 *  WE HAVE NO COMPANY CODE SET.  HOWEVER, A FAILURE HERE ALSO VIRTUALLY
PF 13 *  GUARANTEES THAT WE WON'T HAVE A DATABASE ATTACH, SO IT DOESN'T
PF 13 *  MATTER BECAUSE NOTHING WILL WORK.
PF 13 *
PF 13      PERFORM  0035-5000-TIMESTAMP
PF 13          THRU 0035-5000-TIMESTAMP-X.
PF 13 
           PERFORM  1000-BUILD-WGLOB-AREA
               THRU 1000-BUILD-WGLOB-AREA-X.

           IF  LSIR-GENERATE-STATS
               PERFORM  0035-5000-TIMESTAMP
                   THRU 0035-5000-TIMESTAMP-X
               MOVE L0035-TIMESTAMP           TO L1580-INT-TS
           END-IF.

           EVALUATE TRUE

               WHEN LSIR-PRCES-LOGIN
                    PERFORM 2000-PROCESS-LOGIN
                       THRU 2000-PROCESS-LOGIN-X

               WHEN LSIR-PRCES-SECURITY
                    PERFORM 3000-PROCESS-SECURITY
                       THRU 3000-PROCESS-SECURITY-X

               WHEN LSIR-PRCES-TRANSACTION
                    PERFORM 4000-PROCESS-TRANSACTION
                       THRU 4000-PROCESS-TRANSACTION-X

               WHEN LSIR-PRCES-CLEAN-UP
                    PERFORM 5000-PROCESS-CLEAN-UP
                       THRU 5000-PROCESS-CLEAN-UP-X
PF 1.2
PF 1.2         WHEN LSIR-PRCES-BFCN-SESSION
PF 1.2              PERFORM 8000-PROCESS-NO-SESSION
PF 1.2                 THRU 8000-PROCESS-NO-SESSION-X
      *
      *  MSG:  INVALID SERVER REQUEST
      *
               WHEN OTHER
                    SET  LSIR-SERVER-ERROR  TO  TRUE
                    MOVE LSIR-PRCES-CD      TO WGLOB-MSG-PARM (1)
      *MSG: INVALID PROCESS REQUEST CODE RECEIVED (@1).
                    MOVE 'XS00100001'       TO WGLOB-MSG-REF-INFO
                    PERFORM  0260-1000-GENERATE-MESSAGE
                        THRU 0260-1000-GENERATE-MESSAGE-X

           END-EVALUATE.

           PERFORM  6000-SUMMARIZE
               THRU 6000-SUMMARIZE-X.

           IF  LSIR-GENERATE-STATS
               PERFORM  0035-5000-TIMESTAMP
                   THRU 0035-5000-TIMESTAMP-X
               MOVE L0035-TIMESTAMP           TO L1580-IO-INT-TS
               PERFORM  1580-4000-TIME-DURATION
                   THRU 1580-4000-TIME-DURATION-X
               MOVE L1580-DUR-TIME-IN-SEC   TO LSIR-SERVER-TASK-DUR
           END-IF.

           MOVE  LSIR-PARM-AREA             TO  DFHCOMMAREA.

01AR01     IF WENVT-MICROFOCUS-CICS
NTDEV          PERFORM  0035-1000-COMMIT
NTDEV              THRU 0035-1000-COMMIT-X
01AR01     END-IF.
      *
      *  RETURN CONTROL OF SERVER PROGRAM TO CICS
      *
           EXEC CICS RETURN
           END-EXEC.

       0000-MAINLINE-X.
           GOBACK.

      *---------------------
       1000-BUILD-WGLOB-AREA.
      *---------------------

           INITIALIZE WGLOB-GLOBAL-AREA.
PF 13      SET WS-SUMMARY-BYPASS-NO         TO TRUE.
           MOVE 'WGLOB'                     TO WGLOB-ID.
           SET WGLOB-GOOD-RETURN            TO TRUE.
           MOVE LSIR-USER-SESN-ID           TO WGLOB-USER-SESN-ID.
015858     MOVE LSIR-MSG-AREA(1:4)          TO WGLOB-BUS-FCN-ID.
           MOVE LSIR-PRCES-ID               TO WGLOB-PRCES-ID.
PF 13 *    PERFORM  1610-1000-GET-DATE-TIME
PF 13 *        THRU 1610-1000-GET-DATE-TIME-X.
PF 13 *    MOVE L1610-SYSTEM-TIME           TO LSIR-SYS-TIME.
PF 13 *    MOVE L1610-SYSTEM-DATE-INT       TO WGLOB-SYSTEM-DATE-INT.
PF 13 *    MOVE L1610-SYSTEM-TIME-INT       TO WGLOB-SYSTEM-TIME-INT.

PF 13      MOVE L0035-TIMESTAMP             TO WS-SYS-TIMESTAMP.
PF 13      MOVE WS-SYS-TS-HR                TO WS-SYS-HR.
PF 13      MOVE WS-SYS-TS-MI                TO WS-SYS-MI.
PF 13      MOVE WS-SYS-TS-SEC               TO WS-SYS-SEC.
PF 13      MOVE WS-SYS-TIME                 TO LSIR-SYS-TIME.
PF 13      MOVE WS-SYS-TS-DATE              TO WGLOB-SYSTEM-DATE-INT.
PF 13      MOVE WS-SYS-TS-TIME              TO WGLOB-SYSTEM-TIME-INT.
PF 13      MOVE ZERO                        TO WTIME-EDIT-TIME.
PF 13      MOVE WS-SYS-TIME                 TO WTIME-EDIT-HHMMSS.
PF 13      MOVE WTIME-EDIT-TIME             TO WGLOB-SYSTEM-TIME.

           MOVE LENGTH OF WGLOB-GLOBAL-AREA TO WGLOB-GLOBAL-LEN.

           SET  WGLOB-ENVRMNT-GUI           TO TRUE.
           MOVE LSIR-BPF-ID                 TO WGLOB-BPF-ID.
           MOVE WPGWS-CRNT-PGM-ID           TO WGLOB-MAIN-PGM-ID.
           MOVE WGLOB-MAIN-PGM-ID           TO WGLOB-CRNT-PGM-ID.

           MOVE EIBTASKN                    TO WS-DISPLAY-7-0.
           MOVE WS-DISPLAY-7-0(4:4)         TO WGLOB-TASK-ID.
           MOVE WGLOB-TASK-ID               TO LSIR-TASK-ID.

PF 13 *    MOVE L1610-SYSTEM-DATE-INT       TO WGLOB-SYSTEM-DATE-INT.
PF 13 *    MOVE L1610-SYSTEM-TIME           TO WGLOB-SYSTEM-TIME.
PF 13 *    MOVE L1610-SYSTEM-TIME-INT       TO WGLOB-SYSTEM-TIME-INT.

           MOVE LSIR-USER-LANG-CD           TO WGLOB-USER-LANG.

015858*    MOVE LSIR-BPF-SECUR-AUD-IND      TO WGLOB-BPF-SECUR-AUD-IND.
015858*    MOVE LSIR-SECUR-CLAS-ID          TO WGLOB-SECUR-CLAS-ID.
015543     MOVE WS-DEFAULT-MSG-SECUR-CLAS-CD TO WGLOB-MSG-SECUR-CLAS-CD.
PF 13 *    MOVE LSIR-SECUR-CNFD-ACCS-CD     TO WGLOB-SECUR-CNFD-ACCS-CD.
PF 13 *    MOVE LSIR-BR-ID                  TO WGLOB-USER-BRANCH-CODE.
PF 13 *    MOVE LSIR-USER-RPT-DSTRB-CD      TO WGLOB-USER-RPT-DSTRB-CD.
PF 13 *    MOVE LSIR-CO-ID                  TO WGLOB-COMPANY-CODE.

PF 13 *    MOVE LSIR-CRCY-SYMBL-CD          TO WGLOB-CRCY-SYMBL.
PF 13 *    MOVE LSIR-THOU-SPRT-CD           TO WGLOB-THOUSANDS-SYMBL.
PF 13 *    MOVE LSIR-DCML-SPRT-CD           TO WGLOB-DCML-SYMBL.
PF 13 *    MOVE LSIR-CRCY-NEG-PLACE-CD      TO WGLOB-SIGN-POSN-CD.
PF 13 *    MOVE LSIR-CRCY-PLACE-CD          TO WGLOB-CRCY-POSN-CD.

PF 13 * CHANGE TAG 017150 COMMENTED OUT EXCEPT FOR DEFAULT VALUES
 
017150*    IF  LSIR-CRCY-SCALE-QTY-X NUMERIC
017150*        MOVE LSIR-CRCY-SCALE-QTY     TO WGLOB-CRCY-SCALE-QTY
017150*    ELSE
017150*        MOVE WS-DEFAULT-CRCY-SCALE-QTY  TO WGLOB-CRCY-SCALE-QTY
017150*    END-IF.
PF 13      MOVE WS-DEFAULT-CRCY-SCALE-QTY  TO WGLOB-CRCY-SCALE-QTY.

PF 13 *    MOVE LSIR-DT-FRMT-CD             TO WGLOB-DT-FRMT-CD.
PF 13 *    MOVE LSIR-DT-SPRT-CD             TO WGLOB-DT-SEPARATOR-SYMBL.
PF 13 *    MOVE LSIR-LEAD-ZERO-IND          TO WGLOB-DT-ZERO-SUPRES-IND.
PF 13 *    MOVE LSIR-MOS-ABBR-TXT           TO WGLOB-MOS-ABBR-TXT.
PF 13 *    MOVE LSIR-USER-SESN-CTRY-CD      TO WGLOB-COUNTRY-CODE.

PF 1.2*    MOVE LSIR-PRCES-DT-INT           TO WGLOB-PROCESS-DATE.
PF 1.2     MOVE WWKDT-LOW-DT                TO WGLOB-PROCESS-DATE.
PF 13 *    MOVE LSIR-EDIT-LANG-CD           TO WGLOB-EDIT-LANG.
015543     MOVE WS-DEFAULT-EDIT-LANG-CD     TO WGLOB-VERIF-LANG.
           MOVE ZERO                       TO LSIR-ERROR-MSG-LINES-USED.
P02613     MOVE WS-DEFAULT-DT-FRMT-CD
P02613                                     TO WGLOB-DT-FRMT-CD.
P02613     MOVE WS-DEFAULT-DT-SEPARATOR-SYMBL
P02613                                     TO WGLOB-DT-SEPARATOR-SYMBL.
P02613     MOVE WS-DEFAULT-DT-ZERO-SUPRES-IND
P02613                                     TO WGLOB-DT-ZERO-SUPRES-IND.
PF 13      PERFORM  7700-GET-DEFAULT-CO
PF 13          THRU 7700-GET-DEFAULT-CO-X.
 
       1000-BUILD-WGLOB-AREA-X.
           EXIT.

      /
      *------------------
       2000-PROCESS-LOGIN.
      *------------------
      *
      *  CHECK THAT THE REQUESTED BUSINESS FUNCTION EXISTS
      *
PF 13 *    SET  WS-MIR-LOGIN             TO TRUE.
PF 13
PF 13      PERFORM  4060-INIT-MIR-COORDINATES
PF 13          THRU 4060-INIT-MIR-COORDINATES-X.
PF 13      PERFORM  4070-MOVE-NEXT-MIR-TO-WS
PF 13          THRU 4070-MOVE-NEXT-MIR-TO-WS-X.
           MOVE WS-MIR-BUS-FCN-ID        TO WBFCN-BUS-FCN-ID.

           PERFORM  BFCN-1000-READ
               THRU BFCN-1000-READ-X.

           IF  WBFCN-IO-NOT-FOUND
               SET  LSIR-SERVER-ERROR    TO  TRUE
               GO TO  2000-PROCESS-LOGIN-X
           END-IF.
PF 13 *
PF 13 *    GET DEFAULT COMPANY ID
PF 13 *
PF 13 *    MOVE WS-DEFAULT-EDIT-LANG-CD  TO L0012-ETBL-LANG-CD.
PF 13 *    PERFORM  0012-1000-GET-DEFAULT-CO-ID
PF 13 *        THRU 0012-1000-GET-DEFAULT-CO-ID-X.
PF 13 *
PF 13 *    IF  L0012-RETRN-INVALID-REQUEST
PF 13 *        PERFORM  0030-5000-LOGIC-ERROR
PF 13 *            THRU 0030-5000-LOGIC-ERROR-X
PF 13 *    END-IF.
PF 13 *
PF 13 *    MOVE L0012-ETBL-VALU-ID       TO LSIR-CO-ID.
PF 13 *    MOVE L0012-ETBL-VALU-ID       TO WGLOB-COMPANY-CODE.
      *
015543* RETRIEVE THE APPL RECORD FOR THE COMPANY TO SET THE EDIT LANG
015543*
015543     PERFORM  APPL-1000-READ
015543         THRU APPL-1000-READ-X.
015543     IF WAPPL-IO-OK
015543         MOVE RAPPL-APPL-EDIT-LANG-CD  TO WGLOB-EDIT-LANG
015543     ELSE
015543         MOVE WS-DEFAULT-EDIT-LANG-CD  TO WGLOB-EDIT-LANG
015543     END-IF.
      *
      *  PROCESS THE LOGON PART OF THE APLS TRANSACTION
      *
           PERFORM  4000-PROCESS-TRANSACTION
               THRU 4000-PROCESS-TRANSACTION-X.

PIRAEX*CHECK WHETHER THE SEC CLASS HAS PRIVILEGE TO ACCESS SIGNON
PIRAEX     PERFORM  7300-READ-BPFS-REC
PIRAEX         THRU 7300-READ-BPFS-REC-X.
PIRAEX 
           PERFORM  7000-CHECK-IF-SIGNED-ON
               THRU 7000-CHECK-IF-SIGNED-ON-X.
      *
      * THE FOLLOWING LINES ARE HERE TO PROVIDE PROPER FORMATTING
      * INFORMATION FOR THE DATE ROUTINE IN THE EVENT THAT THE USER
      * FAILED TO LOGIN.
      *
           IF NOT WUSES-IO-OK
015543         MOVE WS-DEFAULT-DT-FRMT-CD
015543           TO WGLOB-DT-FRMT-CD
015543         MOVE WS-DEFAULT-DT-SEPARATOR-SYMBL
015543           TO WGLOB-DT-SEPARATOR-SYMBL
015543         MOVE WS-DEFAULT-DT-ZERO-SUPRES-IND
015543           TO WGLOB-DT-ZERO-SUPRES-IND
           END-IF.

       2000-PROCESS-LOGIN-X.
           EXIT.
      /
      *---------------------
       3000-PROCESS-SECURITY.
      *---------------------

      *
      *  CHECK THAT THE REQUESTED PROCESS FLOW EXISTS
      *  LOOKUP THE PROCESS FLOW ID AGAINST THE BPFL TABLE.
      *
           MOVE LSIR-BPF-ID                  TO WBPFL-BPF-ID.

           PERFORM  BPFL-1000-READ
               THRU BPFL-1000-READ-X.

           IF  WBPFL-IO-NOT-FOUND
               SET  LSIR-SECURITY-CHECK-FAILED  TO TRUE
      *MSG: PROCESS FLOW (@1) NOT FOUND
               MOVE LSIR-BPF-ID              TO WGLOB-MSG-PARM (1)
               MOVE 'XS00100010'             TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               GO TO  3000-PROCESS-SECURITY-X
           END-IF.

           PERFORM  7000-CHECK-IF-SIGNED-ON
               THRU 7000-CHECK-IF-SIGNED-ON-X.

PF 13      IF NOT LSIR-RETURN-OK
PF 13          SET  LSIR-SECURITY-CHECK-FAILED  TO TRUE
PF 13          GO TO 3000-PROCESS-SECURITY-X
PF 13      END-IF.
           PERFORM  7300-READ-BPFS-REC
               THRU 7300-READ-BPFS-REC-X.

PF 13      PERFORM  7800-GET-MONTH-ABBREVIATIONS
PF 13          THRU 7800-GET-MONTH-ABBREVIATIONS-X.

PF 13      PERFORM  4060-INIT-MIR-COORDINATES
PF 13          THRU 4060-INIT-MIR-COORDINATES-X.
PF 13      PERFORM  4070-MOVE-NEXT-MIR-TO-WS
PF 13          THRU 4070-MOVE-NEXT-MIR-TO-WS-X.

PF 13 * THE NEXT 5 LINES REALLY BELONG TO CHANGE TAG 016686 INGENIUM 6.2

PF 13 *    IF  WS-GEN-PRCES-DT-CHG-WARN
PF 13 *        SET WS-MIR-RETRN-DT-CHG-WARN TO TRUE
PF 13 *        PERFORM  4080-MOVE-WS-TO-MIR
PF 13 *            THRU 4080-MOVE-WS-TO-MIR-X
PF 13 *    END-IF.
      *
       3000-PROCESS-SECURITY-X.
           EXIT.
      /

      *------------------------
       4000-PROCESS-TRANSACTION.
      *------------------------
      *
      *  EXTRACT MIR DATA
      *
PF 1.2*    INITIALIZE L0280-PARM-INFO.
PF 1.2*    MOVE LSIR-MIR-QTY                 TO L0280-INPUT-DATA.
PF 1.2*    MOVE ZERO                         TO L0280-PRECISION.
PF 1.2*    MOVE 2                            TO L0280-INPUT-SIZE.
PF 1.2*    PERFORM  0280-1000-NUMERIC-EDIT
PF 1.2*        THRU 0280-1000-NUMERIC-EDIT-X.
PF 1.2*    IF  L0280-RETRN-OK
PF 1.2*        CONTINUE
PF 1.2*    ELSE
PF 1.2*15543   MOVE WS-DEFAULT-MIR-QTY       TO LSIR-MIR-QTY
PF 1.2*    END-IF.

PF 1.2     PERFORM  4050-VALIDATE-MIR-QTY
PF 1.2         THRU 4050-VALIDATE-MIR-QTY-X.

PF 13 *    SET WS-MIR-PROCESSING-INCOMPLETE  TO TRUE.
PF 13 *    MOVE 1                            TO WS-MIR-START-COORDINATE.
PF 13 *    MOVE LSIR-MSG-AREA(WS-MIR-START-COORDINATE:11)
PF 13 *                                      TO WS-MIR-CONTROL-FIELDS.
PF 13 *
PF 13 *    MOVE LSIR-MSG-AREA(WS-MIR-START-COORDINATE:WS-MIR-LEN)
PF 13 *                                      TO WS-MIR-INTERFACE.

PF 13      PERFORM  4060-INIT-MIR-COORDINATES
PF 13          THRU 4060-INIT-MIR-COORDINATES-X.
PF 13      PERFORM  4070-MOVE-NEXT-MIR-TO-WS
PF 13          THRU 4070-MOVE-NEXT-MIR-TO-WS-X.


           PERFORM  4100-PROCESS-ONE-MIR
               THRU 4100-PROCESS-ONE-MIR-X
            VARYING WS-SUB FROM 1 BY 1
              UNTIL WS-MIR-PROCESSING-COMPLETE
PF 1.2         OR NOT LSIR-RETURN-OK
               OR WS-SUB > LSIR-MIR-QTY.
                
SESCAP     MOVE WGLOB-USER-SESN-ID         TO WUSES-USER-SESN-ID
SESCAP     PERFORM  USES-1000-READ-FOR-UPDATE
SESCAP         THRU USES-1000-READ-FOR-UPDATE-X.
SESCAP     IF  WUSES-IO-OK
SESCAP         PERFORM  USES-2000-REWRITE
SESCAP             THRU USES-2000-REWRITE-X
SESCAP     END-IF.

       4000-PROCESS-TRANSACTION-X.
           EXIT.
PF 1.2*---------------------
PF 1.2 4050-VALIDATE-MIR-QTY.
PF 1.2*---------------------
PF 1.2
PF 1.2     INITIALIZE L0280-PARM-INFO.
PF 1.2     MOVE LSIR-MIR-QTY                 TO L0280-INPUT-DATA.
PF 1.2     MOVE ZERO                         TO L0280-PRECISION.
PF 1.2     MOVE 2                            TO L0280-LENGTH.
PF 1.2     MOVE 2                            TO L0280-INPUT-SIZE.
PF 1.2     PERFORM  0280-1000-NUMERIC-EDIT
PF 1.2         THRU 0280-1000-NUMERIC-EDIT-X.
PF 1.2     IF  L0280-RETRN-OK
PF 1.2         MOVE L0280-OUTPUT             TO LSIR-MIR-QTY
PF 1.2     ELSE
PF 1.2         MOVE WS-DEFAULT-MIR-QTY       TO LSIR-MIR-QTY
PF 1.2     END-IF.
PF 1.2
PF 13 *    IF  LSIR-PRCES-BFCN-SESSION
PF 13 *    AND LSIR-MIR-QTY > 2
PF 13 *        MOVE 2                        TO LSIR-MIR-QTY
PF 13 *    END-IF.
PF 1.2
PF 1.2 4050-VALIDATE-MIR-QTY-X.
PF 1.2     EXIT.

PF 13 *-------------------------
PF 13  4060-INIT-MIR-COORDINATES.
PF 13 *-------------------------
PF 13
PF 13      SET WS-MIR-PROCESSING-INCOMPLETE  TO TRUE.
PF 13      MOVE 1                            TO WS-MIR-START-COORDINATE.
PF 13
PF 13  4060-INIT-MIR-COORDINATES-X.
PF 13      EXIT.

PF 13 *------------------------
PF 13  4070-MOVE-NEXT-MIR-TO-WS.
PF 13 *------------------------
PF 13
PF 13      MOVE LSIR-MSG-AREA(WS-MIR-START-COORDINATE:11)
PF 13                                        TO WS-MIR-CONTROL-FIELDS.
PF 13
PF 13      IF WS-MIR-LEN NUMERIC
PF 13          MOVE LSIR-MSG-AREA(WS-MIR-START-COORDINATE:WS-MIR-LEN)
PF 13                                      TO WS-MIR-INTERFACE
PF 13      END-IF.
PF 13
PF 13  4070-MOVE-NEXT-MIR-TO-WS-X.
PF 13      EXIT.

PF 13 *-------------------
PF 13  4080-MOVE-WS-TO-MIR.
PF 13 *-------------------
PF 13
PF 13      MOVE WS-MIR-INTERFACE(1:WS-MIR-LEN)
PF 13        TO LSIR-MSG-AREA(WS-MIR-START-COORDINATE:WS-MIR-LEN).
PF 13
PF 13  4080-MOVE-WS-TO-MIR-X.
PF 13      EXIT.

PF 13 *--------------------------
PF 13  4090-UPDATE-MIR-COORDINATE.
PF 13 *--------------------------
PF 13 *  UPDATE FIELDS FOR LOOPING CONTROL
PF 13 *    1.  UPDATE START COORDINATE BY ADDING LENGTH OF PREVIOUS MIR
PF 13 *    2.  MOVE NEXT MIR INTO WORKING STORAGE MIR
PF 13
PF 13      ADD  WS-MIR-LEN                 TO WS-MIR-START-COORDINATE.
PF 13      PERFORM  4070-MOVE-NEXT-MIR-TO-WS
PF 13          THRU 4070-MOVE-NEXT-MIR-TO-WS-X.
PF 13
PF 13  4090-UPDATE-MIR-COORDINATE-X.
PF 13      EXIT.
      /
      *--------------------
       4100-PROCESS-ONE-MIR.
      *--------------------

PF 13 *    PERFORM  7400-READ-BFCN-REC
PF 13 *        THRU 7400-READ-BFCN-REC-X.

PF 1.2     PERFORM  4110-FLOW-ACCESS-VALIDATION
PF 1.2         THRU 4110-FLOW-ACCESS-VALIDATION-X.

PF 13      PERFORM  7400-READ-BFCN-REC
PF 13          THRU 7400-READ-BFCN-REC-X.
           
           IF NOT LSIR-RETURN-OK
               GO TO 4100-PROCESS-ONE-MIR-X
           END-IF.

PF 1.2*    IF  LSIR-PRCES-TRANSACTION
PF 1.2*        MOVE LSIR-DT-FRMT-CD          TO WGLOB-DT-FRMT-CD
PF 1.2*        MOVE LSIR-DT-SPRT-CD          TO WGLOB-DT-SEPARATOR-SYMBL
PF 1.2*        MOVE LSIR-LEAD-ZERO-IND       TO WGLOB-DT-ZERO-SUPRES-IND
PF 1.2*        MOVE LSIR-MOS-ABBR-TXT        TO WGLOB-MOS-ABBR-TXT
PF 1.2*        PERFORM  7000-CHECK-IF-SIGNED-ON
PF 1.2*            THRU 7000-CHECK-IF-SIGNED-ON-X
PF 1.2*        PERFORM  7300-READ-BPFS-REC
PF 1.2*            THRU 7300-READ-BPFS-REC-X
PF 1.2*        IF  NOT LSIR-RETURN-OK
PF 1.2*            SET  LSIR-SERVER-ERROR    TO  TRUE
PF 1.2*            GO TO  4100-PROCESS-ONE-MIR-X
PF 1.2*        END-IF
PF 1.2*    END-IF.

           IF  RBFCN-BUS-FCN-CONN
           AND RUSES-USER-SESN-STAT-NOT-CONN
               SET LSIR-SERVER-ERROR         TO TRUE
      *MSG: YOUR SESSION RECORD IS NOT CONNECTED TO THE APPLICATION.
      *           PLEASE CONNECT BEFORE PROCEEDING
               MOVE 'XS00100003'       TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               GO TO  4100-PROCESS-ONE-MIR-X
           END-IF.

PF 13 *
PF 13 *  CALL THE REQUESTED PROCESS DRIVER
PF 13 *
PF 13 *    MOVE SPACES                         TO WPGWS-PREV-PGM-ID.
PF 13 *    MOVE WPGWS-CRNT-PGM-ID              TO WGLOB-PREV-PGM-ID.
PF 13 *    MOVE WGLOB-MAIN-PGM-ID              TO WGLOB-CRNT-PGM-ID.
PF 13 *
PF 13 *    MOVE WGLOB-MAIN-PGM-ID              TO WPGWS-CALL-PGM-ID.
PF 13 *    MOVE WS-MIR-BUS-FCN-ID              TO WGLOB-BUS-FCN-ID.
PF 13 *    CALL WPGWS-CALL-PGM-ID USING DFHEIBLK
PF 13 *                                 DFHCOMMAREA
PF 13 *                                 WGLOB-GLOBAL-AREA
PF 13 *                                 WS-MIR-INTERFACE.
PF 13 *
PF 13 *  RETURN FROM PROCESS DRIVER, MOVE INFO BACK INTO RELATIVE POSITION
PF 13 *
PF 13 *  HANDLE ABEND - CONTROL WILL NOT RETURN FROM 9000-PROCESS-ABEND
PF 13 *
PF 13 *    IF  WGLOB-GUI-RETRN-ABEND
PF 13 *    IF  WGLOB-RETURN-ABEND
PF 13 *        PERFORM  9000-PROCESS-ABEND
PF 13 *            THRU 9000-PROCESS-ABEND-X
PF 13 *    END-IF.
PF 13 *
PF 13 *    MOVE WPGWS-CRNT-PGM-ID              TO WGLOB-CRNT-PGM-ID.
PF 13 *    MOVE SPACES                         TO WGLOB-PREV-PGM-ID.
      *
      *  MOVE DATA BACK TO SIR
      *
PF 13      PERFORM  4120-CALL-PROCESS-DRIVER
PF 13          THRU 4120-CALL-PROCESS-DRIVER-X.

PF 13      PERFORM  4080-MOVE-WS-TO-MIR
PF 13          THRU 4080-MOVE-WS-TO-MIR-X.

PF 13 *    MOVE WS-MIR-INTERFACE(1:WS-MIR-LEN)
PF 13 *      TO LSIR-MSG-AREA(WS-MIR-START-COORDINATE:WS-MIR-LEN).

PF 13      PERFORM  4130-SET-LSIR-RETURN-CD
PF 13          THRU 4130-SET-LSIR-RETURN-CD-X.

PF 13      IF NOT LSIR-RETURN-OK
PF 13          GO TO 4100-PROCESS-ONE-MIR-X
PF 13      END-IF.

PF 13 *    IF WS-MIR-RETRN-RQST-FAILED
PF 13 *    OR WS-MIR-RETRN-INVALD-RQST
PF 13 *        SET LSIR-APPLICATION-ERROR         TO TRUE
PF 13 *    END-IF.
PF 13 *
PF 13 *
PF 13 *    IF  NOT WGLOB-GOOD-RETURN
PF 13 *    OR  WGLOB-GUI-RETRN-ERROR
PF 13 *        SET LSIR-APPLICATION-ERROR         TO TRUE
PF 13 *        IF  WS-MIR-RETRN-RQST-FAILED
PF 13 *            SET LSIR-APPL-ERROR-ROLLBACK   TO TRUE
PF 13 *            SET WS-MIR-PROCESSING-COMPLETE TO TRUE
PF 13 *            GO TO 4100-PROCESS-ONE-MIR-X
PF 13 *        END-IF
PF 13 *    END-IF.

           MOVE WGLOB-MORE-DATA-IND        TO LSIR-MORE-DATA-IND.
PF 13      PERFORM  4090-UPDATE-MIR-COORDINATE
PF 13          THRU 4090-UPDATE-MIR-COORDINATE-X.

      *
      *  IF CONNECTING, THEN SAVE NUMERIC AND DATE FORMATTING INFO
      *
PF 13 *  UPDATE FIELDS FOR LOOPING CONTROL
PF 13 *    ADD  WS-MIR-LEN
PF 13 *      TO WS-MIR-START-COORDINATE.
PF 13 *    MOVE LSIR-MSG-AREA(WS-MIR-START-COORDINATE:11)
PF 13 *      TO WS-MIR-CONTROL-FIELDS.
PF 13 *    IF WS-MIR-LEN NUMERIC
PF 13 *        MOVE LSIR-MSG-AREA(WS-MIR-START-COORDINATE:WS-MIR-LEN)
PF 13 *                                    TO WS-MIR-INTERFACE
PF 13 *    END-IF.

       4100-PROCESS-ONE-MIR-X.
           EXIT.
PF 1.2*---------------------------
PF 1.2 4110-FLOW-ACCESS-VALIDATION.
PF 1.2*---------------------------
PF 1.2
PF 1.2     EVALUATE TRUE
PF 1.2         WHEN LSIR-PRCES-TRANSACTION
PF 13 *            MOVE LSIR-DT-FRMT-CD      TO WGLOB-DT-FRMT-CD
PF 13 *            MOVE LSIR-DT-SPRT-CD      TO WGLOB-DT-SEPARATOR-SYMBL
PF 13 *            MOVE LSIR-LEAD-ZERO-IND   TO WGLOB-DT-ZERO-SUPRES-IND
PF 13 *            MOVE LSIR-MOS-ABBR-TXT    TO WGLOB-MOS-ABBR-TXT
PF 1.2             PERFORM  7000-CHECK-IF-SIGNED-ON
PF 1.2                 THRU 7000-CHECK-IF-SIGNED-ON-X
PF 1.2             PERFORM  7300-READ-BPFS-REC
PF 1.2                 THRU 7300-READ-BPFS-REC-X
PF 13              PERFORM  7800-GET-MONTH-ABBREVIATIONS
PF 13                  THRU 7800-GET-MONTH-ABBREVIATIONS-X
PF 1.2         WHEN LSIR-PRCES-LOGIN
PF 1.2             CONTINUE
PF 1.2
PF 1.2         WHEN LSIR-PRCES-BFCN-SESSION
PF 1.2             IF  WS-MIR-BF-SIGN-IN
PF 1.2                 CONTINUE
PF 1.2             ELSE
PF 13                  MOVE WS-MIR-BUS-FCN-ID     TO LSIR-BPF-ID
PF 1.2                 PERFORM  7300-READ-BPFS-REC
PF 1.2                     THRU 7300-READ-BPFS-REC-X
PF 13                  PERFORM  7800-GET-MONTH-ABBREVIATIONS
PF 13                      THRU 7800-GET-MONTH-ABBREVIATIONS-X
PF 1.2             END-IF
PF 1.2
PF 1.2         WHEN OTHER
PF 1.2             SET LSIR-SECURITY-CHECK-FAILED TO TRUE
PF 1.2
PF 1.2     END-EVALUATE.
PF 1.2
PF 1.2 4110-FLOW-ACCESS-VALIDATION-X.
PF 1.2     EXIT.
      /
PF 13 *------------------------
PF 13  4120-CALL-PROCESS-DRIVER.
PF 13 *------------------------
PF 13
PF 13      MOVE SPACES                         TO WPGWS-PREV-PGM-ID.
PF 13      MOVE WPGWS-CRNT-PGM-ID              TO WGLOB-PREV-PGM-ID.
PF 13      MOVE WGLOB-MAIN-PGM-ID              TO WGLOB-CRNT-PGM-ID.
PF 13
PF 13      MOVE WGLOB-MAIN-PGM-ID              TO WPGWS-CALL-PGM-ID.
PF 13      MOVE WS-MIR-BUS-FCN-ID              TO WGLOB-BUS-FCN-ID.
PF 13      CALL WPGWS-CALL-PGM-ID USING DFHEIBLK
PF 13                                   DFHCOMMAREA
PF 13                                   WGLOB-GLOBAL-AREA
PF 13                                   WS-MIR-INTERFACE.
PF 13
PF 13      IF  WGLOB-RETURN-ABEND
PF 13          PERFORM  9000-PROCESS-ABEND
PF 13              THRU 9000-PROCESS-ABEND-X
PF 13      END-IF.
PF 13
PF 13      MOVE WPGWS-CRNT-PGM-ID              TO WGLOB-CRNT-PGM-ID.
PF 13      MOVE SPACES                         TO WGLOB-PREV-PGM-ID.
PF 13
PF 13  4120-CALL-PROCESS-DRIVER-X.
PF 13      EXIT.

PF 13 *-----------------------
PF 13  4130-SET-LSIR-RETURN-CD.
PF 13 *-----------------------
PF 13
MP1669     IF  WS-MIR-RETRN-CD > WS-HIGHEST-MIR-RETRN-CD
MP1669         MOVE WS-MIR-RETRN-CD         TO WS-HIGHEST-MIR-RETRN-CD
MP1669     END-IF.
MP1669
PF 13      IF WS-MIR-RETRN-RQST-FAILED
PF 13      OR WS-MIR-RETRN-INVALD-RQST
PF 13          SET LSIR-APPLICATION-ERROR         TO TRUE
PF 13      END-IF.
PF 13
PF 13 * THE FOLLOWING LINES REALLY BELONG TO CHANGE 014221 INGENIUM 6.2
PF 13 *    IF  WS-MIR-RETRN-TS-MISMATCH
PF 13 *        SET LSIR-TS-MISMATCH-ERROR         TO TRUE
PF 13 *        SET WS-MIR-PROCESSING-COMPLETE     TO TRUE
PF 13 *        GO TO 4130-SET-LSIR-RETURN-CD-X
PF 13 *    END-IF.
PF 13
PF 13      IF  NOT WGLOB-GOOD-RETURN
PF 13          SET LSIR-APPLICATION-ERROR         TO TRUE
PF 13          IF  WS-MIR-RETRN-RQST-FAILED
PF 13              SET LSIR-APPL-ERROR-ROLLBACK   TO TRUE
PF 13              SET WS-MIR-PROCESSING-COMPLETE TO TRUE
PF 13              GO TO 4130-SET-LSIR-RETURN-CD-X
PF 13          END-IF
PF 13      END-IF.
PF 13
PF 13  4130-SET-LSIR-RETURN-CD-X.
PF 13      EXIT.

      *---------------------
       5000-PROCESS-CLEAN-UP.
      *---------------------
017618*
017618* CLEAN UP ANY TWRK RECORDS RELATED TO THE CURRENT PROCESS ID (PID)
017618*
       
B00316*
B00316* IF THE USER HAS CHOSEN THE SIGNOFF OPTION, THEN THE 'USES' ROW
B00316* HAS ALREADY BEEN DELETED, SO BYPASS THE CALL OF PARA 7000-
B00316* AND POPULATE WGLOB-USER-ID FROM LSIR-USER-ID SO THAT THE CLEANUP
B00316* WILL WORK AND WE WILL NOT HAVE ANY ORPHANED MSIN ROWS GENERATED
B00316* BY THE CLEANUP PROCESS.
PF 13 * B00316 CHANGES DROPPED DUE TO PATHFINDER 1.3 RELEASE
PF 13 *    IF WGLOB-BPF-ID = 'BF0062Signoff'
PF 13 *       MOVE LSIR-USER-ID   TO WGLOB-USER-ID
PF 13 *       SET  LSIR-RETURN-OK TO TRUE
PF 13 *    ELSE
PF 13 *       PERFORM  7000-CHECK-IF-SIGNED-ON
PF 13 *            THRU 7000-CHECK-IF-SIGNED-ON-X
PF 13 *    END-IF.

017618*    IF LSIR-RETURN-OK
017618*        MOVE WGLOB-USER-ID          TO L8095-USER-ID
017618*        PERFORM  8095-2000-CLEANUP-TWRK
017618*            THRU 8095-2000-CLEANUP-TWRK-X
017618*
017618     MOVE WGLOB-USER-SESN-ID          TO WUSES-USER-SESN-ID.
017618     PERFORM  USES-1000-READ
017618         THRU USES-1000-READ-X.
017618
017618     IF WUSES-IO-OK
PF 13          PERFORM  7120-UPDATE-LSIR-FROM-USES
PF 13              THRU 7120-UPDATE-LSIR-FROM-USES-X
017618         PERFORM  7110-INIT-GLOB-FROM-USES
017618             THRU 7110-INIT-GLOB-FROM-USES-X
017618         MOVE RUSES-USER-SESN-ID      TO L8095-USER-ID
017618         PERFORM  8095-4000-CLEANUP-TWRK-PID
017618             THRU 8095-4000-CLEANUP-TWRK-PID-X
PF 13      ELSE
PF 13          SET WS-SUMMARY-BYPASS-YES    TO TRUE
           END-IF.
PF 13      PERFORM  7800-GET-MONTH-ABBREVIATIONS
PF 13          THRU 7800-GET-MONTH-ABBREVIATIONS-X.

       5000-PROCESS-CLEAN-UP-X.
           EXIT.

      *--------------
       6000-SUMMARIZE.
      *--------------

PF 13      IF  WS-SUMMARY-BYPASS-YES
PF 13          GO TO 6000-SUMMARIZE-X
PF 13      END-IF.

           PERFORM  6100-RETURN-USER-INFO
               THRU 6100-RETURN-USER-INFO-X.
      *
      *  RETRIEVE MESSAGES AND INSERT INTO SIR
      *
           PERFORM  1611-2000-RETRIEVE-MSIN
               THRU 1611-2000-RETRIEVE-MSIN-X.

           PERFORM  6200-MOVE-MSIN-TO-LSIR
               THRU 6200-MOVE-MSIN-TO-LSIR-X
            VARYING WS-SUB FROM 1 BY 1
              UNTIL WS-SUB > L1611-MSIN-REC-CTR
                 OR L1611-MSIN-USER-MSG-TXT (WS-SUB) = SPACE.

           MOVE L1611-MSIN-MORE-MESSAGES-IND
             TO LSIR-MORE-MESSAGES-IND.

      ******************************************************************
      *  THE FOLLOWING TWO OPTIONS ARE USED FOR DEBUGGING PURPOSES TO
      *  ALLOW A TEST CONDITION TO BE FORCED THROUGH REGARDLESS OF
      *  CONSEQUENCE, OR TO ALLOW THE REPETITION OF A TEST NUMEROUS
      *  TIMES WITHOUT ANY UPDATES ACTUALLY TAKING PLACE.
      ******************************************************************
           IF  LSIR-ROLLBACK-NEVER
               GO TO 6000-SUMMARIZE-X
           END-IF.

           IF  LSIR-ROLLBACK-ALWAYS
MVS   *        EXEC CICS
MVS   *             SYNCPOINT ROLLBACK
MVS   *        END-EXEC
NTDEV          PERFORM  0035-2000-ROLLBACK
NTDEV              THRU 0035-2000-ROLLBACK-X
               GO TO 6000-SUMMARIZE-X
           END-IF.

           IF  LSIR-APPL-ERROR-ROLLBACK
PF 13      OR  (LSIR-PRCES-BFCN-SESSION AND
PF 13           LSIR-SECURITY-CHECK-FAILED)
               PERFORM  1611-1000-ROLLBACK-SAVE-MSIN
                   THRU 1611-1000-ROLLBACK-SAVE-MSIN-X
               PERFORM  6300-ROLLBACK-MESSAGE
                   THRU 6300-ROLLBACK-MESSAGE-X
MP1669*        MOVE WS-HOLD-LSIR-MSG-AREA   TO LSIR-MSG-AREA
MP1669         IF  WS-HIGHEST-RETRN-ERROR-OVRID
MP1669         AND LSIR-APPL-ERROR-ROLLBACK
MP1669             SET LSIR-APPLICATION-ERROR   TO TRUE
MP1669         ELSE
MP1669             MOVE WS-HOLD-LSIR-MSG-AREA   TO LSIR-MSG-AREA
MP1669         END-IF
           END-IF.

       6000-SUMMARIZE-X.
           EXIT.

      *---------------------
       6100-RETURN-USER-INFO.
      *---------------------

PF 13 *    MOVE WGLOB-COMPANY-CODE          TO LSIR-CO-ID.
PF 13 *    MOVE WGLOB-USER-ID               TO LSIR-USER-ID.
PF 13 *    MOVE WGLOB-SECUR-CLAS-ID         TO LSIR-SECUR-CLAS-ID.
PF 13 *    MOVE WGLOB-MSG-SECUR-CLAS-CD     TO LSIR-MSG-SECUR-CLAS-CD.
PF 13 *    MOVE WGLOB-SECUR-CNFD-ACCS-CD    TO LSIR-SECUR-CNFD-ACCS-CD.
PF 13 *    MOVE WGLOB-USER-BRANCH-CODE      TO LSIR-BR-ID.
PF 13 *    MOVE WGLOB-USER-RPT-DSTRB-CD     TO LSIR-USER-RPT-DSTRB-CD.
PF 13 *    MOVE WGLOB-EDIT-LANG             TO LSIR-EDIT-LANG-CD.

PF 13 *    MOVE WGLOB-SYSTEM-DATE-INT       TO L1640-INTERNAL-DATE.
PF 13 *    PERFORM 1640-2000-INTERNAL-TO-EXT
PF 13 *       THRU 1640-2000-INTERNAL-TO-EXT-X
PF 13 *    MOVE L1640-EXTERNAL-DATE         TO LSIR-SYS-DT-EXT.

PF 13 *    MOVE WGLOB-CRCY-SYMBL            TO LSIR-CRCY-SYMBL-CD.
PF 13 *    MOVE WGLOB-THOUSANDS-SYMBL       TO LSIR-THOU-SPRT-CD.
PF 13 *    MOVE WGLOB-DCML-SYMBL            TO LSIR-DCML-SPRT-CD.
PF 13 *    MOVE WGLOB-SIGN-POSN-CD          TO LSIR-CRCY-NEG-PLACE-CD.
PF 13 *    MOVE WGLOB-CRCY-POSN-CD          TO LSIR-CRCY-PLACE-CD.
 
PF 13 * CHANGE TAG 017150 COMMENTED OUT EXCEPT FOR DEFAULT VALUES
17150 *    MOVE WGLOB-CRCY-SCALE-QTY        TO LSIR-CRCY-SCALE-QTY.

PF 13 *    MOVE WGLOB-DT-FRMT-CD            TO LSIR-DT-FRMT-CD.
PF 13 *    MOVE WGLOB-DT-SEPARATOR-SYMBL    TO LSIR-DT-SPRT-CD.
PF 13 *    MOVE WGLOB-DT-ZERO-SUPRES-IND    TO LSIR-LEAD-ZERO-IND.
           MOVE WGLOB-MOS-ABBR-TXT          TO LSIR-MOS-ABBR-TXT.
PF 13      MOVE WGLOB-SYSTEM-DATE-INT       TO LSIR-SYS-DT-EXT.
PF 13      MOVE WGLOB-SECUR-CLAS-ID         TO LSIR-SECUR-CLAS-ID.
PF 13      PERFORM  6110-CONVERT-LSIR-DATES
PF 13          THRU 6110-CONVERT-LSIR-DATES-X.

PF 13 *    SET  LSIR-ISO-DT-FRMT-NO         TO TRUE.

       6100-RETURN-USER-INFO-X.
           EXIT.

PF 13 *-----------------------
PF 13  6110-CONVERT-LSIR-DATES.
PF 13 *-----------------------

PF 13 *  WHEN USER IS NOT SIGNED ON, DATE FIELDS ARE NOT PROPERLY
PF 13 *  INITIALIZED AND THIS ROUTINE ABENDS WITH A LOGIC ERROR.
PF 13 *  TO PROPERLY NOTIFY PRESENTATION LAYER OF THE PROBLEM, THIS
PF 13 *  PARAGRAPH IS EXITED AND THE LSIR-RETURN-CD OF '09' WILL BE
PF 13 *  RETURNED TO THE PRESENTATION LAYER
PF 13      IF LSIR-PRCES-SECURITY
PF 13      OR LSIR-PRCES-BFCN-SESSION
PF 13          IF LSIR-SECURITY-CHECK-FAILED
PF 13              GO TO 6110-CONVERT-LSIR-DATES-X
PF 13          END-IF
PF 13      END-IF.
PF 13
PF 13 *  ALL LSIR DATES CONTAIN AN INTERNAL FORMAT DATE AT THIS TIME.
PF 13 *  THE DATE FORMAT ROUTINE MUST BE CALLED TO REFORMAT THE FIELDS
PF 13 *  INTO THE PROPER EXTERNAL FORMAT.
PF 13      MOVE LSIR-PRCES-DT               TO L1640-INTERNAL-DATE.
PF 13      PERFORM 1640-2000-INTERNAL-TO-EXT
PF 13         THRU 1640-2000-INTERNAL-TO-EXT-X
PF 13      MOVE L1640-EXTERNAL-DATE         TO LSIR-PRCES-DT.
PF 13
PF 13      MOVE LSIR-SYS-DT-EXT             TO L1640-INTERNAL-DATE.
PF 13      PERFORM 1640-2000-INTERNAL-TO-EXT
PF 13         THRU 1640-2000-INTERNAL-TO-EXT-X
PF 13      MOVE L1640-EXTERNAL-DATE         TO LSIR-SYS-DT-EXT.
PF 13
PF 13  6110-CONVERT-LSIR-DATES-X.
           EXIT.

      *----------------------
       6200-MOVE-MSIN-TO-LSIR.
      *----------------------

           ADD 1                        TO LSIR-ERROR-MSG-LINES-USED.
           MOVE L1611-MSIN-USER-MSG-TXT (WS-SUB)
             TO LSIR-USER-MSG-TEXT-T (WS-SUB).
           MOVE L1611-MSIN-USER-MSG-SEVRTY-CD (WS-SUB)
             TO LSIR-USER-MSG-SEVRTY-CD-T (WS-SUB).

           IF  L1611-MSIN-MORE-MESSAGES
           AND LSIR-ERROR-MSG-LINES-USED = L1611-MAX-BUFFER-CTR
              MOVE '*'
              TO LSIR-USER-MSG-TEXT-T (WS-SUB)(120:1)
           END-IF.

           IF  LSIR-APPL-ERROR-ROLLBACK
               GO TO 6200-MOVE-MSIN-TO-LSIR-X
           END-IF.

           IF L1611-MSG-SEVRTY-FATAL (WS-SUB)
           OR L1611-MSG-SEVRTY-FATAL-NO-ROLB (WS-SUB)
               SET LSIR-APPLICATION-ERROR         TO TRUE
               IF  L1611-MSG-SEVRTY-FATAL (WS-SUB)
                   SET LSIR-APPL-ERROR-ROLLBACK   TO TRUE
               END-IF
           END-IF.

       6200-MOVE-MSIN-TO-LSIR-X.
           EXIT.

      *---------------------
       6300-ROLLBACK-MESSAGE.
      *---------------------

           COMPUTE WS-SUB = WS-MAX-LSIR-MESSAGE-CTR - 1.

           PERFORM
              VARYING WS-SUB FROM WS-SUB BY -1
                UNTIL WS-SUB = 0
Q11699          IF  WS-HIGHEST-RETRN-ERROR-OVRID
Q11699          AND LSIR-APPL-ERROR-ROLLBACK
Q11699              CONTINUE
Q11699          ELSE
                   MOVE LSIR-USER-MSG-TEXT-T (WS-SUB)
                     TO LSIR-USER-MSG-TEXT-T (WS-SUB + 1)
                   MOVE LSIR-USER-MSG-SEVRTY-CD-T (WS-SUB)
                     TO LSIR-USER-MSG-SEVRTY-CD-T (WS-SUB + 1)
Q11699          END-IF
           END-PERFORM.

Q11699     IF  WS-HIGHEST-RETRN-ERROR-OVRID
Q11699     AND LSIR-APPL-ERROR-ROLLBACK
Q11699         CONTINUE
Q11699     ELSE
      *MSG: FATAL MESSAGES WERE GENERATED - ALL UPDATES WERE ROLLED BACK
Q11699         MOVE 'XS00100011'                 TO WGLOB-MSG-REF-INFO
Q11699         PERFORM  0260-1000-GENERATE-MESSAGE
Q11699             THRU 0260-1000-GENERATE-MESSAGE-X
Q11699         MOVE WGLOB-MSG-TXT                TO 
Q11699                                       LSIR-USER-MSG-TEXT-T (01)
Q11699     END-IF.
Q11699
Q11699*           MOVE WGLOB-MSG-TXT              TO LSIR-USER-MSG-TEXT-T (01).
Q11699*           MOVE 'XS00100011'                 TO WGLOB-MSG-REF-INFO.
Q11699*           PERFORM  0260-1000-GENERATE-MESSAGE
Q11699*               THRU 0260-1000-GENERATE-MESSAGE-X.

Q11699*           MOVE WGLOB-MSG-TXT              TO LSIR-USER-MSG-TEXT-T (01).
016227*    ADD +1                          TO LSIR-ERROR-MSG-LINES-USED.

016227     SET L1611-MAX-BUFFER-RETRIEVAL TO TRUE.
016227     IF LSIR-ERROR-MSG-LINES-USED = L1611-MAX-BUFFER-CTR
016227         SET LSIR-MORE-MESSAGES    TO TRUE
016227     ELSE
016227         ADD +1                    TO LSIR-ERROR-MSG-LINES-USED
016227     END-IF.

       6300-ROLLBACK-MESSAGE-X.
           EXIT.

      *-----------------------
       7000-CHECK-IF-SIGNED-ON.
      *-----------------------
      *
      *  FIND ACTIVE USES RECORD
      *
PF 13      MOVE WGLOB-USER-SESN-ID          TO WUSES-USER-SESN-ID.
PF 13
PF 13      PERFORM USES-1000-READ
PF 13         THRU USES-1000-READ-X.
PF 13 *
PF 13 *  MSG: USER NOT SIGNED ON
PF 13 *
PF 13      IF  NOT WUSES-IO-OK
PF 13          SET  LSIR-SERVER-ERROR       TO TRUE
PF 13 *MSG: USER SESSION RECORD NOT FOUND.  PLEASE LOGIN
PF 13          MOVE 'XS00100007'            TO WGLOB-MSG-REF-INFO
PF 13          PERFORM  0260-1000-GENERATE-MESSAGE
PF 13              THRU 0260-1000-GENERATE-MESSAGE-X
PF 13          GO TO 7000-CHECK-IF-SIGNED-ON-X
PF 13      END-IF.
PF 13
PF 13      PERFORM  7120-UPDATE-LSIR-FROM-USES
PF 13          THRU 7120-UPDATE-LSIR-FROM-USES-X.
PF 13      PERFORM  7110-INIT-GLOB-FROM-USES
PF 13          THRU 7110-INIT-GLOB-FROM-USES-X.

PF 13 *    PERFORM  7100-READ-USES-REC
PF 13 *        THRU 7100-READ-USES-REC-X.

PF 13 *    PERFORM  7200-READ-USEC-REC
PF 13 *        THRU 7200-READ-USEC-REC-X.
016770*
016770*    PERFORM  7500-READ-USCL-REC
016770*        THRU 7500-READ-USCL-REC-X.

       7000-CHECK-IF-SIGNED-ON-X.
           EXIT.

PF 13 *------------------
PF 13 *7100-READ-USES-REC.
PF 13 *------------------
PF 13 *
PF 1.2*    MOVE LSIR-USER-SESN-ID           TO WUSES-USER-SESN-ID.
PF 13 *    MOVE WGLOB-USER-SESN-ID          TO WUSES-USER-SESN-ID.
PF 13 *
PF 13 *    PERFORM USES-1000-READ
PF 13 *       THRU USES-1000-READ-X.
PF 13 *
PF 13 *  MSG: USER NOT SIGNED ON
PF 13 *
PF 13 *    IF  NOT WUSES-IO-OK
PF 13 *        SET  LSIR-SERVER-ERROR       TO TRUE
PF 13 *MSG: USER SESSION RECORD NOT FOUND.  PLEASE LOGIN
PF 13 *        MOVE 'XS00100007'            TO WGLOB-MSG-REF-INFO
PF 13 *        PERFORM  0260-1000-GENERATE-MESSAGE
PF 13 *            THRU 0260-1000-GENERATE-MESSAGE-X
PF 13 *        GO TO 7100-READ-USES-REC-X
PF 13 *    END-IF.
PF 13 *
017618*    MOVE RUSES-USER-ID               TO LSIR-USER-ID.
PF 1.2*    MOVE RUSES-USER-SESN-PRCES-DT    TO LSIR-PRCES-DT-INT.
017618*    MOVE RUSES-USER-SESN-PRCES-DT    TO L1640-INTERNAL-DATE.
017618*    PERFORM 1640-2000-INTERNAL-TO-EXT
017618*       THRU 1640-2000-INTERNAL-TO-EXT-X.
017618*    MOVE L1640-EXTERNAL-DATE         TO LSIR-PRCES-DT.
017618*    MOVE RUSES-USER-SESN-CRCY-CD     TO LSIR-USER-SESN-CRCY-CD
017618*    MOVE RUSES-USER-SESN-CTRY-CD     TO LSIR-USER-SESN-CTRY-CD.
017618*    MOVE RUSES-CO-ID                 TO LSIR-CO-ID.
017618*    MOVE RUSES-EDIT-LANG-CD          TO LSIR-EDIT-LANG-CD.
017618*
017618*    MOVE RUSES-USER-ID               TO WGLOB-USER-ID.
017618*    MOVE RUSES-USER-SESN-PRCES-DT    TO WGLOB-PROCESS-DATE.
017618*    MOVE RUSES-USER-SESN-CRCY-CD     TO WGLOB-CURRENCY-CODE.
017618*    MOVE RUSES-USER-SESN-CTRY-CD     TO WGLOB-COUNTRY-CODE.
017618*    MOVE RUSES-CO-ID                 TO WGLOB-COMPANY-CODE.
017618*    MOVE RUSES-EDIT-LANG-CD          TO WGLOB-EDIT-LANG.
017618*    MOVE RUSES-USER-SESN-BTCH-NUM    TO WGLOB-USER-SESN-BTCH-NUM.

PF 13 * THE FOLLOWING CHANGE - B10135 MOVED TO PARA 7110-INIT-GLOB-FROM-USES
       
B10135*    IF  WFUTD-ALLOW-FUTR-DT
B10135*        PERFORM  1610-1000-GET-DATE-TIME
B10135*            THRU 1610-1000-GET-DATE-TIME-X
B10135*        MOVE L1610-SYSTEM-TIME           TO LSIR-SYS-TIME
B10135*        MOVE L1610-SYSTEM-TIME           TO WGLOB-SYSTEM-TIME
B10135*        MOVE L1610-SYSTEM-TIME-INT       TO WGLOB-SYSTEM-TIME-INT
B10135*        MOVE L1610-SYSTEM-DATE-INT       TO WGLOB-SYSTEM-DATE-INT
B10135*    END-IF.

PF 13 *7100-READ-USES-REC-X.
PF 13 *    EXIT.

      *-------------------------
017618 7110-INIT-GLOB-FROM-USES.
      *-------------------------
017618
PF 13 *    MOVE RUSES-USER-ID               TO LSIR-USER-ID.
PF 13 *    MOVE RUSES-USER-SESN-PRCES-DT    TO L1640-INTERNAL-DATE.
PF 13 *    PERFORM 1640-2000-INTERNAL-TO-EXT
PF 13 *       THRU 1640-2000-INTERNAL-TO-EXT-X.
PF 13 *    MOVE L1640-EXTERNAL-DATE         TO LSIR-PRCES-DT.
PF 13 *    MOVE RUSES-USER-SESN-CRCY-CD     TO LSIR-USER-SESN-CRCY-CD
PF 13 *    MOVE RUSES-USER-SESN-CTRY-CD     TO LSIR-USER-SESN-CTRY-CD.
PF 13 *    MOVE RUSES-CO-ID                 TO LSIR-CO-ID.
PF 13 *    MOVE RUSES-EDIT-LANG-CD          TO LSIR-EDIT-LANG-CD.
017618
017618     MOVE RUSES-USER-ID               TO WGLOB-USER-ID.
017618     MOVE RUSES-USER-SESN-PRCES-DT    TO WGLOB-PROCESS-DATE.
017618     MOVE RUSES-USER-SESN-CRCY-CD     TO WGLOB-CURRENCY-CODE.
017618     MOVE RUSES-USER-SESN-CTRY-CD     TO WGLOB-COUNTRY-CODE.
017618     MOVE RUSES-CO-ID                 TO WGLOB-COMPANY-CODE.
017618     MOVE RUSES-EDIT-LANG-CD          TO WGLOB-EDIT-LANG.
017618     MOVE RUSES-USER-SESN-BTCH-NUM    TO WGLOB-USER-SESN-BTCH-NUM.
016770     MOVE RUSES-SECUR-CNFD-ACCS-CD    TO WGLOB-SECUR-CNFD-ACCS-CD.
016770     MOVE RUSES-SECUR-LVL-CD          TO WGLOB-SECUR-LVL-CD.
016770     MOVE RUSES-SECUR-CLAS-ID         TO WGLOB-SECUR-CLAS-ID.
016770     MOVE RUSES-BR-ID                 TO WGLOB-USER-BRANCH-CODE.
016770     MOVE RUSES-RPT-DSTRB-CD          TO WGLOB-USER-RPT-DSTRB-CD.
016770     MOVE RUSES-CTRY-DT-FRMT-CD       TO WGLOB-DT-FRMT-CD.
016770     MOVE RUSES-CTRY-DT-SPRT-CD       TO WGLOB-DT-SEPARATOR-SYMBL.
016770     MOVE RUSES-CTRY-LEAD-ZERO-IND    TO WGLOB-DT-ZERO-SUPRES-IND.
016770     MOVE RUSES-CRCY-SYMBL-CD         TO WGLOB-CRCY-SYMBL.
016770     MOVE RUSES-CRCY-PLACE-CD         TO WGLOB-CRCY-POSN-CD.
016770     MOVE RUSES-CRCY-NEG-PLACE-CD     TO WGLOB-SIGN-POSN-CD.
016770     MOVE RUSES-CRCY-DCML-SPRT-CD     TO WGLOB-DCML-SYMBL.
016770     MOVE RUSES-CRCY-THOU-SPRT-CD     TO WGLOB-THOUSANDS-SYMBL.

PF 13 * THE FOLLOWING CHANGE - B10135 MOVED FROM PARA 7100-READ-USES-REC

B10135     IF  WFUTD-ALLOW-FUTR-DT
B10135         PERFORM  1610-1000-GET-DATE-TIME
B10135             THRU 1610-1000-GET-DATE-TIME-X
B10135         MOVE L1610-SYSTEM-TIME           TO LSIR-SYS-TIME
B10135         MOVE L1610-SYSTEM-TIME           TO WGLOB-SYSTEM-TIME
B10135         MOVE L1610-SYSTEM-TIME-INT       TO WGLOB-SYSTEM-TIME-INT
B10135         MOVE L1610-SYSTEM-DATE-INT       TO WGLOB-SYSTEM-DATE-INT
B10135     END-IF.

017618 7110-INIT-GLOB-FROM-USES-X.
017618     EXIT.

PF 13 *---------------------------
PF 13  7120-UPDATE-LSIR-FROM-USES.
PF 13 *---------------------------
PF 13 *  CONVERSION OF THE DATE TO EXTERNAL FORMAT WILL TAKE PLACE IN
PF 13 *  THE 6110- PARAGRAPH
PF 13
PF 13      MOVE RUSES-USER-SESN-PRCES-DT    TO LSIR-PRCES-DT.
PF 13
PF 13  7120-UPDATE-LSIR-FROM-USES-X.
PF 13      EXIT.

PF 13 *------------------
PF 13 *7200-READ-USEC-REC.
PF 13 *------------------
PF 13 *
PF 13 *    MOVE WGLOB-USER-ID               TO WUSEC-USER-ID.
PF 13 *    PERFORM  USEC-1000-READ
PF 13 *        THRU USEC-1000-READ-X.
PF 13 *
016770*    IF WUSEC-IO-OK
016770*        MOVE RUSEC-SECUR-CLAS-ID     TO WGLOB-SECUR-CLAS-ID
016770*        MOVE RUSEC-BR-ID             TO WGLOB-USER-BRANCH-CODE
016770*        MOVE RUSEC-USER-RPT-DSTRB-CD TO WGLOB-USER-RPT-DSTRB-CD
016770*    ELSE
PF 13 *    IF NOT WUSEC-IO-OK
PF 13 *        SET LSIR-SERVER-ERROR        TO TRUE
PF 13 *MSG: USER SECURITY RECORD  (@1) NOT FOUND
PF 13 *        MOVE WGLOB-USER-ID           TO WGLOB-MSG-PARM (1)
PF 13 *        MOVE 'XS00100008'            TO WGLOB-MSG-REF-INFO
PF 13 *        PERFORM  0260-1000-GENERATE-MESSAGE
PF 13 *            THRU 0260-1000-GENERATE-MESSAGE-X
PF 13 *    END-IF.
PF 13 *
PF 13 *7200-READ-USEC-REC-X.
PF 13 *    EXIT.

      *------------------
       7300-READ-BPFS-REC.
      *------------------

           MOVE WGLOB-SECUR-CLAS-ID          TO WBPFS-SECUR-CLAS-ID.
           MOVE LSIR-BPF-ID                  TO WBPFS-BPF-ID.

PF 13 * IF BPFS-RECORD IN WORKING STORAGE MATCHES THE ONE WE ARE ABOUT
PF 13 * TO READ, THEN DON'T BOTHER WITH THE I/O

PF 13      IF WBPFS-KEY = RBPFS-KEY
PF 13          GO TO 7300-READ-BPFS-REC-X
PF 13      END-IF.

           PERFORM  BPFS-1000-READ
               THRU BPFS-1000-READ-X.

           IF  WBPFS-IO-NOT-FOUND
               SET  LSIR-SECURITY-CHECK-FAILED  TO TRUE
      *MSG: PROCESS FLOW SECURITY RECORD (@1@2) NOT FOUND
               MOVE LSIR-SECUR-CLAS-ID       TO WGLOB-MSG-PARM (1)
               MOVE LSIR-BPF-ID              TO WGLOB-MSG-PARM (2)
PIRAEX* IF THE REQUEST COMES THROUGH P STEP INTERFACE THROW          
PIRAEX* SPECIAL MSG AND WRITE INTO AUDIT REPORT SINCE IT MAY BE      
PIRAEX* SECURITY VIOLATION          
PIRAEX*        MOVE 'XS00100002'             TO WGLOB-MSG-REF-INFO
PIRAEX         IF  LSIR-PRCES-BFCN-SESSION 
PIRAEX* WRITE TO AUDIT REPORT - SECURITY VIOLATION
PIRAEX             PERFORM  2490-1000-BUILD-PARM-INFO
PIRAEX                 THRU 2490-1000-BUILD-PARM-INFO-X
PIRAEX*TEXT: P-STEP INTERFACE:SECURITY CLASS @1 NOT AUTHORIZED    
PIRAEX             MOVE '00001'              TO WS-TXT-SRC-REF-ID
PIRAEX             MOVE WGLOB-SECUR-CLAS-ID  TO L2490-TXT-PARM (1)
PIRAEX             PERFORM  9600-OUTPUT-USAU-RECORD
PIRAEX                 THRU 9600-OUTPUT-USAU-RECORD-X
PIRAEX*MSG: INTERNAL DATA SETUP PROBLEM- PLEASE CONTACT SYSTEMS
PIRAEX             MOVE 'XS00660018'         TO WGLOB-MSG-REF-INFO
PIRAEX         ELSE 
PIRAEX*MSG: PROCESS FLOW SECURITY RECORD (@1@2) NOT FOUND
PIRAEX             MOVE 'XS00100002'         TO WGLOB-MSG-REF-INFO
PIRAEX         END-IF 
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               GO TO  7300-READ-BPFS-REC-X
           END-IF.
      *
      *  RETURN PROCESS FLOW LEVEL INFORMATION TO THE CLIENT
      *
013578     IF  RBPFS-BPF-SECUR-AUD-NO
013578         SET WGLOB-AUDIT-NOT-REQUESTED TO TRUE
PF 13 *        MOVE WGLOB-BPF-SECUR-AUD-IND  TO LSIR-BPF-SECUR-AUD-IND
013578     END-IF.
013578     MOVE RBPFS-MSG-SECUR-CLAS-CD      TO WGLOB-MSG-SECUR-CLAS-CD.
PF 13 *    MOVE RBPFS-MSG-SECUR-CLAS-CD      TO LSIR-MSG-SECUR-CLAS-CD.

       7300-READ-BPFS-REC-X.
           EXIT.

      *------------------
       7400-READ-BFCN-REC.
      *------------------

           MOVE WS-MIR-BUS-FCN-ID        TO WBFCN-BUS-FCN-ID.

           PERFORM  BFCN-1000-READ
               THRU BFCN-1000-READ-X.

           IF  WBFCN-IO-NOT-FOUND
               SET  LSIR-SERVER-ERROR    TO  TRUE
               MOVE WBFCN-BUS-FCN-ID     TO WGLOB-MSG-PARM (1)
      *MSG: BUSINESS FUNCTION ID (@1) NOT FOUND
               MOVE 'XS00100004'         TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               GO TO  7400-READ-BFCN-REC-X
           END-IF.
      *
      *  RETURN TRANSACTION LEVEL INFORMATION TO THE CLIENT
      *
           MOVE RBFCN-BUS-FCN-PDRVR-ID       TO WGLOB-MAIN-PGM-ID.
013578     MOVE RBFCN-BUS-FCN-AUD-IND        TO WGLOB-BPF-SECUR-AUD-IND.

       7400-READ-BFCN-REC-X.
           EXIT.

016770*------------------
016770*7500-READ-USCL-REC.
016770*------------------
016770*
016770*    MOVE WGLOB-SECUR-CLAS-ID          TO WUSCL-SECUR-CLAS-ID.
016770*
016770*    PERFORM  USCL-1000-READ
016770*        THRU USCL-1000-READ-X.
016770*
016770*    MOVE RUSCL-SECUR-LVL-CD           TO WGLOB-SECUR-LVL-CD.
016770*
016770*7500-READ-USCL-REC-X.
016770*    EXIT.

PF 13 *-------------------
PF 13  7700-GET-DEFAULT-CO.
PF 13 *-------------------
PF 13
PF 13      MOVE WS-DEFAULT-EDIT-LANG-CD  TO L0012-ETBL-LANG-CD.
PF 13      PERFORM  0012-1000-GET-DEFAULT-CO-ID
PF 13          THRU 0012-1000-GET-DEFAULT-CO-ID-X.
PF 13      IF  L0012-RETRN-INVALID-REQUEST
PF 13          PERFORM  0030-5000-LOGIC-ERROR
PF 13              THRU 0030-5000-LOGIC-ERROR-X
PF 13      END-IF.
PF 13      MOVE L0012-ETBL-VALU-ID       TO WGLOB-COMPANY-CODE.
PF 13
PF 13  7700-GET-DEFAULT-CO-X.
PF 13      EXIT.

PF 13 *----------------------------
PF 13  7800-GET-MONTH-ABBREVIATIONS.
PF 13 *----------------------------

PF 13      IF NOT WGLOB-DT-FRMT-DDMMMYYYY
PF 13         GO TO 7800-GET-MONTH-ABBREVIATIONS-X
PF 13      END-IF.

PF 13 *  RETRIEVE MONTH ABBREVIATIONS FOR DATE TYPE
PF 13      PERFORM  2490-1000-BUILD-PARM-INFO
PF 13          THRU 2490-1000-BUILD-PARM-INFO-X.

PF 13      MOVE 'XSDU1640'                TO L2490-TXT-SRC-ID.
PF 13      MOVE '00001'                   TO L2490-TXT-SRC-REF-ID.

PF 13      PERFORM  2490-1000-RETRIEVE-TEXT
PF 13          THRU 2490-1000-RETRIEVE-TEXT-X.

PF 13      IF L2490-RETRN-OK
PF 13          MOVE L2490-TXT-STR-TXT     TO WGLOB-MOS-ABBR-TXT
PF 13      ELSE
PF 13          MOVE 'JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC'
PF 13                                     TO WGLOB-MOS-ABBR-TXT
PF 13      END-IF.

PF 13  7800-GET-MONTH-ABBREVIATIONS-X.
PF 13      EXIT.
PF 13 /
PF 1.2*-----------------------
PF 1.2 8000-PROCESS-NO-SESSION.
PF 1.2*-----------------------
PF 1.2*
PF 13      PERFORM  7800-GET-MONTH-ABBREVIATIONS
PF 13          THRU 7800-GET-MONTH-ABBREVIATIONS-X.
PF 13 *  CHECK THAT THE REQUESTED BUSINESS FUNCTIONS EXIST IN BPFS AND
PF 13 *  THAT THE USER HAS ACCESS TO ALL OF THEM.

PF 1.2*  CHECK THAT THE REQUESTED BUSINESS FUNCTION EXISTS
PF 1.2*
PF 13 *    MOVE LSIR-MSG-AREA(1:11)      TO WS-MIR-CONTROL-FIELDS.
PF 13 *    MOVE WS-MIR-BUS-FCN-ID        TO WBFCN-BUS-FCN-ID.
PF 13 *
PF 13 *    PERFORM  BFCN-1000-READ
PF 13 *        THRU BFCN-1000-READ-X.
PF 13 *
PF 13 *    IF  WBFCN-IO-NOT-FOUND
PF 13 *        SET  LSIR-SERVER-ERROR    TO  TRUE
PF 13 *        GO TO  8000-PROCESS-NO-SESSION-X
PF 13 *    END-IF.
PF 1.2*
PF 1.2*    GET DEFAULT COMPANY ID
PF 1.2*
PF 13 *    MOVE WS-DEFAULT-EDIT-LANG-CD  TO L0012-ETBL-LANG-CD.
PF 13 *    PERFORM  0012-1000-GET-DEFAULT-CO-ID
PF 13 *        THRU 0012-1000-GET-DEFAULT-CO-ID-X.
PF 13 *
PF 13 *    MOVE L0012-ETBL-VALU-ID       TO LSIR-CO-ID.
PF 13 *    MOVE L0012-ETBL-VALU-ID       TO WGLOB-COMPANY-CODE.
PF 1.2*
PF 1.2* RETRIEVE THE APPL RECORD FOR THE COMPANY TO SET THE EDIT LANG
PF 1.2*
PF 1.2     PERFORM  APPL-1000-READ
PF 1.2         THRU APPL-1000-READ-X.
PF 1.2     IF WAPPL-IO-OK
PF 1.2         MOVE RAPPL-APPL-EDIT-LANG-CD  TO WGLOB-EDIT-LANG
PF 1.2     ELSE
PF 1.2         MOVE WS-DEFAULT-EDIT-LANG-CD  TO WGLOB-EDIT-LANG
PF 1.2     END-IF.
PF 1.2*
PF 13      PERFORM  4050-VALIDATE-MIR-QTY
PF 13          THRU 4050-VALIDATE-MIR-QTY-X.
PF 13 *
PF 1.2*  THIS PROCESS DOES NOT PERFORM A USES LOOKUP.  TO ENSURE THAT
PF 1.2*  THERE IS NO CONFUSION WITH USES, IT WILL BE INITIALIZED TO LOW
PF 1.2*  VALUES.
PF 1.2
PF 1.2     MOVE LOW-VALUE TO RUSES-REC-INFO.

PF 13 *    PERFORM LOGIN FUNCTION - FIRST FUNCTION ON THE SINGLE P-STEP
           PERFORM  8200-P-STEP-LOGIN
               THRU 8200-P-STEP-LOGIN-X.

PF 13 *    VALIDATE RETURN CODE.
PF 13      IF NOT LSIR-RETURN-OK
PF 13          SET LSIR-SECURITY-CHECK-FAILED TO TRUE
PF 13          GO TO 8000-PROCESS-NO-SESSION-X
PF 13      END-IF.
PF 13
PF 13      PERFORM  4090-UPDATE-MIR-COORDINATE
PF 13          THRU 4090-UPDATE-MIR-COORDINATE-X.
PF 13
PF 13 *    VALIDATE ACCESS TO ALL REMAINING P-STEPS ASSUMING THAT LOGIN
PF 13 *    WAS SUCCESSFUL.

PF 13      MOVE WS-MIR-START-COORDINATE TO WS-MIR-HOLD-COORDINATE.
PF 13      MOVE 2                     TO WS-SUB.
PF 13      PERFORM  8100-VALIDATE-AGAINST-BPFS
PF 13          THRU 8100-VALIDATE-AGAINST-BPFS-X
PF 13         UNTIL WS-MIR-PROCESSING-COMPLETE
PF 13            OR NOT LSIR-RETURN-OK
PF 13            OR WS-SUB > LSIR-MIR-QTY.

PF 13 *    PERFORM  4000-PROCESS-TRANSACTION
PF 13 *        THRU 4000-PROCESS-TRANSACTION-X.
PF 1.2*
PF 1.2*  WHEN A NON-ZERO RETURN CODE IS RECEIVED, THEN CHECK TO SEE
PF 1.2*  IF THAT RETURN CODE WAS CAUSED BY THE SECURITY CHECK - UPDATE
PF 1.2*  THE LSIR-RETURN-CODE TO INDICATE SECURITY CHECK FAILED.
PF 1.2     IF NOT LSIR-RETURN-OK
PF 1.2         MOVE LSIR-MSG-AREA(1:11) TO WS-MIR-CONTROL-FIELDS
PF 1.2         IF  WS-MIR-RETRN-EDIT-ERROR
PF 1.2             SET LSIR-SECURITY-CHECK-FAILED TO TRUE
PF 1.2         END-IF
PF 1.2     END-IF.
PF 13
PF 13 *    PROCESS ALL P-STEPS AFTER THE FIRST LOGIN P-STEP
PF 13      MOVE WS-MIR-HOLD-COORDINATE TO WS-MIR-START-COORDINATE.
PF 13      PERFORM  4070-MOVE-NEXT-MIR-TO-WS
PF 13          THRU 4070-MOVE-NEXT-MIR-TO-WS-X
PF 13
PF 13      PERFORM  4100-PROCESS-ONE-MIR
PF 13          THRU 4100-PROCESS-ONE-MIR-X
PF 13       VARYING WS-SUB FROM 2 BY 1
PF 13         UNTIL WS-MIR-PROCESSING-COMPLETE
PF 13          OR NOT LSIR-RETURN-OK
PF 13          OR WS-SUB > LSIR-MIR-QTY.
                
SESCAP     MOVE WGLOB-USER-SESN-ID         TO WUSES-USER-SESN-ID
SESCAP     PERFORM  USES-1000-READ-FOR-UPDATE
SESCAP         THRU USES-1000-READ-FOR-UPDATE-X.
SESCAP     IF  WUSES-IO-OK
SESCAP         PERFORM  USES-2000-REWRITE
SESCAP             THRU USES-2000-REWRITE-X
SESCAP     END-IF.

PF 1.2*
PF 1.2*  CLEANUP FUNCTIONALITY
PF 1.2*
PF 1.2     MOVE WGLOB-USER-ID          TO L8095-USER-ID.
PF 1.2     PERFORM  8095-2000-CLEANUP-TWRK
PF 1.2         THRU 8095-2000-CLEANUP-TWRK-X.
PF 1.2
PF 1.2 8000-PROCESS-NO-SESSION-X.
PF 1.2     EXIT.
PF 13 *--------------------------
PF 13  8100-VALIDATE-AGAINST-BPFS.
PF 13 *--------------------------
PF 13
PF 13      MOVE WS-MIR-BUS-FCN-ID          TO LSIR-BPF-ID.
PF 13
PF 13      PERFORM  7300-READ-BPFS-REC
PF 13          THRU 7300-READ-BPFS-REC-X.
PF 13
PF 13      ADD  WS-MIR-LEN                 TO WS-MIR-START-COORDINATE.
PF 13      MOVE LSIR-MSG-AREA(WS-MIR-START-COORDINATE:11)
PF 13                                      TO WS-MIR-CONTROL-FIELDS.
PF 13      ADD +1                          TO WS-SUB.
PF 13
PF 13  8100-VALIDATE-AGAINST-BPFS-X.
PF 13      EXIT.

PF 13 *-----------------
PF 13  8200-P-STEP-LOGIN.
PF 13 *-----------------
PF 13
PF 13      PERFORM  4060-INIT-MIR-COORDINATES
PF 13          THRU 4060-INIT-MIR-COORDINATES-X.
PF 13      PERFORM  4070-MOVE-NEXT-MIR-TO-WS
PF 13          THRU 4070-MOVE-NEXT-MIR-TO-WS-X.
PF 13      PERFORM  7400-READ-BFCN-REC
PF 13          THRU 7400-READ-BFCN-REC-X.
PF 13
PF 13      IF NOT LSIR-RETURN-OK
PF 13          GO TO 8200-P-STEP-LOGIN-X
PF 13      END-IF.
PF 13
PF 13      PERFORM  4120-CALL-PROCESS-DRIVER
PF 13          THRU 4120-CALL-PROCESS-DRIVER-X.
PF 13
PF 13      PERFORM  4080-MOVE-WS-TO-MIR
PF 13          THRU 4080-MOVE-WS-TO-MIR-X.
PF 13
PF 13      PERFORM  4130-SET-LSIR-RETURN-CD
PF 13          THRU 4130-SET-LSIR-RETURN-CD-X.
PF 13
PF 13  8200-P-STEP-LOGIN-X.
PF 13      EXIT.

      /
      *------------------
       9000-PROCESS-ABEND.
      *------------------

           IF WGLOB-ERROR-CD-VALID
               NEXT SENTENCE
           ELSE
               SET  WGLOB-CICS-ERROR       TO TRUE
               MOVE SPACES                 TO WGLOB-IO-COMMAND
               MOVE SPACES                 TO WGLOB-OPTM-SQL-STAT-CD
               MOVE SPACES                 TO WGLOB-OPTM-SQL-REQIR
               MOVE SPACES                 TO WGLOB-OPTM-SQL-EXEC
               MOVE ZERO                   TO WGLOB-SEQ-FILE-STATUS
               MOVE ZERO                   TO WGLOB-SQLCODE
               MOVE SPACES                 TO WGLOB-ERROR-DESC-TXT
           END-IF.

           EXEC CICS LINK
                PROGRAM('XSOM0030')
                COMMAREA (WGLOB-GLOBAL-AREA)
                LENGTH   (WGLOB-GLOBAL-LEN)
           END-EXEC.

           SET LSIR-SERVER-ERROR           TO TRUE.
           MOVE WGLOB-ABEND-CD             TO WGLOB-MSG-PARM (1).
           IF WGLOB-SQL-ERROR
               MOVE WGLOB-SQLCODE          TO WS-DISPLAY-S7-0
               MOVE WS-DISPLAY-S7-0        TO WGLOB-MSG-PARM (2)
      *MSG: SERVER REQUEST ABENDED WITH @1, SQLCODE: @2
               MOVE 'XS00100005'           TO WGLOB-MSG-REF-INFO
           ELSE
      *MSG: SERVER REQUEST ABENDED WITH @1
               MOVE 'XS00100006'           TO WGLOB-MSG-REF-INFO
           END-IF.

           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.
           MOVE WGLOB-MSG-TXT              TO LSIR-USER-MSG-TEXT-T (01).
           MOVE 1                          TO LSIR-ERROR-MSG-LINES-USED.
PF 13      MOVE WGLOB-MSG-SEVRTY-CD   TO LSIR-USER-MSG-SEVRTY-CD-T (01).

           IF WGLOB-SQL-ERROR
               MOVE WGLOB-ERROR-DESC-TXT   TO LSIR-USER-MSG-TEXT-T (02)
               ADD +1                      TO LSIR-ERROR-MSG-LINES-USED
PF 13          MOVE '1'               TO LSIR-USER-MSG-SEVRTY-CD-T (02)
           END-IF.

           MOVE  LSIR-PARM-AREA             TO  DFHCOMMAREA.
            
01AR01     IF WENVT-MICROFOCUS-CICS
NTDEV          PERFORM  0035-1000-COMMIT
NTDEV              THRU 0035-1000-COMMIT-X
01AR01     END-IF.

           EXEC CICS
               RETURN
           END-EXEC.
      *
       9000-PROCESS-ABEND-X.
           EXIT.
      /
PIRAEX*------------------------
PIRAEX 9600-OUTPUT-USAU-RECORD.
PIRAEX*------------------------
PIRAEX
PIRAEX     MOVE WGLOB-USER-ID             TO WUSAU-USER-ID.
PIRAEX     MOVE WGLOB-SYSTEM-DATE-INT     TO WUSAU-LOGIN-FAIL-DT.
PIRAEX     MOVE WGLOB-SYSTEM-TIME         TO WS-TIME-N.
PIRAEX     MOVE WS-TIME                   TO WUSAU-LOGIN-FAIL-TIME.
PIRAEX
PIRAEX     PERFORM  USAU-1000-CREATE
PIRAEX         THRU USAU-1000-CREATE-X.
PIRAEX
PIRAEX     MOVE 'XSOM0010'         TO L2490-TXT-SRC-ID.
PIRAEX     MOVE WS-TXT-SRC-REF-ID  TO L2490-TXT-SRC-REF-ID.
PIRAEX
PIRAEX     PERFORM  2490-1000-RETRIEVE-TEXT
PIRAEX         THRU 2490-1000-RETRIEVE-TEXT-X.
PIRAEX
PIRAEX     MOVE L2490-TXT-STR-TXT  TO RUSAU-LOGIN-FAIL-MSG-TXT.
PIRAEX
PIRAEX     PERFORM  USAU-1000-WRITE
PIRAEX         THRU USAU-1000-WRITE-X.
PIRAEX
PIRAEX 9600-OUTPUT-USAU-RECORD-X.
PIRAEX     EXIT.
PIRAEX/
      ****************************************************************
      * PROCESSING COPYBOOKS                                         *
      ****************************************************************

       COPY XCCP0030.

      ****************************************************************
      *  LINKAGE COPYBOOKS                                           *
      ****************************************************************

       COPY XCCL0012.
NTDEV  COPY XCPL0035.
       COPY XCCL0260.
       COPY XCPL0280.
       COPY XCPL1580.
       COPY XCCL1610.
       COPY XCCL1611.
       COPY XCPL1640.
PF 13  COPY XCPS2490.
PF 13  COPY XCCL2490.
       COPY XCCL8095.

      ****************************************************************
      *  FILE I/O PROCESS MODULES                                    *
      ****************************************************************

       COPY XCPNAPPL.

       COPY XCPNBFCN.
       COPY XCPNBPFL.
       COPY XCPNBPFS.

       COPY XCPNUSCL.
PF 13 *COPY XCPNUSEC.
       COPY XCPNUSES.
SESCAP COPY XCPUUSES.
PIRAEX COPY CCPAUSAU.
PIRAEX COPY CCPCUSAU.
      /
      *****************************************************************
      **                 END OF PROGRAM XSOM0010                     **
      *****************************************************************
