      *************************
       IDENTIFICATION DIVISION.
      *************************

       PROGRAM-ID. XSOM0150.

       COPY XCWWCRHT.

      *****************************************************************
      **  MEMBER :  XSOM0150                                         **
      **  REMARKS:  BROWSE, CREATE, INQUIRE, MAINTAIN, AND DELETE    **
      **            ENTRIES ON APPL TABLE.                           **
      **            DETAILS ARE VALIDATED AGAINST THE COMPANY,       **
      **            CURRENCY, AND COUNTRY TYPE EDIT TABLES.          **
      **  DOMAIN :  SY                                               **
      **  CLASS  :  PD                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
53-062**  30NOV95  VK     ARCHITECTURE CHANGES TO SUPPORT GRAPHICAL  **
53-062**                  USER INTERFACE                             **
53-064**  30NOV95  CG     MOREDATA (GUI)                             **
53-067**  30NOV95  VK     CHANGES TO SUPPORT I/O PROGRAMS            **
54-001**  01SEP96  MTW    MODIFICATIONS FOR MAINTAINABILITY          **
554712**  30SEP97  JEB    THE APPLICATION DESCRIPTION IS NOW ON      **
554712**                  XTAB/APPL.  REMOVE REFERENCES TO APPL DESCR**
554712**                  AND CHANGE DESCRIPTION FIELD TO DISPLAY.   **
557708**  30SEP97  MM     NEW CICS ABEND PROCESSING                  **
008445**  31MAR98  552    GENERATE MIR FROM TECH ARCH DATABASE:      **
008445**                  RENAME TABLE FIELDS THAT ARE ALSO KEYS     **
008453**  31MAR98  552    CHECK CTRY TABLE FOR VALID COUNTRY         **
008455**  31MAR98  552    CHECK CRCY TABLE FOR VALID CURRENCY        **
007766**  30OCT98  56     ARCHITECTURE CHANGES TO SUPPORT PASSING    **
007766**                  PARAMETERS VIA AN ADDRESS                  **
013578**  15DEC99  60     REMOVAL OF 3270 LOGIC, MIR RENAMES         **
015648**  15DEC99  60     HANDLING MIR DELETE CHARACTER              **
014590**  15DEC99  60     ARCHITECTURAL CHANGES                      **
      *****************************************************************


      **********************
       ENVIRONMENT DIVISION.
      **********************

      ***************
       DATA DIVISION.
      ***************

       WORKING-STORAGE SECTION.

53-062 COPY XCWWPGWS REPLACING '$VAR1' BY 'XSOM0150'.

       COPY SQLCA.
007766 COPY XCWLPTR.


014590*COPY XCWL0030.


       01  WS-PGM-WORK-AREA.
           05  WS-SUB                       PIC S9(04) VALUE ZERO COMP.
           05  SUB1                         PIC S9(04) VALUE ZERO COMP.
           05  SUB2                         PIC S9(04) VALUE ZERO COMP.
           05  CTRY-IDX1                    PIC S9(04) VALUE ZERO COMP.
           05  CTRY-IDX2                    PIC S9(04) VALUE ZERO COMP.
           05  CURR-IDX1                    PIC S9(04) VALUE ZERO COMP.
           05  CURR-IDX2                    PIC S9(04) VALUE ZERO COMP.
           05  WS-MAX-BROWSE-LINES          PIC S9(04) VALUE +10  COMP.
           05  WS-MAX-APPL-COMP             PIC S9(04) VALUE +5   COMP.
           05  WS-APPL-COMP-COUNT           PIC S9(04)            COMP.
013578     05  WS-CO-ID                     PIC X(02).
           05  WS-BUS-FCN-ID                PIC X(04).
               88  WS-BUS-FCN-ID-VALID      VALUES ARE '1930' '1931'
                                                       '1932' '1933'
                                                       '1934'.
               88  WS-BUS-FCN-RETRIEVE      VALUE '1930'.
               88  WS-BUS-FCN-CREATE        VALUE '1931'.
               88  WS-BUS-FCN-UPDATE        VALUE '1932'.
               88  WS-BUS-FCN-DELETE        VALUE '1933'.
013578*        88  WS-BUS-FCN-LIST          VALUE '1934'.
           05  WS-DISPLAY-NUM               PIC 9(05).

       COPY XCWEBLCH.

007766*01  WGLOB-GLOBAL-AREA.
007766*COPY XCWWGLOB.

       COPY XCFWAPPL.
       COPY XCFRAPPL.

       COPY XCFWXTAB.
       COPY XCFRXTAB.

008453 COPY XCFWCTRY.
008453 COPY XCFRCTRY.
008453
008455 COPY XCFWCRCY.
008455 COPY XCFRCRCY.

       COPY XCWWWKDT.

      *****************
       LINKAGE SECTION.
      *****************


007766 01 WGLOB-GLOBAL-AREA.
007766 COPY XCWWGLOB.
       COPY XCWM0150.

       PROCEDURE DIVISION USING WGLOB-GLOBAL-AREA
53-062                          MIR-PARM-AREA.

      *--------------
       0000-MAINLINE.
      *--------------

           SET MIR-RETRN-OK                   TO  TRUE.

015648     INSPECT MIR-PARM-AREA REPLACING ALL '*' BY ' '.

557708     PERFORM  ABND-1000-HANDLE-ABEND
557708         THRU ABND-1000-HANDLE-ABEND-X.

           PERFORM  INIT-1000-INITIALIZE
               THRU INIT-1000-INITIALIZE-X.

           PERFORM  2000-PROCESS-REQUEST
               THRU 2000-PROCESS-REQUEST-X.

           PERFORM  EXIT-1000-FINALIZE
               THRU EXIT-1000-FINALIZE-X.


           GOBACK.

       0000-MAINLINE-X.
           EXIT.

      *--------------------------
       2000-PROCESS-REQUEST.
      *--------------------------

           PERFORM  9300-SETUP-MSIN-REFERENCE
              THRU  9300-SETUP-MSIN-REFERENCE-X.

           MOVE MIR-BUS-FCN-ID        TO WS-BUS-FCN-ID.

      *
      *    PROCESS SCREEN FUNCTIONS
      *

54-001     EVALUATE TRUE

54-001         WHEN WS-BUS-FCN-RETRIEVE
                    PERFORM  2100-PROCESS-RETRIEVE
                        THRU 2100-PROCESS-RETRIEVE-X

54-001         WHEN WS-BUS-FCN-CREATE
                    PERFORM  2200-PROCESS-CREATE
                        THRU 2200-PROCESS-CREATE-X

54-001         WHEN WS-BUS-FCN-UPDATE
                    PERFORM  2300-PROCESS-UPDATE
                        THRU 2300-PROCESS-UPDATE-X

54-001         WHEN WS-BUS-FCN-DELETE
                    PERFORM  2400-PROCESS-DELETE
                        THRU 2400-PROCESS-DELETE-X

013578*        WHEN WS-BUS-FCN-LIST
013578*             PERFORM  2500-PROCESS-LIST
013578*                 THRU 2500-PROCESS-LIST-X

               WHEN OTHER
      *MSG: INVALID BUSINESS FUNCTION @1 FOR PROGRAM @2
                    MOVE 'XS00000237' TO  WGLOB-MSG-REF-INFO
                    MOVE MIR-BUS-FCN-ID
                                      TO WGLOB-MSG-PARM (1)
                    MOVE 'XSOM0150'   TO WGLOB-MSG-PARM (2)
                    PERFORM  0260-1000-GENERATE-MESSAGE
                        THRU 0260-1000-GENERATE-MESSAGE-X
                    SET MIR-RETRN-INVALD-RQST TO TRUE

54-001     END-EVALUATE.

       2000-PROCESS-REQUEST-X.
           EXIT.

      *---------------------
       2100-PROCESS-RETRIEVE.
      *---------------------

013578*    MOVE MIR-APPL-ID           TO WAPPL-APPL-ID.
013578     MOVE WGLOB-COMPANY-CODE    TO WS-CO-ID.
013578     MOVE MIR-CO-ID             TO WGLOB-COMPANY-CODE.
           MOVE MIR-CO-ID             TO WAPPL-CO-ID.
           PERFORM  APPL-1000-READ
               THRU APPL-1000-READ-X.
013578     MOVE WS-CO-ID              TO WGLOB-COMPANY-CODE.

           IF WAPPL-IO-OK
               PERFORM  9200-MOVE-RECORD-TO-SCREEN
                   THRU 9200-MOVE-RECORD-TO-SCREEN-X
           ELSE
               PERFORM  9100-BLANK-DATA-FIELDS
                  THRU  9100-BLANK-DATA-FIELDS-X
               MOVE WAPPL-KEY         TO WGLOB-MSG-PARM (1)
               MOVE 'XS00000001'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               SET MIR-RETRN-RQST-FAILED         TO  TRUE
54-001     END-IF.

       2100-PROCESS-RETRIEVE-X.
           EXIT.

      *--------------------
       2200-PROCESS-CREATE.
      *--------------------

013578*    MOVE MIR-APPL-ID           TO WAPPL-APPL-ID.
013578     MOVE WGLOB-COMPANY-CODE    TO WS-CO-ID.
013578     MOVE MIR-CO-ID             TO WGLOB-COMPANY-CODE.
           MOVE MIR-CO-ID             TO WAPPL-CO-ID.
           PERFORM  APPL-1000-READ
               THRU APPL-1000-READ-X.
013578     MOVE WS-CO-ID              TO WGLOB-COMPANY-CODE.

           IF WAPPL-IO-OK
               PERFORM  9200-MOVE-RECORD-TO-SCREEN
                   THRU 9200-MOVE-RECORD-TO-SCREEN-X
               MOVE WAPPL-KEY         TO WGLOB-MSG-PARM (1)
               MOVE 'XS00000003'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               SET MIR-RETRN-RQST-FAILED           TO  TRUE
               GO TO 2200-PROCESS-CREATE-X
54-001     END-IF.

           PERFORM  2210-CREATE-EDITS
               THRU 2210-CREATE-EDITS-X.

           IF WGLOB-MSG-ERROR-SW > ZERO
               SET MIR-RETRN-RQST-FAILED          TO  TRUE
               GO TO 2200-PROCESS-CREATE-X
54-001     END-IF.

013578*    MOVE MIR-APPL-ID           TO WAPPL-APPL-ID.
013578     MOVE WGLOB-COMPANY-CODE    TO WS-CO-ID.
013578     MOVE MIR-CO-ID             TO WGLOB-COMPANY-CODE.
           MOVE MIR-CO-ID             TO WAPPL-CO-ID.
           PERFORM  APPL-1000-CREATE
               THRU APPL-1000-CREATE-X.
           PERFORM  APPL-1000-WRITE
               THRU APPL-1000-WRITE-X.
           PERFORM  9200-MOVE-RECORD-TO-SCREEN
               THRU 9200-MOVE-RECORD-TO-SCREEN-X.
013578     MOVE WS-CO-ID              TO WGLOB-COMPANY-CODE.

       2200-PROCESS-CREATE-X.
           EXIT.

      *------------------
       2210-CREATE-EDITS.
      *------------------

013578*    IF MIR-APPL-ID = SPACE
013578*        MOVE 'XS01500001'      TO WGLOB-MSG-REF-INFO
013578*        PERFORM  0260-1000-GENERATE-MESSAGE
013578*            THRU 0260-1000-GENERATE-MESSAGE-X
013578*    END-IF.

           MOVE MIR-CO-ID             TO WXTAB-ETBL-VALU-ID.
           PERFORM  COMP-1000-EDIT-COMPANY
               THRU COMP-1000-EDIT-COMPANY-X.

           IF NOT WXTAB-IO-OK
               MOVE 'XS01500002'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.

013578*    IF WGLOB-MSG-ERROR-SW > ZERO
013578*        GO TO 2210-CREATE-EDITS-X
013578*    END-IF.
013578*
013578*    MOVE LOW-VALUES            TO WAPPL-KEY.
013578*    MOVE HIGH-VALUES           TO WAPPL-ENDBR-KEY.
013578*    PERFORM  APPL-1000-BROWSE
013578*        THRU APPL-1000-BROWSE-X.
013578*
013578*    IF WAPPL-IO-EOF
013578*        GO TO 2210-CREATE-EDITS-X
013578*    END-IF.
013578*
013578*    PERFORM  APPL-2000-READ-NEXT
013578*        THRU APPL-2000-READ-NEXT-X.
013578*    MOVE ZERO                  TO WS-APPL-COMP-COUNT.
013578*
013578*    PERFORM  2212-COUNT-APPL-COMP
013578*        THRU 2212-COUNT-APPL-COMP-X
013578*        UNTIL WAPPL-IO-EOF
013578*        OR    WS-APPL-COMP-COUNT = WS-MAX-APPL-COMP.
013578*
013578*
013578*    PERFORM  APPL-3000-END-BROWSE
013578*        THRU APPL-3000-END-BROWSE-X.
013578*
013578*    IF WS-APPL-COMP-COUNT = WS-MAX-APPL-COMP
013578*        MOVE 'XS01500010'      TO WGLOB-MSG-REF-INFO
013578*        PERFORM  0260-1000-GENERATE-MESSAGE
013578*            THRU 0260-1000-GENERATE-MESSAGE-X
013578*    END-IF.

       2210-CREATE-EDITS-X.
           EXIT.

013578*---------------------
013578*2212-COUNT-APPL-COMP.
013578*---------------------
013578*
013578*    IF RAPPL-CO-ID = MIR-CO-ID
013578*        ADD +1             TO WS-APPL-COMP-COUNT
013578*    END-IF.
013578*
013578*    PERFORM  APPL-2000-READ-NEXT
013578*        THRU APPL-2000-READ-NEXT-X.
013578*
013578*2212-COUNT-APPL-COMP-X.
013578*    EXIT.

      *--------------------
       2300-PROCESS-UPDATE.
      *--------------------

013578*    MOVE MIR-APPL-ID           TO WAPPL-APPL-ID.
013578     MOVE WGLOB-COMPANY-CODE    TO WS-CO-ID.
013578     MOVE MIR-CO-ID             TO WGLOB-COMPANY-CODE.
           MOVE MIR-CO-ID             TO WAPPL-CO-ID.
           PERFORM  APPL-1000-READ-FOR-UPDATE
               THRU APPL-1000-READ-FOR-UPDATE-X.
013578     MOVE WS-CO-ID              TO WGLOB-COMPANY-CODE.

           IF WAPPL-IO-NOT-FOUND
               PERFORM  9100-BLANK-DATA-FIELDS
                   THRU 9100-BLANK-DATA-FIELDS-X
               MOVE WAPPL-KEY         TO WGLOB-MSG-PARM (1)
               MOVE 'XS00000006'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               SET MIR-RETRN-RQST-FAILED TO TRUE
               GO TO 2300-PROCESS-UPDATE-X
54-001     END-IF.

           PERFORM  2330-UPDATE-EDITS
               THRU 2330-UPDATE-EDITS-X.

013578     MOVE WGLOB-COMPANY-CODE    TO WS-CO-ID.
013578     MOVE MIR-CO-ID             TO WGLOB-COMPANY-CODE.
           PERFORM  APPL-2000-REWRITE
               THRU APPL-2000-REWRITE-X.
013578     MOVE WS-CO-ID              TO WGLOB-COMPANY-CODE.

           IF WGLOB-MSG-ERROR-SW > ZERO
               MOVE 'XS00000008'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               SET MIR-RETRN-EDIT-ERROR      TO  TRUE
           ELSE
               MOVE 'XS00000007'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               PERFORM  9200-MOVE-RECORD-TO-SCREEN
                   THRU 9200-MOVE-RECORD-TO-SCREEN-X
54-001     END-IF.

       2300-PROCESS-UPDATE-X.
           EXIT.

      *-----------------
       2330-UPDATE-EDITS.
      *-----------------

           MOVE ZERO                  TO WGLOB-MSG-ERROR-SW.

           IF MIR-APPL-EDIT-LANG-CD NOT = SPACE
               PERFORM  2335-EDIT-ELANG
                   THRU 2335-EDIT-ELANG-X
           ELSE
               MOVE RAPPL-APPL-EDIT-LANG-CD
                                      TO MIR-APPL-EDIT-LANG-CD
54-001     END-IF.

013578*    IF MIR-APPL-EXIT-PGM-ID NOT = SPACE
013578*        PERFORM  2340-EDIT-EXIT-PGM
013578*            THRU 2340-EDIT-EXIT-PGM-X
013578*    ELSE
013578*        MOVE RAPPL-APPL-EXIT-PGM-ID
013578*                               TO MIR-APPL-EXIT-PGM-ID
013578*    END-IF.

554712*    IF MIR-DV-APPL-ID-TXT > SPACES
554712*        IF MIR-DV-APPL-ID-TXT = EBLCH-BLANK-FIELD-CHAR
554712*            MOVE SPACES              TO RAPPL-APPL-DESC-TXT
554712*            MOVE SPACES              TO MIR-DV-APPL-ID-TXT
554712*        ELSE
554712*            MOVE MIR-DV-APPL-ID-TXT        TO RAPPL-APPL-DESC-TXT
554712*        END-IF
554712*    ELSE
554712*        MOVE RAPPL-APPL-DESC-TXT     TO MIR-DV-APPL-ID-TXT
554712*    END-IF.

           PERFORM  2345-EDIT-CTRY-AND-CURR
               THRU 2345-EDIT-CTRY-AND-CURR-X
               VARYING SUB1 FROM 1 BY 1
               UNTIL   SUB1 > +5.

           PERFORM  2355-CHK-DUPLICATE-CTRY-CURR
               THRU 2355-CHK-DUPLICATE-CTRY-CURR-X
               VARYING CTRY-IDX1 FROM 1 BY 1
               UNTIL   CTRY-IDX1 > +5.

           IF WGLOB-MSG-ERROR-SW = ZERO
               MOVE ZERO              TO CTRY-IDX2
               PERFORM  2390-PACK-CTRY-AND-CURR
                   THRU 2390-PACK-CTRY-AND-CURR-X
                   VARYING CTRY-IDX1 FROM 1 BY 1
                   UNTIL   CTRY-IDX1 > +5

54-001     END-IF.

           MOVE LOW-VALUES            TO MIR-APPL-ASCL-REL-CTR.

       2330-UPDATE-EDITS-X.
           EXIT.

      *----------------
       2335-EDIT-ELANG.
      *----------------

           IF MIR-APPL-EDIT-LANG-CD = EBLCH-BLANK-FIELD-CHAR
               MOVE SPACES            TO MIR-APPL-EDIT-LANG-CD
54-001     END-IF.

           MOVE MIR-APPL-EDIT-LANG-CD
                                      TO WXTAB-ETBL-VALU-ID.
           MOVE 'ELANG'               TO WXTAB-ETBL-TYP-ID.
           MOVE WGLOB-EDIT-LANG       TO WXTAB-ETBL-LANG-CD.
           PERFORM  XTAB-1000-READ
               THRU XTAB-1000-READ-X.

           IF WXTAB-IO-OK
               MOVE MIR-APPL-EDIT-LANG-CD
                                      TO RAPPL-APPL-EDIT-LANG-CD
           ELSE
               MOVE 'XS01500003'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.

       2335-EDIT-ELANG-X.
           EXIT.

013578*-------------------
013578*2340-EDIT-EXIT-PGM.
013578*-------------------
013578*
013578*    IF MIR-APPL-EXIT-PGM-ID = EBLCH-BLANK-FIELD-CHAR
013578*        MOVE SPACES            TO MIR-APPL-EXIT-PGM-ID
013578*    END-IF.
013578*
013578*    MOVE MIR-APPL-EXIT-PGM-ID
013578*                               TO WXTAB-ETBL-VALU-ID.
013578*    MOVE 'PGMID'               TO WXTAB-ETBL-TYP-ID.
013578*    MOVE WGLOB-EDIT-LANG       TO WXTAB-ETBL-LANG-CD.
013578*    PERFORM  XTAB-1000-READ
013578*        THRU XTAB-1000-READ-X.
013578*
013578*    IF WXTAB-IO-OK
013578*        MOVE MIR-APPL-EXIT-PGM-ID
013578*                               TO RAPPL-APPL-EXIT-PGM-ID
013578*    ELSE
013578*        MOVE 'XS01500004'      TO WGLOB-MSG-REF-INFO
013578*        PERFORM  0260-1000-GENERATE-MESSAGE
013578*            THRU 0260-1000-GENERATE-MESSAGE-X
013578*    END-IF.
013578*
013578*2340-EDIT-EXIT-PGM-X.
013578*    EXIT.

      *------------------------
       2345-EDIT-CTRY-AND-CURR.
      *------------------------

013578*    IF MIR-APPL-CTRY-5-CD-T (SUB1) = SPACE
013578*        IF  MIR-APPL-CRCY-5-5-CD-T (SUB1 1) = SPACE
013578*        AND MIR-APPL-CRCY-5-5-CD-T (SUB1 2) = SPACE
013578*        AND MIR-APPL-CRCY-5-5-CD-T (SUB1 3) = SPACE
013578*        AND MIR-APPL-CRCY-5-5-CD-T (SUB1 4) = SPACE
013578*        AND MIR-APPL-CRCY-5-5-CD-T (SUB1 5) = SPACE
013578     IF MIR-APPL-CTRY-1-CD-T (SUB1) = SPACE
013578         IF  MIR-APPL-CRCY-1-1-CD-T (SUB1) = SPACE
013578         AND MIR-APPL-CRCY-2-1-CD-T (SUB1) = SPACE
013578         AND MIR-APPL-CRCY-3-1-CD-T (SUB1) = SPACE
013578         AND MIR-APPL-CRCY-4-1-CD-T (SUB1) = SPACE
013578         AND MIR-APPL-CRCY-5-1-CD-T (SUB1) = SPACE
                   GO TO 2345-EDIT-CTRY-AND-CURR-X
               ELSE
                   MOVE 'XS01500007'  TO WGLOB-MSG-REF-INFO
                   PERFORM  0260-1000-GENERATE-MESSAGE
                       THRU 0260-1000-GENERATE-MESSAGE-X
                   GO TO 2345-EDIT-CTRY-AND-CURR-X
54-001         END-IF
54-001     END-IF.

008453*    MOVE MIR-APPL-CTRY-5-CD-T (SUB1)     TO WXTAB-ETBL-VALU-ID.
008453*    PERFORM  CNTY-1000-EDIT-COUNTRY
008453*        THRU CNTY-1000-EDIT-COUNTRY-X.
008453*
008453*    IF WXTAB-IO-OK

008453     MOVE MIR-CO-ID             TO WCTRY-CO-ID.
013578*    MOVE MIR-APPL-CTRY-5-CD-T (SUB1)
013578     MOVE MIR-APPL-CTRY-1-CD-T (SUB1)
                                      TO WCTRY-CTRY-CD.
008453     PERFORM  CTRY-1000-READ
008453         THRU CTRY-1000-READ-X.
008453
008453     IF WCTRY-IO-OK
54-001         CONTINUE
           ELSE
               MOVE 'XS01500005'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.

           PERFORM  2350-EDIT-CURR
               THRU 2350-EDIT-CURR-X
               VARYING SUB2 FROM 1 BY 1
               UNTIL   SUB2 > 5.

       2345-EDIT-CTRY-AND-CURR-X.
           EXIT.

      *---------------
       2350-EDIT-CURR.
      *---------------

013578*    IF MIR-APPL-CRCY-5-5-CD-T (SUB1 SUB2) = SPACE
013578*        GO TO 2350-EDIT-CURR-X
013578*    END-IF.
013578*
013578*    MOVE MIR-APPL-CRCY-5-5-CD-T (SUB1 SUB2)
013578*                            TO WXTAB-ETBL-VALU-ID.
013578*    PERFORM  CURR-1000-EDIT-CURRENCY
013578*        THRU CURR-1000-EDIT-CURRENCY-X.
013578*
013578*    IF WXTAB-IO-OK

008455     MOVE MIR-CO-ID             TO WCRCY-CO-ID.
013578*    MOVE MIR-APPL-CRCY-5-5-CD-T (SUB1 SUB2)
013578*                               TO WCRCY-CRCY-CD.
013578*    PERFORM  CRCY-1000-READ
013578*        THRU CRCY-1000-READ-X.
013578*
013578*    IF WCRCY-IO-OK
013578*        CONTINUE
013578*    ELSE
013578*        MOVE 'XS01500006'      TO WGLOB-MSG-REF-INFO
013578*        PERFORM  0260-1000-GENERATE-MESSAGE
013578*            THRU 0260-1000-GENERATE-MESSAGE-X
013578*    END-IF.
013578
013578     IF MIR-APPL-CRCY-1-1-CD-T (SUB1) = SPACE
013578         CONTINUE
013578     ELSE
013578         MOVE MIR-APPL-CRCY-1-1-CD-T (SUB1) TO WCRCY-CRCY-CD
013578         PERFORM  2351-CHK-CURRENCY
013578             THRU 2351-CHK-CURRENCY-X
013578     END-IF.
013578
013578     IF MIR-APPL-CRCY-2-1-CD-T (SUB1) = SPACE
013578         CONTINUE
013578     ELSE
013578         MOVE MIR-APPL-CRCY-2-1-CD-T (SUB1) TO WCRCY-CRCY-CD
013578         PERFORM  2351-CHK-CURRENCY
013578             THRU 2351-CHK-CURRENCY-X
013578     END-IF.
013578
013578     IF MIR-APPL-CRCY-3-1-CD-T (SUB1) = SPACE
013578         CONTINUE
013578     ELSE
013578         MOVE MIR-APPL-CRCY-3-1-CD-T (SUB1) TO WCRCY-CRCY-CD
013578         PERFORM  2351-CHK-CURRENCY
013578             THRU 2351-CHK-CURRENCY-X
013578     END-IF.
013578
013578     IF MIR-APPL-CRCY-4-1-CD-T (SUB1) = SPACE
013578         CONTINUE
013578     ELSE
013578         MOVE MIR-APPL-CRCY-4-1-CD-T (SUB1) TO WCRCY-CRCY-CD
013578         PERFORM  2351-CHK-CURRENCY
013578             THRU 2351-CHK-CURRENCY-X
013578     END-IF.
013578
013578     IF MIR-APPL-CRCY-5-1-CD-T (SUB1) = SPACE
013578         CONTINUE
013578     ELSE
013578         MOVE MIR-APPL-CRCY-5-1-CD-T (SUB1) TO WCRCY-CRCY-CD
013578         PERFORM  2351-CHK-CURRENCY
013578             THRU 2351-CHK-CURRENCY-X
013578     END-IF.

       2350-EDIT-CURR-X.
           EXIT.

      *-----------------------------
       2351-CHK-CURRENCY.
      *-----------------------------

008455     PERFORM  CRCY-1000-READ
008455         THRU CRCY-1000-READ-X.
008455
008455     IF WCRCY-IO-OK
54-001         CONTINUE
           ELSE
               MOVE 'XS01500006'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.


       2351-CHK-CURRENCY-X.
           EXIT.

      *-----------------------------
       2355-CHK-DUPLICATE-CTRY-CURR.
      *-----------------------------

013578*    IF MIR-APPL-CTRY-5-CD-T (CTRY-IDX1) = SPACES
013578     IF MIR-APPL-CTRY-1-CD-T (CTRY-IDX1) = SPACES
               GO TO 2355-CHK-DUPLICATE-CTRY-CURR-X
54-001     END-IF.

54-001     COMPUTE CTRY-IDX2 = CTRY-IDX1 + 1.

           IF CTRY-IDX2 > 5
54-001         CONTINUE
           ELSE
               PERFORM  2360-CHK-DUP-CTRY
                   THRU 2360-CHK-DUP-CTRY-X
                   VARYING CTRY-IDX2 FROM CTRY-IDX2 BY 1
                   UNTIL CTRY-IDX2 > 5

54-001     END-IF.

           PERFORM  2365-CHK-DUP-CURR-LIST
               THRU 2365-CHK-DUP-CURR-LIST-X
               VARYING CURR-IDX1 FROM 1 BY 1
               UNTIL CURR-IDX1 > 5.

       2355-CHK-DUPLICATE-CTRY-CURR-X.
           EXIT.

      *------------------
       2360-CHK-DUP-CTRY.
      *------------------

013578*    IF MIR-APPL-CTRY-5-CD-T (CTRY-IDX1)
013578*     = MIR-APPL-CTRY-5-CD-T (CTRY-IDX2)
013578     IF MIR-APPL-CTRY-1-CD-T (CTRY-IDX1)
013578      = MIR-APPL-CTRY-1-CD-T (CTRY-IDX2)
               MOVE 'XS01500008'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
54-001     END-IF.

       2360-CHK-DUP-CTRY-X.
           EXIT.

      *-----------------------
       2365-CHK-DUP-CURR-LIST.
      *-----------------------

013578*    IF MIR-APPL-CRCY-5-5-CD-T (CTRY-IDX1, CURR-IDX1) = SPACES
013578*        GO TO 2365-CHK-DUP-CURR-LIST-X
013578*    END-IF.
013578*
013578*    COMPUTE CURR-IDX2 = CURR-IDX1 + 1.
013578*
013578*    IF CURR-IDX2 > 5
013578*        GO TO 2365-CHK-DUP-CURR-LIST-X
013578*    ELSE
013578*        PERFORM  2370-CHK-DUP-CURR
013578*            THRU 2370-CHK-DUP-CURR-X
013578*            VARYING CURR-IDX2 FROM CURR-IDX2 BY 1
013578*             UNTIL CURR-IDX2 > 5
013578*    END-IF.
013578
013578     IF MIR-APPL-CRCY-1-1-CD-T (CTRY-IDX1) = SPACES
013578         CONTINUE
013578     ELSE
013578         COMPUTE CURR-IDX2 = CURR-IDX1 + 1
013578         IF CURR-IDX2 > 5
013578             CONTINUE
013578         ELSE
013578             PERFORM  2371-CHK-DUP-CURR
013578                 THRU 2371-CHK-DUP-CURR-X
013578         END-IF
013578     END-IF.
013578
013578     IF MIR-APPL-CRCY-2-1-CD-T (CTRY-IDX1) = SPACES
013578         CONTINUE
013578     ELSE
013578         COMPUTE CURR-IDX2 = CURR-IDX1 + 1
013578         IF CURR-IDX2 > 5
013578             CONTINUE
013578         ELSE
013578             PERFORM  2372-CHK-DUP-CURR
013578                 THRU 2372-CHK-DUP-CURR-X
013578         END-IF
013578     END-IF.
013578
013578     IF MIR-APPL-CRCY-3-1-CD-T (CTRY-IDX1) = SPACES
013578         CONTINUE
013578     ELSE
013578         COMPUTE CURR-IDX2 = CURR-IDX1 + 1
013578         IF CURR-IDX2 > 5
013578             CONTINUE
013578         ELSE
013578             PERFORM  2373-CHK-DUP-CURR
013578                 THRU 2373-CHK-DUP-CURR-X
013578         END-IF
013578     END-IF.
013578
013578     IF MIR-APPL-CRCY-4-1-CD-T (CTRY-IDX1) = SPACES
013578         CONTINUE
013578     ELSE
013578         COMPUTE CURR-IDX2 = CURR-IDX1 + 1
013578         IF CURR-IDX2 > 5
013578             CONTINUE
013578         ELSE
013578             PERFORM  2374-CHK-DUP-CURR
013578                 THRU 2374-CHK-DUP-CURR-X
013578         END-IF
013578     END-IF.

       2365-CHK-DUP-CURR-LIST-X.
           EXIT.

013578*------------------
013578*2370-CHK-DUP-CURR.
013578*------------------
013578*
013578*    IF MIR-APPL-CRCY-5-5-CD-T (CTRY-IDX1, CURR-IDX1) =
013578*       MIR-APPL-CRCY-5-5-CD-T (CTRY-IDX1, CURR-IDX2)
013578*        MOVE 'XS01500009'      TO WGLOB-MSG-REF-INFO
013578*        PERFORM  0260-1000-GENERATE-MESSAGE
013578*            THRU 0260-1000-GENERATE-MESSAGE-X
013578*    END-IF.
013578*
013578*2370-CHK-DUP-CURR-X.
013578*    EXIT.

013578*------------------
013578 2371-CHK-DUP-CURR.
013578*------------------
013578
013578     IF MIR-APPL-CRCY-1-1-CD-T (CTRY-IDX1) =
013578        MIR-APPL-CRCY-2-1-CD-T (CTRY-IDX1)
013578     OR MIR-APPL-CRCY-1-1-CD-T (CTRY-IDX1) =
013578        MIR-APPL-CRCY-3-1-CD-T (CTRY-IDX1)
013578     OR MIR-APPL-CRCY-1-1-CD-T (CTRY-IDX1) =
013578        MIR-APPL-CRCY-4-1-CD-T (CTRY-IDX1)
013578     OR MIR-APPL-CRCY-1-1-CD-T (CTRY-IDX1) =
013578        MIR-APPL-CRCY-5-1-CD-T (CTRY-IDX1)
013578         MOVE 'XS01500009'      TO WGLOB-MSG-REF-INFO
013578         PERFORM  0260-1000-GENERATE-MESSAGE
013578             THRU 0260-1000-GENERATE-MESSAGE-X
013578     END-IF.
013578
013578 2371-CHK-DUP-CURR-X.
013578     EXIT.

013578*------------------
013578 2372-CHK-DUP-CURR.
013578*------------------
013578
013578     IF MIR-APPL-CRCY-2-1-CD-T (CTRY-IDX1) =
013578        MIR-APPL-CRCY-3-1-CD-T (CTRY-IDX1)
013578     OR MIR-APPL-CRCY-2-1-CD-T (CTRY-IDX1) =
013578        MIR-APPL-CRCY-4-1-CD-T (CTRY-IDX1)
013578     OR MIR-APPL-CRCY-2-1-CD-T (CTRY-IDX1) =
013578        MIR-APPL-CRCY-5-1-CD-T (CTRY-IDX1)
013578         MOVE 'XS01500009'      TO WGLOB-MSG-REF-INFO
013578         PERFORM  0260-1000-GENERATE-MESSAGE
013578             THRU 0260-1000-GENERATE-MESSAGE-X
013578     END-IF.
013578
013578 2372-CHK-DUP-CURR-X.
013578     EXIT.

013578*------------------
013578 2373-CHK-DUP-CURR.
013578*------------------
013578
013578     IF MIR-APPL-CRCY-3-1-CD-T (CTRY-IDX1) =
013578        MIR-APPL-CRCY-4-1-CD-T (CTRY-IDX1)
013578     OR MIR-APPL-CRCY-3-1-CD-T (CTRY-IDX1) =
013578        MIR-APPL-CRCY-5-1-CD-T (CTRY-IDX1)
013578         MOVE 'XS01500009'      TO WGLOB-MSG-REF-INFO
013578         PERFORM  0260-1000-GENERATE-MESSAGE
013578             THRU 0260-1000-GENERATE-MESSAGE-X
013578     END-IF.
013578
013578 2373-CHK-DUP-CURR-X.
013578     EXIT.

013578*------------------
013578 2374-CHK-DUP-CURR.
013578*------------------
013578
013578     IF MIR-APPL-CRCY-4-1-CD-T (CTRY-IDX1) =
013578        MIR-APPL-CRCY-5-1-CD-T (CTRY-IDX1)
013578         MOVE 'XS01500009'      TO WGLOB-MSG-REF-INFO
013578         PERFORM  0260-1000-GENERATE-MESSAGE
013578             THRU 0260-1000-GENERATE-MESSAGE-X
013578     END-IF.
013578
013578 2374-CHK-DUP-CURR-X.
013578     EXIT.


      *------------------------
       2390-PACK-CTRY-AND-CURR.
      *------------------------

           MOVE SPACE          TO RAPPL-APPL-CTRY-TBL-INFO (CTRY-IDX1).

013578*    IF MIR-APPL-CTRY-5-CD-T (CTRY-IDX1) NOT = SPACES
013578*        ADD  1                      TO CTRY-IDX2
013578*        MOVE MIR-APPL-CTRY-5-CD-T (CTRY-IDX1)
013578     IF MIR-APPL-CTRY-1-CD-T (CTRY-IDX1) NOT = SPACES
013578         ADD  1                      TO CTRY-IDX2
013578         MOVE MIR-APPL-CTRY-1-CD-T (CTRY-IDX1)
                                      TO
                     RAPPL-APPL-CTRY-CD (CTRY-IDX2)
54-001     END-IF.

           MOVE ZERO                  TO CURR-IDX2.
           PERFORM  2395-MOVE-CURR
013578         THRU 2395-MOVE-CURR-X.
013578*        THRU 2395-MOVE-CURR-X
013578*        VARYING CURR-IDX1 FROM 1 BY 1
013578*        UNTIL   CURR-IDX1 > +5.

       2390-PACK-CTRY-AND-CURR-X.
           EXIT.

      *---------------
       2395-MOVE-CURR.
      *---------------

013578*    IF MIR-APPL-CRCY-5-5-CD-T (CTRY-IDX1, CURR-IDX1)
013578*      NOT = SPACE
013578*        ADD  1                                 TO CURR-IDX2
013578*        MOVE MIR-APPL-CRCY-5-5-CD-T (CTRY-IDX1, CURR-IDX1)
013578*                               TO
013578*             RAPPL-APPL-CRCY-CD     (CTRY-IDX2, CURR-IDX2)
013578*    END-IF.
013578
013578     IF MIR-APPL-CRCY-1-1-CD-T (CTRY-IDX1)
013578       NOT = SPACE
013578         ADD  1                 TO CURR-IDX2
013578         MOVE MIR-APPL-CRCY-1-1-CD-T (CTRY-IDX1)
013578                                TO
013578              RAPPL-APPL-CRCY-CD     (CTRY-IDX2, CURR-IDX2)
013578     END-IF.
013578
013578
013578     IF MIR-APPL-CRCY-2-1-CD-T (CTRY-IDX1)
013578       NOT = SPACE
013578         ADD  1                 TO CURR-IDX2
013578         MOVE MIR-APPL-CRCY-2-1-CD-T (CTRY-IDX1)
013578                                TO
013578              RAPPL-APPL-CRCY-CD     (CTRY-IDX2, CURR-IDX2)
013578     END-IF.
013578
013578
013578     IF MIR-APPL-CRCY-3-1-CD-T (CTRY-IDX1)
013578       NOT = SPACE
013578         ADD  1                 TO CURR-IDX2
013578         MOVE MIR-APPL-CRCY-3-1-CD-T (CTRY-IDX1)
013578                                TO
013578              RAPPL-APPL-CRCY-CD     (CTRY-IDX2, CURR-IDX2)
013578     END-IF.
013578
013578
013578     IF MIR-APPL-CRCY-4-1-CD-T (CTRY-IDX1)
013578       NOT = SPACE
013578         ADD  1                 TO CURR-IDX2
013578         MOVE MIR-APPL-CRCY-4-1-CD-T (CTRY-IDX1)
013578                                TO
013578              RAPPL-APPL-CRCY-CD     (CTRY-IDX2, CURR-IDX2)
013578     END-IF.
013578
013578
013578     IF MIR-APPL-CRCY-5-1-CD-T (CTRY-IDX1)
013578       NOT = SPACE
013578         ADD  1                 TO CURR-IDX2
013578         MOVE MIR-APPL-CRCY-5-1-CD-T (CTRY-IDX1)
013578                                TO
013578              RAPPL-APPL-CRCY-CD     (CTRY-IDX2, CURR-IDX2)
013578     END-IF.
013578

       2395-MOVE-CURR-X.
           EXIT.

      *--------------------
       2400-PROCESS-DELETE.
      *--------------------

013578*    MOVE MIR-APPL-ID           TO WAPPL-APPL-ID.
013578     MOVE WGLOB-COMPANY-CODE    TO WS-CO-ID.
013578     MOVE MIR-CO-ID             TO WGLOB-COMPANY-CODE.
           MOVE MIR-CO-ID             TO WAPPL-CO-ID.
           PERFORM  APPL-1000-READ-FOR-UPDATE
               THRU APPL-1000-READ-FOR-UPDATE-X.
013578     MOVE WS-CO-ID              TO WGLOB-COMPANY-CODE.

           IF WAPPL-IO-OK
               CONTINUE
           ELSE
               MOVE WAPPL-KEY         TO WGLOB-MSG-PARM (1)
               MOVE 'XS00000010'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               SET MIR-RETRN-RQST-FAILED TO TRUE
               GO TO 2400-PROCESS-DELETE-X
54-001     END-IF.

           IF RAPPL-APPL-ASCL-REL-CTR  > ZERO
               PERFORM  APPL-3000-UNLOCK
                   THRU APPL-3000-UNLOCK-X
               PERFORM  9200-MOVE-RECORD-TO-SCREEN
                   THRU 9200-MOVE-RECORD-TO-SCREEN-X
               SET MIR-RETRN-RQST-FAILED TO TRUE
               MOVE 'XS01500011'      TO WGLOB-MSG-REF-INFO
               PERFORM  0260-1000-GENERATE-MESSAGE
                   THRU 0260-1000-GENERATE-MESSAGE-X
               GO TO 2400-PROCESS-DELETE-X
54-001     END-IF.

           PERFORM  APPL-1000-DELETE
               THRU APPL-1000-DELETE-X.
           MOVE 'XS00000011'          TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-1000-GENERATE-MESSAGE
               THRU 0260-1000-GENERATE-MESSAGE-X.

           PERFORM  9100-BLANK-DATA-FIELDS
               THRU 9100-BLANK-DATA-FIELDS-X.

       2400-PROCESS-DELETE-X.
           EXIT.

013578*--------------------
013578*2500-PROCESS-LIST.
013578*--------------------
013578*
013578*    MOVE SPACES                    TO MIR-APPL-ID-G.
013578*    MOVE SPACES                    TO MIR-CO-ID-G.
013578*    MOVE SPACES                TO MIR-APPL-ID-G.
013578*    MOVE SPACES                TO MIR-CO-ID-G.
013578*    MOVE SPACES                TO MIR-APPL-CTRY-10-CD-G.
013578*    MOVE SPACES                TO MIR-APPL-CRCY-10-5-CD-G.
013578*
013578*    MOVE LOW-VALUES            TO WAPPL-KEY.
013578*    MOVE HIGH-VALUES           TO WAPPL-ENDBR-KEY.
013578*    MOVE MIR-APPL-ID           TO WAPPL-APPL-ID.
013578*    MOVE MIR-CO-ID             TO WAPPL-CO-ID.
013578*
013578*    PERFORM  APPL-1000-BROWSE
013578*        THRU APPL-1000-BROWSE-X.
013578*
013578*    IF WAPPL-IO-EOF
013578*        MOVE 'XS00000034'      TO WGLOB-MSG-REF-INFO
013578*        PERFORM  0260-1000-GENERATE-MESSAGE
013578*            THRU 0260-1000-GENERATE-MESSAGE-X
013578*        GO TO 2500-PROCESS-LIST-X
013578*    END-IF.
013578*
013578*    PERFORM  APPL-2000-READ-NEXT
013578*        THRU APPL-2000-READ-NEXT-X.
013578*
013578*    IF WAPPL-IO-EOF
013578*        MOVE 'XS00000025'      TO WGLOB-MSG-REF-INFO
013578*        PERFORM  0260-1000-GENERATE-MESSAGE
013578*            THRU 0260-1000-GENERATE-MESSAGE-X
013578*        GO TO 2500-PROCESS-LIST-X
013578*    END-IF.
013578*
013578*    MOVE +1                    TO WS-SUB.
013578*    PERFORM  2510-PROCESS-LIST-READ
013578*        THRU 2510-PROCESS-LIST-READ-X
013578*        UNTIL WS-SUB > WS-MAX-BROWSE-LINES
013578*        OR    WAPPL-IO-EOF.
013578*
013578*    IF WAPPL-IO-EOF
013578*        MOVE 'XS00000025'      TO WGLOB-MSG-REF-INFO
013578*        PERFORM  0260-1000-GENERATE-MESSAGE
013578*            THRU 0260-1000-GENERATE-MESSAGE-X
013578*    ELSE
013578*        SET WGLOB-MORE-DATA-EXISTS TO TRUE
013578*        MOVE 'XS00000014'      TO WGLOB-MSG-REF-INFO
013578*        PERFORM  0260-1000-GENERATE-MESSAGE
013578*            THRU 0260-1000-GENERATE-MESSAGE-X
013578*    END-IF.
013578*
013578*    PERFORM  APPL-3000-END-BROWSE
013578*        THRU APPL-3000-END-BROWSE-X.
013578*
013578*2500-PROCESS-LIST-X.
013578*    EXIT.
013578*
013578*-------------------------
013578*2510-PROCESS-LIST-READ.
013578*-------------------------
013578*
013578*    PERFORM  2520-DISPLAY-LINE
013578*        THRU 2520-DISPLAY-LINE-X
013578*        VARYING SUB1 FROM +1 BY +1
013578*        UNTIL   SUB1 > +5
013578*        OR      WS-SUB > WS-MAX-BROWSE-LINES.
013578*
013578*    IF WS-SUB > WS-MAX-BROWSE-LINES
013578*        MOVE MIR-APPL-ID-T (WS-MAX-BROWSE-LINES) TO MIR-APPL-ID
013578*        MOVE MIR-CO-ID-T (WS-MAX-BROWSE-LINES) TO MIR-CO-ID
013578*        MOVE MIR-APPL-ID-T (WS-MAX-BROWSE-LINES)
013578*                               TO MIR-APPL-ID
013578*        MOVE MIR-CO-ID-T (WS-MAX-BROWSE-LINES)
013578*                               TO MIR-CO-ID
013578*    ELSE
013578*        PERFORM  APPL-2000-READ-NEXT
013578*            THRU APPL-2000-READ-NEXT-X
013578*    END-IF.
013578*
013578*2510-PROCESS-LIST-READ-X.
013578*    EXIT.
013578*
013578*------------------
013578*2520-DISPLAY-LINE.
013578*------------------
013578*
013578*    IF RAPPL-APPL-CTRY-CD (SUB1) > SPACE
013578*    OR SUB1 = +1
013578*        MOVE RAPPL-APPL-ID     TO MIR-APPL-ID-T  (WS-SUB)
013578*        MOVE RAPPL-CO-ID       TO MIR-CO-ID-T    (WS-SUB)
013578*        MOVE RAPPL-APPL-ID     TO MIR-APPL-ID-T  (WS-SUB)
013578*        MOVE RAPPL-CO-ID       TO MIR-CO-ID-T    (WS-SUB)
013578*        MOVE RAPPL-APPL-CTRY-CD (SUB1)
013578*                            TO MIR-APPL-CTRY-10-CD-T (WS-SUB)
013578*        MOVE RAPPL-APPL-CRCY-CD  (SUB1 1)
013578*                         TO MIR-APPL-CRCY-10-5-CD-T (WS-SUB 1)
013578*        MOVE RAPPL-APPL-CRCY-CD  (SUB1 2)
013578*                         TO MIR-APPL-CRCY-10-5-CD-T (WS-SUB 2)
013578*        MOVE RAPPL-APPL-CRCY-CD  (SUB1 3)
013578*                         TO MIR-APPL-CRCY-10-5-CD-T (WS-SUB 3)
013578*        MOVE RAPPL-APPL-CRCY-CD  (SUB1 4)
013578*                         TO MIR-APPL-CRCY-10-5-CD-T (WS-SUB 4)
013578*        MOVE RAPPL-APPL-CRCY-CD  (SUB1 5)
013578*                         TO MIR-APPL-CRCY-10-5-CD-T (WS-SUB 5)
013578*        ADD +1                               TO WS-SUB
013578*    END-IF.
013578*
013578*2520-DISPLAY-LINE-X.
013578*    EXIT.

      *-----------------------
       9100-BLANK-DATA-FIELDS.
      *-----------------------

013578*    MOVE SPACE                 TO MIR-APPL-EXIT-PGM-ID.
013578*    MOVE SPACE                 TO MIR-DV-APPL-ID-TXT.
013578*    MOVE SPACE                 TO MIR-ETBL-DESC-TXT.
013578*    MOVE SPACE                 TO MIR-APPL-CTRY-5-CD-G.
013578*    MOVE SPACE                 TO MIR-APPL-CRCY-5-5-CD-G.
           MOVE SPACE                 TO MIR-APPL-EDIT-LANG-CD.
013578     MOVE SPACE                 TO MIR-APPL-CTRY-1-CD-G.
013578     MOVE SPACE                 TO MIR-APPL-CRCY-1-1-CD-G.
013578     MOVE SPACE                 TO MIR-APPL-CRCY-2-1-CD-G.
013578     MOVE SPACE                 TO MIR-APPL-CRCY-3-1-CD-G.
013578     MOVE SPACE                 TO MIR-APPL-CRCY-4-1-CD-G.
013578     MOVE SPACE                 TO MIR-APPL-CRCY-5-1-CD-G.
54-001     MOVE WS-BUS-FCN-ID         TO MIR-BUS-FCN-ID.

       9100-BLANK-DATA-FIELDS-X.
           EXIT.

      *---------------------------
       9200-MOVE-RECORD-TO-SCREEN.
      *---------------------------

013578*    MOVE RAPPL-APPL-ID         TO MIR-APPL-ID.
           MOVE RAPPL-CO-ID           TO MIR-CO-ID.
           MOVE RAPPL-APPL-EDIT-LANG-CD
                                      TO MIR-APPL-EDIT-LANG-CD.
013578*    MOVE RAPPL-APPL-EXIT-PGM-ID   TO MIR-APPL-EXIT-PGM-ID.

554712*    MOVE RAPPL-APPL-DESC-TXT      TO MIR-DV-APPL-ID-TXT.
013578*    MOVE RAPPL-APPL-ID         TO WXTAB-ETBL-VALU-ID.
554712     PERFORM  APPL-2000-DESC
554712         THRU APPL-2000-DESC-X.
013578*    IF  WXTAB-IO-OK
013578*        MOVE RXTAB-ETBL-DESC-TXT
013578*                               TO MIR-ETBL-DESC-TXT
013578*                               TO MIR-DV-APPL-ID-TXT
013578*    ELSE
013578*        MOVE SPACES            TO MIR-ETBL-DESC-TXT
013578*        MOVE SPACES            TO MIR-DV-APPL-ID-TXT
013578*    END-IF.

           PERFORM  9220-MOVE-CTRY-AND-CURR
               THRU 9220-MOVE-CTRY-AND-CURR-X
               VARYING SUB1 FROM 1 BY 1
               UNTIL   SUB1 > 5.

           MOVE RAPPL-APPL-ASCL-REL-CTR
                                      TO WS-DISPLAY-NUM.
           MOVE WS-DISPLAY-NUM        TO MIR-APPL-ASCL-REL-CTR.

       9200-MOVE-RECORD-TO-SCREEN-X.
           EXIT.

      *------------------------
       9220-MOVE-CTRY-AND-CURR.
      *------------------------

           MOVE RAPPL-APPL-CTRY-CD (SUB1)
013578                              TO MIR-APPL-CTRY-1-CD-T (SUB1).
013578*                             TO MIR-APPL-CTRY-5-CD-T (SUB1).
           PERFORM  9222-MOVE-CURR
013578         THRU 9222-MOVE-CURR-X.
013578*        THRU 9222-MOVE-CURR-X
013578*        VARYING SUB2 FROM 1 BY 1
013578*        UNTIL   SUB2 > 5.

       9220-MOVE-CTRY-AND-CURR-X.
           EXIT.

      *---------------
       9222-MOVE-CURR.
      *---------------

013578*    MOVE RAPPL-APPL-CRCY-CD     (SUB1 SUB2)
013578*                               TO
013578*         MIR-APPL-CRCY-5-5-CD-T (SUB1 SUB2).

013578     MOVE RAPPL-APPL-CRCY-CD   (SUB1 1)
013578                                TO
013578          MIR-APPL-CRCY-1-1-CD-T   (SUB1).
013578     MOVE RAPPL-APPL-CRCY-CD   (SUB1 2)
013578                                TO
013578          MIR-APPL-CRCY-2-1-CD-T   (SUB1).
013578     MOVE RAPPL-APPL-CRCY-CD   (SUB1 3)
013578                                TO
013578          MIR-APPL-CRCY-3-1-CD-T   (SUB1).
013578     MOVE RAPPL-APPL-CRCY-CD   (SUB1 4)
013578                                TO
013578          MIR-APPL-CRCY-4-1-CD-T   (SUB1).
013578     MOVE RAPPL-APPL-CRCY-CD   (SUB1 5)
013578                                TO
013578          MIR-APPL-CRCY-5-1-CD-T   (SUB1).


       9222-MOVE-CURR-X.
           EXIT.

      *--------------------------
       9300-SETUP-MSIN-REFERENCE.
      *--------------------------

           MOVE SPACES                TO WGLOB-MSIN-REFERENCE.
           MOVE WGLOB-COMPANY-CODE    TO WGLOB-REF-COMPANY-CODE.

       9300-SETUP-MSIN-REFERENCE-X.
           EXIT.

       COPY XCPPINIT.

       COPY XCPPEXIT.

554712 COPY XCPEAPPL.

       COPY XCPECOMP.

008453*COPY XCPECNTY.
008453 COPY XCPNCTRY.

008455*COPY XCPECURR.
008455 COPY XCPNCRCY.

       COPY XCCL0260.

013578*COPY XCPPMEXT.

557708*COPY XCCPHNDL.
557708 COPY XCCPABND.
       COPY XCCP0030.
      *****************************************************************
      *  FILE I/O PROCESS MODULES
      *****************************************************************
013578*COPY XCPBAPPL.

       COPY XCPNAPPL.

       COPY XCPUAPPL.

       COPY XCPAAPPL.

       COPY XCPCAPPL.

       COPY XCPXAPPL.

       COPY XCPNXTAB.

      *****************************************************************
      **                 END OF PROGRAM XSOM0150                     **
      *****************************************************************
