      *************************
       IDENTIFICATION DIVISION.
      *************************
 
       PROGRAM-ID.  XSRU0315.
       COPY XCWWCRHT.
      *****************************************************************
      **  MEMBER :  XSRU0315                                         **
      *****************************************************************
      **  REMARKS:  USER EXIT PROGRAM - RETRIEVE PROGRAM ID FROM     **
      **            UXIT TABLE.                                      **
      **                                                             **
      **            THIS MODULE IS A STANDARD USER EXIT PROGRAM TO   **
      **            RETRIEVE INFORMATION FROM UXIT TABLE             **
      **                                                             **
      **  DOMAIN :  SY                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
011025**  30OCT98  56     NEW FOR RELEASE 5.6 - USER EXIT            **
014590**  15DEC99  60     ARCHITECTURAL CHANGES                      **
      *****************************************************************
 
      **********************
       ENVIRONMENT DIVISION.
      **********************
 
      ***************
       DATA DIVISION.
      ***************
 
       WORKING-STORAGE SECTION.
 
       COPY XCWWPGWS REPLACING '$VAR1' BY 'XSRU0315'.
 
       COPY SQLCA.
      /
014590*COPY XCWL0030.
      /
      ****************************************************************
      *  COMMON COPYBOOKS                                            *
      ****************************************************************
      *
       COPY XCWWWKDT.
      /
      ****************************************************************
      *  I/O COPYBOOKS                                               *
      ****************************************************************
      *
       COPY XCFRUXIT.
       COPY XCFWUXIT.
      /
      ****************************************************************
      *  CALLED MODULE PARAMETER INFORMATION                         *
      ****************************************************************
      *
      *
       COPY XCWLDTLK.
      /
      *****************
       LINKAGE SECTION.
      *****************
 
       01  WGLOB-GLOBAL-AREA.
       COPY XCWWGLOB.
       COPY XCWL0315.
       COPY CCWLPGA.
      /
      *******************
       PROCEDURE DIVISION USING WGLOB-GLOBAL-AREA
                                L0315-PARM-INFO
                                LPGA-PARM-INFO.
      *******************
 
      *--------------
       0000-MAINLINE.
      *--------------
 
           PERFORM  0315-0000-MAINLINE
               THRU 0315-0000-MAINLINE-X.
 
       0000-MAINLINE-X.
           GOBACK.
      /
      ****************************************************************
      *  PROCESSING COPYBOOKS                                        *
      ****************************************************************
      *
       COPY XCPP0315.
      /
      ****************************************************************
      *  LINKAGE COPYBOOKS                                           *
      ****************************************************************
      *
       COPY XCPL0260.
      /
      ****************************************************************
      *  I/O COPYBOOKS                                               *
      ****************************************************************
      *
       COPY XCPNUXIT.
      /
      ****************************************************************
      * ERROR HANDLING ROUTINES                                      *
      ****************************************************************
 
       COPY XCPL0030.
 
      *****************************************************************
      **                 END OF PROGRAM XSRU0315                     **
      *****************************************************************
