      *************************
       IDENTIFICATION DIVISION.
      *************************

       PROGRAM-ID. ZSBM9390.

       COPY XCWWCRHT.

      *****************************************************************
      **  MEMBER :  ZSBM9390                                         **
      **  REMARKS:  INGENIUM AGENT UPDATE PROGRAM                    **
      **  THIS PROGRAM IS DESIGNED TO MERGE MTD COMMISSION FILE AND  **
      **  NB MTD COMMISSION FILE.                                    **
      **  COMMISSION INTERFACE FILE - MCOM IS CREATED.               **
      **  A CONTROL REPORT WILL ALSO BE GENERATED.                   **
      **  THIS IS A NEW ONE SHOT PROGRAM - CLONED FROM CSBM9390      **
      **                                                             **
      **  DOMAIN : AG                                                **
      **  CLASS  : PD                                                **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
01CP05** 01AUG01    JG    MCL MONTHLY COMMISSION                     **
B00468** 01AUG01   VAN    MCL NUMERIC FORMAT INTERFACE FIELDS        **
B00549** 01AUG01   KRW    DON'T WRITE A COMMISSION RECORD IF ANY OF  **
B00549**                  BRANCH, AGENT OR POLICY ID'S ARE NOT NUMERIC*
B00596** 01AUG01   KRW    NO COMMISSION RECORD IF SALES OFFICE ID    **
B00596**                  NOT NUMERIC                                **
B00659** 01AUG01   VAN    SPLIT ASSET BASE INFO INTO : TP88 & NB88   **
B10203** 01AUG01   SRO    USE DOUBLE-BYTES SPACES IN KANJI NAME      **
02CP01** 14JUN02   EKM    RENEWAL COMMISSION PROCESSING              **
B00873** 27JUN02   EKM    FIXES TO RENEWAL COMMISSION PROCESSING     **
1CCP01** 12SEP02   JEB    CONVERSION COMMISSION PROCESSING           **
B01150** 24SEP02   JEB    CHANGES REQUESTED FOR SPECIFIC FIELDS      **
B01174** 07OCT02   AT     IF ANY COMMISSION AMOUNT IN A SET          **
B01174**                  (POLICY / AGENT / DATE) IS NEGATIVE THEN   **
B01174**                  IF AN ASSET BASED CONVERSION RECORD IS     **
B01174**                  CREATED FOR THE SET THEN ITS SIGN MUST BE  **
B01174**                  NEGATIVE                                   **
B01184** 08OCT02   AT     CREATE A PRE-CONVERSION FOR EVERY ASSET    **
B01184**                  TYPE INPUT RECORD                          **
B01184** 25OCT02   AT     WHEN CREATING MUTLIPLE PRE-CONVERSION      **
B01184**                  IN RESPONSE TO MULTIPLE ASSET TYPE INPUT   **
B01184**                  RECORDS THE ORIGINAL TRANSACTION ID MUST   **
B01184**                  BE RETAINED                                **
B01174** 31OCT02   AT     THE SIGN OF THE PRE-CONVERSION RECORD      **
B01174**                  MUST BE SAME AS THAT OF THE ORIGINAL TXN   **
B01174**                  SO ADD THE SIGN TO THE TRANSACTION ID      **
B01174**                  SAVING LOGIC ADDED AS PART OF B01184       **
B01174** 05NOV02   AT     PREVIOUS FIX REGRESSED: WHEN THE POST-CNV  **
B01174**                  COMMISSION AMOUNT IS ZERO THEN IT          **
B01174**                  REPRESENTS THE UNDONE EVENT AND IN THAT    **
B01174**                  CASE THE SIGN ON THE PRE-CONVERSION REC    **
B01174**                  MUST BE '1' FOR NEGATIVE                   **
B10819** 11NOV02   AT     IN 3200-, WHEN COMPARING ISSUE EFF. DATES, **
B10819**                  DO NOT BOTHER COMPARING WHEN THE WAT88     **
B10819**                  RECORD IS FOR COVERAGE NUMBER 1            **
B10819** 18NOV02   AT     USE NEW POLICY ISSUE EFFECTIVE DATE ON     **
B10819**                  WAT88 TO CHECK FOR COVERAGES ADDED         **
B10819**                  POST-CONVERSION                            **
B10819** 20NOV02   AT     ADD LOGIC TO ELIMINATE THE NEED FOR        **
B10819**                  CONVERSION OF WAT88 RECORDS CREATED BEFORE **
B10819**                  THE POLICY ISSUE EFFECTIVE DATE WAS ADDED  **
B01174** 25NOV02   AT     ADD PROCESS DATE TO SET OF SAVE ASSET DATA **
B10794** 26NOV02   AT     ADD TRANSACTION ID TO CONTROL KEY TO       **
B10794**                  POPULATION OF SIGN INDICATOR ON B TYPE     **
B10794**                  PRE-CONVERSION RECORDS                     **
B794B ** 26NOV02   AT     FINE TUNE PRE-CONVERSION SIGN INDICATOR    **
B794B **                  LOGIC SUCH THAT IF A BLOCK OF INPUT RECORDS**
B794B **                  (POLICY / AGENT / TRANS DATE / TRANS ID)   **
B794B **                  HAS MULTIPLE ASSET TYPE ('A') TYPE RECORDS **
B794B **                  EACH CORRESPONDING PRE-CONVERSION ('B')    **
B794B **                  TYPE RECORD IS SIGNED CORRECTLY.           **
B794B **                  THIS IS IN RESPONSE                        **
B794B **                  TO THE POSSIBILITY THAT UNDO/REDO MAY BE   **
B794B **                  DONE IN BATCH AND MULTIPLE RECORDS WITH    **
B794B **                  DIFFERENT SIGNS MAY EXIST FOR THE SAME     **
B794B **                  TRANSACTION ID                             **
B794C ** 27NOV02   AT     ADD PROCESS DATE TO PRE-CONVERSION BLOCK   **
B794D ** 28NOV02   AT     ADD COMMISSION TYPE CODE (A,C,S,P) TO      **
B794D **                  TO CONTROL BREAK CHECKING AND CREATE THE   **
B794D **                  'B' TYPE RECORD WHEN WE GET A NEW 'A' TYPE,**
B794D **                  REMOVE TABLE OF SAVED ASSET RECORDS        **
PR006T** 26JUN03   AT     POPULATE NEW FIELDS ON MCOM                **
MM0185** 26JUN03   AT     FIX PRODUCTION BUG THAT CAUSED INVALID     **
MM0185**                  DATA TO APPEAR IN THE INSURED NAME FIELDS  **
MM0185**                  ON THE COMMISSION EXTRACT                  **
MM0198**  26JUN03  AT     IF WE HAVE A CONNECTED COVERAGE THEN CALL  **
MM0198**                  9396 TO GET RENEWAL DATA                   **
MM0201**  26JUN03  AT     IF CONNECTED REASON IS BLANK THEN FILL WITH**
MM0201**                  ZEROS                                      **
MM0215**  26JUN03  AT     THE TWO NEW FIELDS ARE MISSING FROM THE    **
MM0215**                  'B' TYPE RECORDS, ADD THE 3 BYTES TO THE   **
MM0215**                  WS-SAVE INSTANCE OF THE MCOM RECORD        **
MM198B**  26JUN03  AT     REMOVE EXTRA CALL OF 9396, THE CORE CALL   **
MM198B**                  DONE BY 2330 SHOULD HAVE LOOKED AFTER      **
MM198B**                  THIS REQUIREMENT                           **
MM0394**  26JUN03  AT     NEW BUSINESS EXTRACT - IF THE COVERAGE IS  **
MM0394**                  CONNECTED TO ANOTHER IN A                  **
MM0394**                  'NEW BUSINESS DUE TO RENEWAL' RELATIONSHIP **
MM0394**                  THEN DO NOT CREATE THE 88 EXTRACT          **
MM201B**  26JUN03  AT     CHECK CONNECTED REASON FOR LOW-VALUES      **
P01182**  24NOV03  SW     SET 'RMCOM-COMM-CNVR-P-SIGN-IND' FOR       **
P01182**                  B RECORD BASED ON ITS 'COMM-CNVR-P-AMT'    **
PR006Q**  10DEC03  FB     ADD MY KEMPO                               **
B11202**  10DEC03  BP     FIX MISSING FIELDS ON END OF 'B' TYPE RECS **
P02229**  20OCT04  CY     ADD COMMIT LOGIC TO MAINLINES              **
UCPUPL**  13JUN05  SC     UCP UPLOAD                                 **
P02878**  19MAY05  RZ     ALLOW TP88 (PREMTD) IS EMPTY TO AVOID TO   **
P02878**                  SEND DUPLICATED DATE TP88 (PREMTD)         **
MP0010**  15JUL05  BP     CHANGE RENW-PER CHECK FOR ELAPS TIME VAL   **
MFFCOM**  03OCT05  MC     ADD SA RIDER COMM FIELDS                   **
U50201**  03OCT05  RNL    CNVR-POL-CD FOR SA RIDERS                  **
U50285**  03OCT05  RNL    SA FIELDS FOR PRE-CONVERSION POLICY REC.   **
MP0020**  03AUG06  CTS    EXTRA PREMIUM COMMISSION.                  **
FEID06**  26MAY08  CTS    MODIFICATION DONE FOR ACCRUAL COMMISSION   **
FEID06**                  EXTRACT                                    **
FEID06**                  CHANGES DONE FOR MOVING THE AC88 RECORDS   **
FEID06**                  TO AT88 AND IT IS MOVED TO THE LOCATION    **
FEID06**                  MCOM WHICH IS INPUT FOR THE  EXTRACT       **
FEID06**                  ESH42009.TXT                               **
NWLCOM**  23JUL09  CTS    ADD PREMIUM PAYMENT PERIOD AND INSURED     **
NWLCOM**                  AGE FIELDS                                 **
NWLC88**  27AUG09  CTS    ADD LCD DATE, CWA PROCESS DATE, PREMIUM    **
NWLC88**                  PAID DATE AND CHANNEL TYPE, ME DURATION    **
EN9200**  01APR10  CTS    WORKAROUND TO POPULATE PREMIUM PAYMT FIELDS**
EN9200**                  CLONED FROM PROGRAM CSBM9390               **
MP143C**  15FEB11  CTS    ADD CHANGES FOR AMI                        **
M241A2**  21NOV13  CTS    IDENTIFICATION OF OVERLAP IN AGE OR        **
M241A2**                  DURATION                                   ** 
      *****************************************************************
      /
      **********************
       ENVIRONMENT DIVISION.
      **********************

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

       COPY CCSSPRT1.
      /
      ***************
       DATA DIVISION.
      ***************

       FILE SECTION.

       COPY CCSDPRT1.
       COPY CCSRPRT1.
      /
      *************************
       WORKING-STORAGE SECTION.
      *************************

       COPY XCWWPGWS REPLACING '$VAR1' BY 'ZSBM9390'.

       COPY SQLCA.

       01 WS-MISC-WORK-AREA.
           05  WS-LINE-CNT               PIC S9(04) COMP.
           05  WS-LINE-MAX               PIC S9(04) COMP   VALUE +56.
           05  WS-PIC-COUNTER            PIC Z(06)9.
           05  WS-PIC-DECIMAL            PIC Z(15).ZZ-.
           05  WS-PAGE-NUM               PIC S9(5)  COMP-3 VALUE +0.
B01150     05  WS-NUMERIC-2              PIC 9(02) VALUE 0.
B00468     05  WS-NUMERIC-3              PIC 9(03) VALUE 0.
B00468     05  WS-NUMERIC-6              PIC 9(06) VALUE 0.
B00468     05  WS-NUMERIC-7              PIC 9(07) VALUE 0.
B00549     05  WS-COMM-RECRD-IND         PIC X(01).
B00549         88 WS-COMM-RECRD-WRITTEN            VALUE 'Y'.
B00549         88 WS-COMM-RECRD-NOT-WRITTEN        VALUE 'N'.
B10203     05  WS-DB-SPACE           VALUE X'8140'     PIC X(02).
B10203     05  WS-SB-SPACE-SPACE     VALUE X'2020'     PIC X(02).
MM0185     05  WS-REM                    PIC 9(3)  VALUE ZERO.
MM0185     05  WS-TMP-NUM                PIC 9(3)  VALUE ZERO.
EN9200     05  WS-CVG-PREM-PMT-PERI      PIC 9(02).
EN9200         88  WS-CVG-PREM-PMT-PERI-99 VALUE 99.
EN9200     05  WS-CVG-STBL-3-CD          PIC X(03) 
EN9200                                   VALUE ZEROS.
EN9200     05  WS-CVG-STBL-3-CD-N        REDEFINES
EN9200         WS-CVG-STBL-3-CD          PIC 9(03).
EN9200     05  WS-PLAN-ID                PIC X(06).
EN9200         88  WS-PLAN-01-WL         VALUE 
EN9200                                   '41700' '41701' 
EN9200                                   '41800' '41801'.
MM198B*MM0198     05  WS-CONN-CVG-NUM             PIC 9(2).
MM198B*MM0198     05  WS-CONN-CVG-SUB        PIC S9(4) COMP VALUE ZERO.

B794B *
B794B * SET OF INDICATORS TO SHOW WHETHER OR NOT A BLOCK OF RECORDS
B794B * (POLICY / AGENT / TRANS DATE / TRANS ID) CONTAINED POSITIVE
B794B * AND NEGATIVE RECORDS; USED TO SET THE SIGN INDICATOR
B794B * ON THE PRE-CONVERSION 'B' TYPE RECORD.
B794B *
B794B *    05  WS-PREV-CONV-SIGN-INDS.
B794B *        10  WS-PRE-CONV-POS-IND                 PIC X(01).
B794B *            88 PRE-CONV-POS                     VALUE 'Y'.
B794B *            88 PRE-CONV-NO-POS                  VALUE 'N'.
B794B *        10  WS-PRE-CONV-NEG-IND                 PIC X(01).
B794B *            88 PRE-CONV-NEG                     VALUE 'Y'.
B794B *            88 PRE-CONV-NO-NEG                  VALUE 'N'.
P01182*B794D      05  WS-PRE-CONV-SIGN-IND  VALUE 'U'         PIC X(01).
P01182*B794D          88 PRE-CONV-SIGN-POS                    VALUE 'P'.
P01182*B794D          88 PRE-CONV-SIGN-NEG                    VALUE 'N'.
P01182*B794D          88 PRE-CONV-SIGN-UNK                    VALUE 'U'.

B794D *    05 WS-MAX-ASS-BASE                 PIC 9(3) VALUE 999.
B794D *    05 WS-PRE-CNVR-REC-SUB             PIC 9(3) VALUE 0.
B794D *    05 WS-POS-NEG-CNT                  PIC 9(1) VALUE 0.
B01184*
B01184* THE REQUIREMENTS HAVE CHANGED FROM THE SPEC; ORIGINAL
B01184* THINKING WAS THAT ONE PRE-CONVERSION RECORD WAS REQUIRED
B01184* PER POLICY / AGENT / TRANSACTION DATE COMBINATION.  CURRENT
B01184* THINKING IS THAT A PRE-CONVERSION RECORD IS REQUIRED FOR EVERY
B01184* ASSET TYPE RECORD IN THE INPUT SET.  INITIAL RESPONSE TO THIS
B01184* NEW REQUIREMENT WAS TO WRITE THE IDENTICAL PRE-CONVERSION RECORD
B01184* ONCE FOR EVERY ASSET TYPE INPUT RECORD, HOWEVER, USER REQUIRES
B01184* THE TRANSACTION ID TO MATCH THE ORIGINAL ID ON THE INPUT REC.
B01184* THE 'SAVE TRANS' TABLE DEFINED HERE REPRESENTS A SIMPLE RESPONSE;
B01184* A BETTER RESPONSE MAY BE TO REMOVE THE CONTROL BREAK / DEFERRED
B01184* TIMING CREATION OF THE PRE-CONVERSION RECORD BUT THAT WOULD REQUIRE
B01184* A SIGNIFICANT REWRITE OF THAT SECTION OF THE PROGRAM.
B01184*
B01184 01  WS-SAVE-TRANS-ID-AREA.
B01184     05 WS-SAVE-TRANS-ID    PIC X(4).
P01182*B01174     05 WS-SAVE-SIGN      PIC X(1).
P01182     05 WS-SAVE-MTHV-OPT-CD PIC X(01).
P01182        88  WS-SAVE-MTHV-OPT-REDO           VALUE 'R'.
P01182        88  WS-SAVE-MTHV-OPT-UNDO           VALUE 'U'.
P01182        88  WS-SAVE-MTHV-OPT-UNDO-KEEP      VALUE 'K'.

B794D *    05 WS-SAVE-AMT       PIC 9(13).
B01174     05 WS-SAVE-PRCES-DT    PIC X(10).

1CCP01 01  WS-WORK-AREA.
1CCP01     05  WS-CNVR-CASE-SW             PIC X(01).
1CCP01         88  WS-CNVR-CASE-NO         VALUE 'N'.
1CCP01         88  WS-CNVR-CASE-YES        VALUE 'Y'.
1CCP01     05  WS-ASSET-BASE-REC-SW        PIC X(01).
1CCP01         88  WS-ASSET-BASE-REC-YES   VALUE 'Y'.
1CCP01         88  WS-ASSET-BASE-REC-NO    VALUE 'N'.
B794D *    05  WS-ASS-BASE-CNT             PIC 9(3)    VALUE ZERO.

1CCP01 01  WS-SAVE-AREA.
1CCP01     05  WS-SAVE-POL-ID              PIC X(10).
1CCP01     05  WS-SAVE-AGT-ID              PIC X(06).
1CCP01     05  WS-SAVE-TRANS-DT            PIC X(10).
1CCP01     05  WS-SAVE-TASK-ID             PIC X(4).
B794B      05  WS-SAVE-PRCES-DT-CTL        PIC X(10).
B794D      05  WS-SAVE-COMM-TYP-CD         PIC X(1)  VALUE SPACES.
MM0215*1CCP01     05  WS-SAVE-RMCOM-SEQ-REC-INFO  PIC X(285).
B11202*MM0215     05  WS-SAVE-RMCOM-SEQ-REC-INFO  PIC X(288).
MFFCOM*B11202     05  WS-SAVE-RMCOM-SEQ-REC-INFO  PIC X(291).
NWLCOM*MFFCOM     05  WS-SAVE-RMCOM-SEQ-REC-INFO  PIC X(303).
NWLC88*NWLCOM     05  WS-SAVE-RMCOM-SEQ-REC-INFO  PIC X(339).
MP143C*NWLC88     05  WS-SAVE-RMCOM-SEQ-REC-INFO  PIC X(372).
MP143C     05  WS-SAVE-RMCOM-SEQ-REC-INFO  PIC X(373).

1CCP01     05  WS-SAVE-POL-ID-READ         PIC X(10).


       01  WS-REPORT-TOTALS.
           05  WS-TP88-RECORDS-READ      PIC S9(07) COMP-3 VALUE +0.
           05  WS-NB88-RECORDS-READ      PIC S9(07) COMP-3 VALUE +0.
FEID06     05  WS-AC88-RECORDS-READ      PIC S9(07) COMP-3 VALUE +0.
           05  WS-MCOM-RECORDS-WRITE     PIC S9(07) COMP-3 VALUE +0.
1CCP01     05  WS-MCOM-PRE-CNVR-RECS     PIC S9(07) COMP-3 VALUE +0.

       01  WS-COI.
           05  WS-COI-REC-TP88           PIC S9(7) COMP-3 VALUE +0.
           05  WS-COI-REC-NB88           PIC S9(7) COMP-3 VALUE +0.
FEID06     05  WS-COI-REC-AC88           PIC S9(7) COMP-3 VALUE +0.
           05  WS-COI-CNVR-P-TP88        PIC S9(16)V99 COMP-3 VALUE +0.
           05  WS-COI-CNVR-P-NB88        PIC S9(16)V99 COMP-3 VALUE +0.
FEID06     05  WS-COI-CNVR-P-AC88        PIC S9(16)V99 COMP-3 VALUE +0.

       01  WS-COI-REF.
           05  WS-COIR-REC-TP88          PIC S9(7) COMP-3 VALUE +0.
           05  WS-COIR-REC-NB88          PIC S9(7) COMP-3 VALUE +0.
FEID06     05  WS-COIR-REC-AC88          PIC S9(7) COMP-3 VALUE +0.
           05  WS-COIR-CNVR-P-TP88       PIC S9(16)V99 COMP-3 VALUE +0.
           05  WS-COIR-CNVR-P-NB88       PIC S9(16)V99 COMP-3 VALUE +0.
FEID06     05  WS-COIR-CNVR-P-AC88       PIC S9(16)V99 COMP-3 VALUE +0.

       01  WS-COI-SHRT.
           05  WS-COIS-REC               PIC S9(7) COMP-3 VALUE +0.
           05  WS-COIS-CNVR-P            PIC S9(16)V99 COMP-3 VALUE +0.

       01  WS-ASSET-BASE.
B00659*    05  WS-AB-REC                 PIC S9(7) COMP-3 VALUE +0.
B00659*    05  WS-AB-COMM-AMT            PIC S9(16)V99 COMP-3 VALUE +0.
B00659     05  WS-AB-TP88-REC            PIC S9(7) COMP-3 VALUE +0.
B00659     05  WS-AB-TP88-COMM-AMT       PIC S9(16)V99 COMP-3 VALUE +0.
B00659     05  WS-AB-NB88-REC            PIC S9(7) COMP-3 VALUE +0.
B00659     05  WS-AB-NB88-COMM-AMT       PIC S9(16)V99 COMP-3 VALUE +0.
FEID06     05  WS-AB-AC88-REC            PIC S9(7) COMP-3 VALUE +0.
FEID06     05  WS-AB-AC88-COMM-AMT       PIC S9(16)V99 COMP-3 VALUE +0.

       01  WS-REPORT-DET-LINE            PIC X(80) VALUE  SPACES.

      /
P02229 COPY XCWL0035.

       COPY XCWWWKDT.
1CCP01 COPY CCWLPGA.
       COPY CCWL0950.
1CCP01 COPY CCWL2435.
1CCP01 COPY CCWL9396.
       COPY CCWL0010.
       COPY CCWWCCC.
       COPY CCWWINDX.
M241A2 COPY CCWLSTB3.
      /
       COPY XCWWHDG.
       COPY XCWWTIME.
B10203 COPY XCWL0015.
       COPY XCWL0040.
B00468 COPY XCWL0280.
1CCP01 COPY XCWL0289.
       COPY XCWTFCMD.
       COPY XCWL1640.
MP0010 COPY XCWL1670.
MP0010 COPY XCWL1680.
       COPY XCWLDTLK.
       COPY XCWL2490.
      /
       01  WGLOB-GLOBAL-AREA.
       COPY XCWWGLOB.
      /
1CCP01 COPY CCFRCVG.
1CCP01 COPY CCFWCVG.
1CCP01 COPY CCWWCVGS.
      /
1CCP01 COPY CCFRPOL.
1CCP01 COPY CCFWPOL.
      /
1CCP01 COPY CCFRPOLX.
1CCP01 COPY CCFWPOLX.
      /
EN9200 COPY CCFWPH.
EN9200 COPY CCFRPH.
      / 
       COPY CCSWPRT1.
      /
       COPY XCSWOCF.
       COPY XCSROCF.
       COPY XCSWBCF.
       COPY XCSRBCF.
      /
       COPY CCWWAT88.
      /
       COPY CCSWTP88.
       COPY CCSRTP88.
      /
       COPY CCSWNB88.
       COPY CCSRNB88.
      /
FEID06 COPY XCSWSEQ  REPLACING ==:ID:==  BY AC88
FEID06                         ==':ID:'==  BY =='AC88'==.
FEID06 COPY CCSRAC88.
FEID06/
       COPY CCSWMCOM.
       COPY CCSRMCOM.

      /
      ********************
       PROCEDURE DIVISION.
      ********************

      *--------------
       0000-MAINLINE.
      *--------------

           PERFORM  0100-OPEN-FILES
               THRU 0100-OPEN-FILES-X.

           PERFORM  2000-INITIALIZE
               THRU 2000-INITIALIZE-X.

           PERFORM  3000-UPDATE-TP88
               THRU 3000-UPDATE-TP88-X
               UNTIL WTP88-SEQ-IO-EOF.

           PERFORM  NB88-1000-READ
               THRU NB88-1000-READ-X.

           IF  WNB88-SEQ-IO-OK
               ADD +1               TO WS-NB88-RECORDS-READ
           END-IF.

           PERFORM  4000-UPDATE-NB88
               THRU 4000-UPDATE-NB88-X
               UNTIL WNB88-SEQ-IO-EOF.

FEID06     PERFORM  AC88-1000-READ
FEID06         THRU AC88-1000-READ-X.
FEID06
FEID06     IF  WAC88-SEQ-IO-OK
FEID06         ADD +1                       TO WS-AC88-RECORDS-READ
FEID06     END-IF.
FEID06
FEID06     PERFORM  4100-UPDATE-AC88
FEID06         THRU 4100-UPDATE-AC88-X
FEID06         UNTIL WAC88-SEQ-IO-EOF.
FEID06
1CCP01* WRITE LAST CONVERSION COMPANION RECORD IF REQUIRED
1CCP01     PERFORM  3300-PRCES-MCOM-CNVR-REC
1CCP01         THRU 3300-PRCES-MCOM-CNVR-REC-X.

           PERFORM  9000-PRINT-STATS
               THRU 9000-PRINT-STATS-X.

           PERFORM  9999-CLOSE-FILES
               THRU 9999-CLOSE-FILES-X.

P02229     PERFORM  0035-1000-COMMIT
P02229         THRU 0035-1000-COMMIT-X.

           STOP RUN.

       0000-MAINLINE-X.
           EXIT.
      /

      *----------------
       0100-OPEN-FILES.
      *----------------

           PERFORM  OCF-3000-OPEN-OUTPUT
               THRU OCF-3000-OPEN-OUTPUT-X.

           PERFORM  BCF-1000-OPEN-INPUT
               THRU BCF-1000-OPEN-INPUT-X.

           PERFORM  TP88-1000-OPEN-INPUT
               THRU TP88-1000-OPEN-INPUT-X.

           PERFORM  NB88-1000-OPEN-INPUT
               THRU NB88-1000-OPEN-INPUT-X.

FEID06     PERFORM  AC88-1000-OPEN-INPUT
FEID06         THRU AC88-1000-OPEN-INPUT-X.
FEID06
           PERFORM  MCOM-3000-OPEN-OUTPUT
               THRU MCOM-3000-OPEN-OUTPUT-X.

           PERFORM  PRT1-3000-OPEN-OUTPUT
               THRU PRT1-3000-OPEN-OUTPUT-X.

       0100-OPEN-FILES-X.
           EXIT.
      /

      *----------------
       2000-INITIALIZE.
      *----------------

           MOVE ZERO                    TO WS-LINE-CNT.
           MOVE SPACES                  TO WGLOB-COMPANY-CODE.

           PERFORM  CCC-1000-PRCES-CO-CTL-CARD
               THRU CCC-1000-PRCES-CO-CTL-CARD-X.

           PERFORM  0950-0000-INIT-PARM-INFO
               THRU 0950-0000-INIT-PARM-INFO-X.

           PERFORM  0950-1000-GET-COMPANY-NAME
               THRU 0950-1000-GET-COMPANY-NAME-X.

           MOVE L0950-COMPANY-NAME      TO L0040-COMPANY-NAME.

           PERFORM  2100-INIT-OCF-TITLES
               THRU 2100-INIT-OCF-TITLES-X.

           PERFORM  2300-INIT-9390-TITLES
               THRU 2300-INIT-9390-TITLES-X.

           PERFORM  TP88-1000-READ
               THRU TP88-1000-READ-X.

1CCP01     INITIALIZE WS-SAVE-AREA.
           IF  WTP88-SEQ-IO-OK
               ADD +1             TO WS-TP88-RECORDS-READ
1CCP01         MOVE RTP88-REC-DETAIL           TO WAT88-REC-INFO
1CCP01         MOVE WAT88-POL-ID               TO WS-SAVE-POL-ID
1CCP01         MOVE WAT88-AGT-ID               TO WS-SAVE-AGT-ID
1CCP01         MOVE WAT88-TRANS-DT             TO WS-SAVE-TRANS-DT
B10794         MOVE WAT88-TRNXT-TASK-ID        TO WS-SAVE-TASK-ID
B794B          MOVE WAT88-PRCES-DT             TO WS-SAVE-PRCES-DT-CTL

      *    ALLOW PREMTD EMPTY TO AVOID PREMTD DATA TO BE POPULATED AGAIN.

P02878*    ELSE
P02878* MSG: @1 INVALID READ FOR FILE @2
P02878*        MOVE 'CS93900001'  TO WGLOB-MSG-REF-INFO
P02878*        MOVE WPGWS-CRNT-PGM-ID TO WGLOB-MSG-PARM (1)
P02878*        PERFORM  2490-1000-BUILD-PARM-INFO
P02878*            THRU 2490-1000-BUILD-PARM-INFO-X
P02878*        MOVE 'CSBM9390'              TO L2490-TXT-SRC-ID
P02878*        MOVE WGLOB-USER-LANG         TO L2490-TXT-LANG-CD
P02878*        MOVE '00015'                 TO L2490-TXT-SRC-REF-ID
P02878*        PERFORM  2490-1000-RETRIEVE-TEXT
P02878*            THRU 2490-1000-RETRIEVE-TEXT-X
P02878*        MOVE L2490-TXT-STR-TXT   TO WGLOB-MSG-PARM (2)
P02878*        PERFORM  0260-1000-GENERATE-MESSAGE
P02878*            THRU 0260-1000-GENERATE-MESSAGE-X
P02878*        PERFORM  0030-5000-LOGIC-ERROR
P02878*            THRU 0030-5000-LOGIC-ERROR-X
           END-IF.

1CCP01     SET WS-CNVR-CASE-NO           TO TRUE.
1CCP01     SET WS-ASSET-BASE-REC-NO      TO TRUE.

       2000-INITIALIZE-X.
           EXIT.
      /

      *---------------------
       2100-INIT-OCF-TITLES.
      *---------------------
      *
      * SET UP THE TITLE/HEADING LINES FOR THE OCF REPORT
      *
           MOVE ZERO                    TO L0040-ERROR-CNT.

      *
      * GET THE SYSTEM ID
      *
           MOVE 'CS00000056'            TO WGLOB-MSG-REF-INFO.

           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.

           MOVE WGLOB-MSG-TXT           TO L0040-SYSTEM-ID.

      *
      * GET THE PROGRAM DESCRIPTION
      *
           PERFORM  2490-1000-BUILD-PARM-INFO
               THRU 2490-1000-BUILD-PARM-INFO-X.

           MOVE 'CSBM9390'              TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG         TO L2490-TXT-LANG-CD.
           MOVE '00001'                 TO L2490-TXT-SRC-REF-ID.

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT       TO L0040-PROGRAM-DESC.

      * MSG: RUN MESSAGE
           MOVE 'CS93900002'            TO WGLOB-MSG-REF-INFO.

           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.

           MOVE WGLOB-MSG-TXT           TO L0040-HDG-LINE-3.

           PERFORM  0040-1000-INIT-TITLE
               THRU 0040-1000-INIT-TITLE-X.

       2100-INIT-OCF-TITLES-X.
           EXIT.
      /

      *----------------------
       2300-INIT-9390-TITLES.
      *----------------------

      *
      * SET UP THE TITLE/HEADING LINES FOR THE REPORT
      *
           MOVE SPACES                  TO WHDG-LINE-1.
           MOVE SPACES                  TO WHDG-LINE-2.
           MOVE ZERO                    TO WS-PAGE-NUM.

           MOVE L0040-SYSTEM-ID         TO WHDG-SYSTEM-ID.
           MOVE L0040-COMPANY-NAME      TO WHDG-COMPANY-NAME.
           MOVE L0040-PROGRAM-DESC      TO WHDG-REPORT-TITLE.

           PERFORM  HDG-1000-INIT-CONSTANTS
               THRU HDG-1000-INIT-CONSTANTS-X.

           MOVE WGLOB-MAIN-PGM-ID       TO WHDG-PROGRAM-ID.

           MOVE WGLOB-SYSTEM-DATE-INT   TO L1640-INTERNAL-DATE.

           PERFORM  1640-2000-INTERNAL-TO-EXT
               THRU 1640-2000-INTERNAL-TO-EXT-X.

           MOVE L1640-EXTERNAL-DATE     TO WHDG-DATE.

           MOVE WGLOB-SYSTEM-TIME       TO WTIME-EDIT-TIME.

           PERFORM  TIME-1000-REFORMAT
               THRU TIME-1000-REFORMAT-X.

           MOVE WTIME-DISPLAY-TIME      TO WHDG-TIME.

           PERFORM  8000-PRINT-HEADINGS
               THRU 8000-PRINT-HEADINGS-X.

       2300-INIT-9390-TITLES-X.
           EXIT.
      /

      *-----------------
       3000-UPDATE-TP88.
      *-----------------

B00549*    ADD +1                          TO WS-MCOM-RECORDS-WRITE.
           MOVE RTP88-REC-DETAIL           TO WAT88-REC-INFO.
B00549     SET  WS-COMM-RECRD-NOT-WRITTEN  TO TRUE.

           PERFORM  3100-SET-UP-MCOM-REC
               THRU 3100-SET-UP-MCOM-REC-X.

B00549     IF  WS-COMM-RECRD-WRITTEN
B00549         ADD +1                      TO WS-MCOM-RECORDS-WRITE
               PERFORM  5000-ACCUM-TP88-PRINT
                   THRU 5000-ACCUM-TP88-PRINT-X
B00549     ELSE
B00549         PERFORM  8700-PRINT-WARNING
B00549             THRU 8700-PRINT-WARNING-X
B00549     END-IF.

           PERFORM  TP88-1000-READ
               THRU TP88-1000-READ-X.

           IF  WTP88-SEQ-IO-OK
               ADD +1                      TO WS-TP88-RECORDS-READ
           END-IF.

       3000-UPDATE-TP88-X.
           EXIT.
      /

      *---------------------
       3100-SET-UP-MCOM-REC.
      *---------------------

MM0394*
MM0394* IF WE HAVE REFERRAL COMMISSION FOR
MM0394* A COVERAGE THAT IS CONNECTED TO ANOTHER IN A
MM0394* 'NEW BUSINESS DUE TO RENEWAL' RELATIONSHIP THEN
MM0394* DO NOT CREATE THE 88 EXTRACT
MM0394*
MM0394    IF WAT88-COMM-TYP-COI-REF
MM0394       PERFORM CVGS-1000-LOAD-CVGS-ARRAY
MM0394          THRU CVGS-1000-LOAD-CVGS-ARRAY-X
MM0394          IF WCVGS-CVG-CONN-REASN-RENW (WAT88-CVG-ID)
MM0394             GO TO 3100-SET-UP-MCOM-REC-X
MM0394          END-IF
MM0394     END-IF.

B794D *
B794D * CHECK TO SEE IF WE NEED TO CREATE A PRE-CONVERSION
B794D * TYPE 'B' RECORD
B794D *
1CCP01     PERFORM  3200-CNVR-POL-PRCES
1CCP01         THRU 3200-CNVR-POL-PRCES-X.

           MOVE WAT88-CD                    TO RMCOM-CD.

B00468*    MOVE WAT88-BR-ID                 TO RMCOM-BR-ID.
B00468     MOVE WAT88-BR-ID                 TO L0280-INPUT-DATA.
B00468     SET L0280-SIGN-NOT-PERMITTED     TO TRUE.
B00468     MOVE LENGTH OF RMCOM-BR-ID       TO L0280-LENGTH.
B00468     MOVE 0                           TO L0280-PRECISION.
B00468     MOVE LENGTH OF WAT88-BR-ID       TO L0280-INPUT-SIZE.
B00468     PERFORM  0280-1000-NUMERIC-EDIT
B00468         THRU 0280-1000-NUMERIC-EDIT-X.
B00468     IF  L0280-OK
B00468         MOVE L0280-OUTPUT            TO WS-NUMERIC-3
B00468         MOVE WS-NUMERIC-3            TO RMCOM-BR-ID
B00468     ELSE
B00549*        MOVE ZEROS                   TO RMCOM-BR-ID
B00549         GO TO 3100-SET-UP-MCOM-REC-X
B00468     END-IF.

B00468*    MOVE WAT88-AGT-ID                TO RMCOM-AGT-ID.
B00468     MOVE WAT88-AGT-ID                TO L0280-INPUT-DATA.
B00468     SET L0280-SIGN-NOT-PERMITTED     TO TRUE.
B00468     MOVE LENGTH OF RMCOM-AGT-ID      TO L0280-LENGTH.
B00468     MOVE 0                           TO L0280-PRECISION.
B00468     MOVE LENGTH OF WAT88-AGT-ID      TO L0280-INPUT-SIZE.
B00468     PERFORM  0280-1000-NUMERIC-EDIT
B00468         THRU 0280-1000-NUMERIC-EDIT-X.
B00468     IF  L0280-OK
B00468         MOVE L0280-OUTPUT            TO WS-NUMERIC-6
B00468         MOVE WS-NUMERIC-6            TO RMCOM-AGT-ID
B00468     ELSE
B00549*        MOVE ZEROS                   TO RMCOM-AGT-ID
B00549         GO TO 3100-SET-UP-MCOM-REC-X
B00468     END-IF.
           MOVE WAT88-PRCES-DT              TO RMCOM-PRCES-DT.

B00468*    MOVE WAT88-POL-ID                TO RMCOM-POL-ID.
B00468     MOVE WAT88-POL-ID                TO L0280-INPUT-DATA.
B00468     SET L0280-SIGN-NOT-PERMITTED     TO TRUE.
B00468     MOVE LENGTH OF RMCOM-POL-ID      TO L0280-LENGTH.
B00468     MOVE 0                           TO L0280-PRECISION.
B00468     MOVE LENGTH OF WAT88-POL-ID      TO L0280-INPUT-SIZE.
B00468     PERFORM  0280-1000-NUMERIC-EDIT
B00468         THRU 0280-1000-NUMERIC-EDIT-X.
B00468     IF  L0280-OK
B00468         MOVE L0280-OUTPUT            TO WS-NUMERIC-7
B00468         MOVE WS-NUMERIC-7            TO RMCOM-POL-ID
B00468     ELSE
B00549*        MOVE ZEROS                   TO RMCOM-POL-ID
B00549         GO TO 3100-SET-UP-MCOM-REC-X
B00468     END-IF.

           MOVE WAT88-CVG-ID                TO RMCOM-CVG-ID.
           MOVE WAT88-CRCY-CD               TO RMCOM-CRCY-CD.
B10203
B10203* NEED TO COMPRESS KJ NAME TO BE SURE THERE IS NO SINGLE BYTE CHARACTERS
B10203
B10203* LAST NAME FIRST
B10203
B10203*    MOVE WAT88-INSRD-CLI-SUR-NM      TO RMCOM-INSRD-CLI-SUR-NM.
B10203     MOVE SPACES                      TO L0015-COMP-AREA-IN.
B10203     MOVE ZERO                        TO L0015-IN-SUB1.
B10203     MOVE ZERO                        TO L0015-IN-SUB2.
B10203     MOVE ZERO                        TO L0015-OUT-SUB.
B10203     MOVE SPACES                      TO L0015-COMP-AREA-OUT.
B10203     MOVE WAT88-INSRD-CLI-SUR-NM      TO L0015-COMP-AREA-IN-FIRST.
B10203     PERFORM  0015-1000-COMPRESS-BLANKS
B10203         THRU 0015-1000-COMPRESS-BLANKS-X.

MM0185*
MM0185* IF 0015 RETURNS AN ODD NUMBER OF CHARACTERS
MM0185* REPLACE THE RIGHTMOST CHARACTER WITH A SPACE
MM0185*
MM0185     SUBTRACT 1 FROM L0015-OUT-SUB.
MM0185     DIVIDE L0015-OUT-SUB BY 2 GIVING WS-TMP-NUM
MM0185            REMAINDER WS-REM.
MM0185
MM0185     IF WS-REM NOT = ZERO
MM0185        MOVE SPACE TO L0015-COMP-AREA-OUT (L0015-OUT-SUB : 1)
MM0185     END-IF.

B10203     INSPECT L0015-COMP-AREA-OUT  REPLACING ALL WS-SB-SPACE-SPACE
B10203                                             BY WS-DB-SPACE.
B10203     MOVE L0015-COMP-AREA-OUT         TO RMCOM-INSRD-CLI-SUR-NM.
B10203
B10203* FIRST NAME SECOND
B10203
B10203*    MOVE WAT88-INSRD-CLI-FRST-NM     TO RMCOM-INSRD-CLI-FRST-NM.
B10203     MOVE SPACES                      TO L0015-COMP-AREA-IN.
B10203     MOVE ZERO                        TO L0015-IN-SUB1.
B10203     MOVE ZERO                        TO L0015-IN-SUB2.
B10203     MOVE ZERO                        TO L0015-OUT-SUB.
B10203     MOVE SPACES                      TO L0015-COMP-AREA-OUT.
B10203     MOVE WAT88-INSRD-CLI-FRST-NM     TO L0015-COMP-AREA-IN-FIRST.
B10203     PERFORM  0015-1000-COMPRESS-BLANKS
B10203         THRU 0015-1000-COMPRESS-BLANKS-X.

MM0185*
MM0185* IF 0015 RETURNS AN ODD NUMBER OF CHARACTERS
MM0185* REPLACE THE RIGHTMOST CHARACTER WITH A SPACE
MM0185*
MM0185     SUBTRACT 1 FROM L0015-OUT-SUB.
MM0185     DIVIDE L0015-OUT-SUB BY 2 GIVING WS-TMP-NUM
MM0185            REMAINDER WS-REM.
MM0185
MM0185     IF WS-REM NOT = ZERO
MM0185        MOVE SPACE TO L0015-COMP-AREA-OUT (L0015-OUT-SUB : 1)
MM0185     END-IF.

B10203     INSPECT L0015-COMP-AREA-OUT  REPLACING ALL WS-SB-SPACE-SPACE
B10203                                             BY WS-DB-SPACE.
B10203     MOVE L0015-COMP-AREA-OUT         TO RMCOM-INSRD-CLI-FRST-NM.

B00468*    MOVE WAT88-SUB-AGNT-ID           TO RMCOM-SUB-AGNT-ID.
B00468     MOVE WAT88-SUB-AGNT-ID           TO L0280-INPUT-DATA.
B00468     SET L0280-SIGN-NOT-PERMITTED     TO TRUE.
B00468     MOVE LENGTH OF RMCOM-SUB-AGNT-ID TO L0280-LENGTH.
B00468     MOVE 0                           TO L0280-PRECISION.
B00468     MOVE LENGTH OF WAT88-SUB-AGNT-ID TO L0280-INPUT-SIZE.
B00468     PERFORM  0280-1000-NUMERIC-EDIT
B00468         THRU 0280-1000-NUMERIC-EDIT-X.
B00468     IF  L0280-OK
B00468         MOVE L0280-OUTPUT            TO WS-NUMERIC-6
B00468         MOVE WS-NUMERIC-6            TO RMCOM-SUB-AGNT-ID
B00468     ELSE
B00468         MOVE ZEROS                   TO RMCOM-SUB-AGNT-ID
B00468     END-IF.

           MOVE WAT88-AMT                   TO RMCOM-AMT.
           MOVE WAT88-SHR-PCT               TO RMCOM-SHR-PCT.

           COMPUTE RMCOM-RT = WAT88-RT * 100000.

B00468*    MOVE WAT88-SO-ID                 TO RMCOM-SO-ID.
B00468     MOVE WAT88-SO-ID                 TO L0280-INPUT-DATA.
B00468     SET L0280-SIGN-NOT-PERMITTED     TO TRUE.
B00468     MOVE LENGTH OF RMCOM-SO-ID       TO L0280-LENGTH.
B00468     MOVE 0                           TO L0280-PRECISION.
B00468     MOVE LENGTH OF WAT88-SO-ID       TO L0280-INPUT-SIZE.
B00468     PERFORM  0280-1000-NUMERIC-EDIT
B00468         THRU 0280-1000-NUMERIC-EDIT-X.
B00468     IF  L0280-OK
B00468         MOVE L0280-OUTPUT            TO WS-NUMERIC-3
B00468         MOVE WS-NUMERIC-3            TO RMCOM-SO-ID
B00468     ELSE
B00596*        MOVE ZEROS                   TO RMCOM-SO-ID
B00596         GO TO 3100-SET-UP-MCOM-REC-X
B00468     END-IF.


           MOVE WAT88-CVG-AGT-TYP-CD        TO RMCOM-CVG-AGT-TYP-CD.
           MOVE WAT88-COMM-TYP-CD           TO RMCOM-COMM-TYP-CD.

B00468*    MOVE WAT88-LRG-PROD-CD           TO RMCOM-LRG-PROD-CD.
B00468     MOVE WAT88-LRG-PROD-CD           TO L0280-INPUT-DATA.
B00468     SET L0280-SIGN-NOT-PERMITTED     TO TRUE.
B00468     MOVE LENGTH OF RMCOM-LRG-PROD-CD TO L0280-LENGTH.
B00468     MOVE 0                           TO L0280-PRECISION.
B00468     MOVE LENGTH OF WAT88-LRG-PROD-CD TO L0280-INPUT-SIZE.
B00468     PERFORM  0280-1000-NUMERIC-EDIT
B00468         THRU 0280-1000-NUMERIC-EDIT-X.
B00468     IF  L0280-OK
B00468         MOVE L0280-OUTPUT            TO WS-NUMERIC-3
B00468         MOVE WS-NUMERIC-3            TO RMCOM-LRG-PROD-CD
B00468     ELSE
B00468         MOVE ZEROS                   TO RMCOM-LRG-PROD-CD
B00468     END-IF.

B00468*    MOVE WAT88-SM-PROD-CD            TO RMCOM-SM-PROD-CD.
B00468     MOVE WAT88-SM-PROD-CD            TO L0280-INPUT-DATA.
B00468     SET L0280-SIGN-NOT-PERMITTED     TO TRUE.
B00468     MOVE LENGTH OF RMCOM-SM-PROD-CD  TO L0280-LENGTH.
B00468     MOVE 0                           TO L0280-PRECISION.
B00468     MOVE LENGTH OF WAT88-SM-PROD-CD  TO L0280-INPUT-SIZE.
B00468     PERFORM  0280-1000-NUMERIC-EDIT
B00468         THRU 0280-1000-NUMERIC-EDIT-X.
B00468     IF  L0280-OK
B00468         MOVE L0280-OUTPUT            TO WS-NUMERIC-3
B00468         MOVE WS-NUMERIC-3            TO RMCOM-SM-PROD-CD
B00468     ELSE
B00468         MOVE ZEROS                   TO RMCOM-SM-PROD-CD
B00468     END-IF.


           MOVE WAT88-TRANS-DT              TO RMCOM-TRANS-DT.
           MOVE WAT88-APP-RECV-DT           TO RMCOM-APP-RECV-DT.
           MOVE WAT88-CVG-ISS-DT            TO RMCOM-CVG-ISS-DT.
           MOVE WAT88-INSRD-CLI-NM-KA       TO RMCOM-INSRD-CLI-NM-KA.
           MOVE WAT88-INSRD-BTH-DT          TO RMCOM-INSRD-BTH-DT.
           MOVE WAT88-CVG-FACE-AMT          TO RMCOM-CVG-FACE-AMT.
           MOVE WAT88-PAY-NUM               TO RMCOM-PAY-NUM.
           MOVE WAT88-BILL-MODE-CD          TO RMCOM-BILL-MODE-CD.
           MOVE WAT88-BILL-TYP-CD           TO RMCOM-BILL-TYP-CD.
           MOVE WAT88-GRP-CLI-ID            TO RMCOM-GRP-CLI-ID.
MP0020     MOVE WAT88-EXTR-PREM-AMT         TO RMCOM-EXTR-PREM-AMT.
MP0020     MOVE WAT88-EXTR-PREM-COMM-RT     TO RMCOM-EXTR-PREM-COMM-RT.

B794B *
B794B * SET INDICATOR TO SHOW THAT BLOCK OF COMMISSION RECORDS
B794B * WAS NEGATIVE OR POSITIVE
B794B *
           IF  WAT88-COMM-CNVR-P-AMT < ZEROS
               SET RMCOM-COMM-CNVR-P-SIGN-NEG  TO TRUE
P01182*B10794         IF NOT WAT88-COMM-TYP-ASS-BASE
P01182*B794B             SET PRE-CONV-SIGN-NEG TO TRUE
P01182*B10794         END-IF
           ELSE
               SET RMCOM-COMM-CNVR-P-SIGN-POS  TO TRUE
P01182*B10794         IF NOT WAT88-COMM-TYP-ASS-BASE
P01182*B794B             SET PRE-CONV-SIGN-POS TO TRUE
P01182*B10794         END-IF
           END-IF.

MP0020* SET INDICATOR TO SHOW THAT EXTRA PREMIUM COMMISSION RECORDS
MP0020* WAS NEGATIVE OR POSITIVE
MP0020
MP0020     IF   WAT88-AFYC-SSTD-CNVR-P-AMT < ZEROS
MP0020          SET RMCOM-EXTR-CNVR-P-SIGN-NEG TO TRUE
MP0020     ELSE
MP0020          SET RMCOM-EXTR-CNVR-P-SIGN-POS TO TRUE
MP0020     END-IF.
MP0020
MP0020     MOVE WAT88-AFYC-SSTD-CNVR-P-AMT  TO RMCOM-EXTR-CNVR-P-AMT.
           MOVE WAT88-COMM-CNVR-P-AMT       TO RMCOM-COMM-CNVR-P-AMT.
           MOVE WAT88-AGT-HOLDER-IND        TO RMCOM-AGT-HOLDER-IND.

MM0198*
MM0198* DEFAULT RENEWAL STATUS TO THE VALUE ON THE WAT88
MM0198*
02CP01     IF  WAT88-RENW-TYP-VALID
02CP01         MOVE WAT88-RENW-TYP-CD       TO RMCOM-RENW-TYP-CD
02CP01     ELSE
02CP01         MOVE ZEROS                   TO RMCOM-RENW-TYP-CD
02CP01     END-IF.
02CP01

MM198B*MM0198*
MM198B*MM0198* IF WE HAVE A CONNECTED COVERAGE THAT EXPERIENCED A FACE
MM198B*MM0198* AMOUNT REDUCTION AT RENEWAL TIME THE CLIENTS WANT TO SEE
MM198B*MM0198* A RENEWAL STATUS OF '2' SO GET THE COVERAGES AND
MM198B*MM0198* AND CALL 9396 WITH DATA FROM THE ORIGINAL COVERAGE
MM198B*MM0198*
MM198B*MM0198     PERFORM  CVGS-1000-LOAD-CVGS-ARRAY
MM198B*MM0198         THRU CVGS-1000-LOAD-CVGS-ARRAY-X.
MM198B*MM0198
MM198B*MM0198     IF WCVGS-CVG-CONN-REASN-RENW (WAT88-CVG-ID)
MM198B*MM0198        PERFORM  9396-1000-BUILD-PARM-INFO
MM198B*MM0198            THRU 9396-1000-BUILD-PARM-INFO-X
MM198B*MM0198        MOVE WCVGS-CONN-CVG-NUM (WAT88-CVG-ID) TO WS-CONN-CVG-NUM
MM198B*MM0198        MOVE WS-CONN-CVG-NUM        TO WS-CONN-CVG-SUB
MM198B*MM0198        MOVE WS-CONN-CVG-SUB        TO L9396-CVG
MM198B*MM0198        MOVE WCVGS-CVG-ISS-EFF-DT (WS-CONN-CVG-SUB)
MM198B*MM0198        TO   L9396-EFF-DT
MM198B*MM0198        PERFORM  9396-1000-GET-RENW-CVG-INFO
MM198B*MM0198            THRU 9396-1000-GET-RENW-CVG-INFO-X
MM198B*MM0198        IF  NOT L9396-RETRN-OK
MM198B*MM0198*MSG:  ERROR IN PROCESSING COVERAGE RENEWAL INFORMATION
MM198B*MM0198            MOVE 'CS91500013'     TO WGLOB-MSG-REF-INFO
MM198B*MM0198            MOVE RPOL-POL-ID      TO WGLOB-MSG-PARM (1)
MM198B*MM0198            MOVE WS-CONN-CVG-NUM  TO WGLOB-MSG-PARM (2)
MM198B*MM0198            PERFORM 0260-1000-GENERATE-MESSAGE
MM198B*MM0198               THRU 0260-1000-GENERATE-MESSAGE-X
MM198B*MM0198        ELSE
MM198B*MM0198            MOVE L9396-RENW-TYP-CD TO RMCOM-RENW-TYP-CD
MM198B*MM0198        END-IF
MM198B*MM0198     END-IF.

02CP01     IF  WAT88-CLI-GR-TYP-CD    NOT = SPACES
02CP01         MOVE WAT88-CLI-GR-TYP-CD     TO RMCOM-CLI-GR-TYP-CD
02CP01     ELSE
02CP01         MOVE ZEROS                   TO RMCOM-CLI-GR-TYP-CD
02CP01     END-IF.
02CP01
02CP01     IF  WAT88-CORP-OWNER-IND   NOT = SPACES
02CP01         MOVE WAT88-CORP-OWNER-IND    TO RMCOM-CORP-OWNER-IND
02CP01     ELSE
02CP01         MOVE ZEROS                   TO RMCOM-CORP-OWNER-IND
02CP01     END-IF.
02CP01
02CP01     IF  WAT88-PREV-POL-ID      NOT = SPACES
02CP01         MOVE WAT88-PREV-POL-ID       TO RMCOM-PREV-POL-ID
02CP01     ELSE
02CP01         MOVE ZEROS                   TO RMCOM-PREV-POL-ID
02CP01     END-IF.
02CP01
02CP01     IF  WAT88-PREV-CVG-NUM     NOT = SPACES
02CP01         MOVE WAT88-PREV-CVG-NUM      TO RMCOM-PREV-CVG-NUM
02CP01     ELSE
02CP01         MOVE ZEROS                   TO RMCOM-PREV-CVG-NUM
02CP01     END-IF.
02CP01
B00873     IF  WAT88-TRNXT-TASK-ID    NOT = SPACES
B00873         MOVE WAT88-TRNXT-TASK-ID     TO RMCOM-TRNXT-TASK-ID
B00873     ELSE
B00873         MOVE ZEROS                   TO RMCOM-TRNXT-TASK-ID
B00873     END-IF.
B00873
1CCP01*  THIS FIELD IS SET IN PARAGARPH 3200
1CCP01*    IF  WAT88-CNVR-POL-CD      NOT = SPACES
1CCP01*        MOVE WAT88-CNVR-POL-CD       TO RMCOM-CNVR-POL-CD
1CCP01*    ELSE
1CCP01*        MOVE ZEROS                   TO RMCOM-CNVR-POL-CD
1CCP01*    END-IF.
02CP01
02CP01     IF  WAT88-CNVR-POL-ID      NOT = SPACES
02CP01         MOVE WAT88-CNVR-POL-ID       TO RMCOM-CNVR-POL-ID
02CP01     ELSE
02CP01         MOVE ZEROS                   TO RMCOM-CNVR-POL-ID
02CP01     END-IF.
02CP01
02CP01     IF  WAT88-CNVR-SML-PROD-CD NOT = SPACES
02CP01         MOVE WAT88-CNVR-SML-PROD-CD  TO RMCOM-CNVR-SML-PROD-CD
02CP01     ELSE
02CP01         MOVE ZEROS                   TO RMCOM-CNVR-SML-PROD-CD
02CP01     END-IF.

PR006T     MOVE WAT88-PROD-APP-TYP-CD       TO RMCOM-PROD-APP-TYP-CD.
PR006T     MOVE WAT88-CVG-CONN-REASN-CD     TO RMCOM-CONN-REASN-CD.
PR006Q     MOVE WAT88-SUB-CAT-CD            TO RMCOM-SUB-CAT-CD.

MM201B*MM0201     IF RMCOM-CONN-REASN-CD = SPACES
MM201B     IF RMCOM-CONN-REASN-CD = SPACES
MM201B     OR RMCOM-CONN-REASN-CD = LOW-VALUES
MM0201        MOVE '0' TO RMCOM-CONN-REASN-CD
MM0201     END-IF.

1CCP01*
1CCP01* CONVERSION COMPANION RECORD USES ASSET BASE RECORD
1CCP01* AS THE TRIGGER
1CCP01*
1CCP01     IF  WAT88-COMM-TYP-ASS-BASE
1CCP01         MOVE RMCOM-SEQ-REC-INFO      TO
1CCP01                            WS-SAVE-RMCOM-SEQ-REC-INFO
1CCP01         SET WS-ASSET-BASE-REC-YES    TO TRUE
B794D *        ADD 1 TO WS-ASS-BASE-CNT
B794D *        IF WS-ASS-BASE-CNT < WS-MAX-ASS-BASE
B01184            MOVE RMCOM-TRNXT-TASK-ID
B794D             TO   WS-SAVE-TRANS-ID
P01182*B01174            MOVE RMCOM-COMM-CNVR-P-SIGN-IND
P01182*B794D             TO   WS-SAVE-SIGN
B794D *           MOVE RMCOM-COMM-CNVR-P-AMT
B794D *           TO   WS-SAVE-AMT
B794D             MOVE RMCOM-PRCES-DT
B794D             TO   WS-SAVE-PRCES-DT 
P01182            MOVE WAT88-MTHV-OPT-CD
P01182            TO   WS-SAVE-MTHV-OPT-CD
B794D *        END-IF
1CCP01     END-IF.

MFFCOM     MOVE WAT88-SA-DPOS-CD TO RMCOM-SA-DPOS-CD.
MFFCOM     MOVE WAT88-FRST-SA-DPOS-DT TO RMCOM-FRST-SA-DPOS-DT.
MFFCOM     MOVE WAT88-PIRA-IND TO RMCOM-PIRA-IND.
EN9200
EN9200     PERFORM  7000-CALC-PYMT-PERI
EN9200         THRU 7000-CALC-PYMT-PERI-X.
EN9200
NWLCOM     MOVE WAT88-PREM-PMT-PERI         TO RMCOM-PREM-PMT-PERI.
NWLCOM     MOVE WAT88-INSRD-RT-AGE          TO RMCOM-INSRD-RT-AGE.
NWLC88     MOVE WAT88-CWA-PRCES-DT          TO RMCOM-CWA-PRCES-DT.
NWLC88     MOVE WAT88-LIAB-STRT-DT          TO RMCOM-LIAB-STRT-DT.
NWLC88     MOVE WAT88-PREM-PD-DT            TO RMCOM-PREM-PD-DT.
NWLC88     MOVE WAT88-CVG-ME-DUR            TO RMCOM-CVG-ME-DUR.
MP143C     MOVE WAT88-ADV-MED-BNFT-IND      TO RMCOM-CVG-ME-DUR.
           PERFORM  MCOM-1000-WRITE
               THRU MCOM-1000-WRITE-X.

B00549     SET WS-COMM-RECRD-WRITTEN        TO TRUE.

       3100-SET-UP-MCOM-REC-X.
           EXIT.
      /
      *--------------------
1CCP01 3200-CNVR-POL-PRCES.
      *--------------------
1CCP01
1CCP01     IF  WAT88-POL-ID                 = WS-SAVE-POL-ID
1CCP01     AND WAT88-AGT-ID                 = WS-SAVE-AGT-ID
1CCP01     AND WAT88-TRANS-DT               = WS-SAVE-TRANS-DT
B10794     AND WAT88-TRNXT-TASK-ID          = WS-SAVE-TASK-ID
B794B      AND WAT88-PRCES-DT               = WS-SAVE-PRCES-DT-CTL
B794D      AND NOT WAT88-COMM-TYP-ASS-BASE
1CCP01         NEXT SENTENCE
1CCP01     ELSE
B794D        IF WS-SAVE-COMM-TYP-CD NOT = SPACES
1CCP01         PERFORM  3300-PRCES-MCOM-CNVR-REC
1CCP01             THRU 3300-PRCES-MCOM-CNVR-REC-X
1CCP01         MOVE WAT88-POL-ID               TO WS-SAVE-POL-ID
1CCP01         MOVE WAT88-AGT-ID               TO WS-SAVE-AGT-ID
1CCP01         MOVE WAT88-TRANS-DT             TO WS-SAVE-TRANS-DT
B10794         MOVE WAT88-TRNXT-TASK-ID        TO WS-SAVE-TASK-ID
B794B          MOVE WAT88-PRCES-DT             TO WS-SAVE-PRCES-DT-CTL
B794D          MOVE WAT88-COMM-TYP-CD          TO WS-SAVE-COMM-TYP-CD
1CCP01         SET WS-ASSET-BASE-REC-NO        TO TRUE
1CCP01         SET WS-CNVR-CASE-NO             TO TRUE
B794B *        SET PRE-CONV-NO-POS             TO TRUE
B794B *        SET PRE-CONV-NO-NEG             TO TRUE
P01182*B794D          SET PRE-CONV-SIGN-UNK           TO TRUE
B794D *        MOVE ZEROS                      TO WS-ASS-BASE-CNT
B01184         INITIALIZE WS-SAVE-TRANS-ID-AREA
B794D        END-IF
1CCP01     END-IF.
1CCP01
B794D      MOVE WAT88-COMM-TYP-CD TO WS-SAVE-COMM-TYP-CD.

1CCP01* DEFAULT SETTING IS FOR A NON-CONVERSION POLICY
1CCP01     SET RMCOM-CNVR-POL-NO       TO TRUE.
1CCP01
1CCP01* IF THE POLICY HAS CHANGED, READ THE POLICY RELATED TABLES
1CCP01     IF  WAT88-POL-ID NOT =  WS-SAVE-POL-ID-READ
1CCP01         PERFORM  3210-RETRIEVE-POL
1CCP01             THRU 3210-RETRIEVE-POL-X
1CCP01     END-IF.
1CCP01
1CCP01* EXIT IF NOT A CONVERSION POLICY
UCPUPL*1CCP01     IF  RPOL-POL-CNVR-TYP-NONE
UCPUPL     IF  NOT RPOL-POL-CNVR-TYP-DHY-PHASE1
1CCP01         GO TO 3200-CNVR-POL-PRCES-X
1CCP01     END-IF.
1CCP01
B10819*
1CCP01* EXIT IF COVERAGE WAS ADDED AFTER POLICY ISSUE
B10819* NOT RELEVANT FOR COVERAGE NUMBER 1
B10819*
B10819* TEST TO SEE IF WAT88-POL-ISS-DT CONTAINS A VALID DATE,
B10819* IF IT DOES NOT THEN IT WAS GENERATED BEFORE THE DATE WAS
B10819* ADDED TO THE WAT88 RECORD SO USE THE OLD COMPARISON OF
B10819* WAT88 COVERAGE DATE TO RPOL DATE
B10819*
B10819     MOVE WAT88-POL-ISS-DT TO L1640-EXTERNAL-DATE.
B10819
B10819     PERFORM  1640-3000-EXTERNAL-TO-INT
B10819         THRU 1640-3000-EXTERNAL-TO-INT-X.
B10819
B10819     IF (WAT88-CVG-ID NOT = 1
B10819     AND L1640-VALID
B10819     AND WAT88-CVG-ISS-DT NOT = WAT88-POL-ISS-DT)
B10819     OR (WAT88-CVG-ID NOT = 1
B10819     AND L1640-NOT-VALID
B10819     AND WAT88-CVG-ISS-DT NOT = RPOL-POL-ISS-EFF-DT)
1CCP01         GO TO 3200-CNVR-POL-PRCES-X
1CCP01     END-IF.
1CCP01
1CCP01     PERFORM  3220-GET-RENEWAL-IND
1CCP01         THRU 3220-GET-RENEWAL-IND-X.
1CCP01
1CCP01**   EXIT IF RENEWAL CHECK WAS NOT OK
1CCP01
1CCP01     IF  NOT L9396-RETRN-OK
1CCP01         GO TO 3200-CNVR-POL-PRCES-X
1CCP01     END-IF.
1CCP01
1CCP01**   EXIT IF COVERAGE HAS RENEWED
1CCP01
1CCP01     IF  L9396-RENW-PER
MP0010         IF L9396-RENW-TYP-ELAPS-TIME-VAL
MP0010             IF  WCVGS-CVG-CONN-REASN-RENW (WAT88-CVG-ID)
MP0010             AND NOT L9396-RENW-COMM-CAT-REQ-CHG
MP0010                 GO TO 3200-CNVR-POL-PRCES-X
MP0010             ELSE
MP0010                 MOVE WCVGS-CVG-ISS-EFF-DT (WAT88-CVG-ID)
MP0010                                      TO L1680-INTERNAL-1
MP0010                 MOVE WCVGS-CVG-STBL-1-CD (WAT88-CVG-ID)
MP0010                                      TO L1680-NUMBER-OF-YEARS
MP0010                 MOVE ZEROS           TO L1680-NUMBER-OF-MONTHS
MP0010                 MOVE ZEROS           TO L1680-NUMBER-OF-DAYS
MP0010                 PERFORM  1680-3000-ADD-Y-M-D-TO-DATE
MP0010                     THRU 1680-3000-ADD-Y-M-D-TO-DATE-X
MP0010                 IF WAT88-TRANS-DT >= L1680-INTERNAL-2
MP0010                     GO TO 3200-CNVR-POL-PRCES-X
MP0010                 END-IF
MP0010             END-IF
MP0010         ELSE
1CCP01             GO TO 3200-CNVR-POL-PRCES-X
MP0010         END-IF
1CCP01     END-IF.
1CCP01
1CCP01* POLICY IS A CONVERSION POLICY
1CCP01
1CCP01     SET RMCOM-CNVR-POL-YES      TO TRUE.
1CCP01
U50201     IF  WCVGS-CVG-INS-TYP-SEG-FUND (WAT88-CVG-ID)
U50201         SET RMCOM-CNVR-POL-NO       TO TRUE
U50201     END-IF.
1CCP01
1CCP01* IF POLICY IS GREATER THAN 5 YEARS OLD, DO NOT
1CCP01* CREATE ANY PRE-CONVERSION RECORDS SO EXIT PARAGRAPH
1CCP01
1CCP01     IF  RPOL-POL-PREV-ANNV-DUR-N > 4
1CCP01         GO TO 3200-CNVR-POL-PRCES-X
1CCP01     END-IF.
1CCP01
1CCP01* SET INDICATOR TO CREATE THE PRE-CONVERSION RECORD
1CCP01
1CCP01     SET WS-CNVR-CASE-YES        TO TRUE.
1CCP01
1CCP01 3200-CNVR-POL-PRCES-X.
1CCP01     EXIT.
1CCP01
1CCP01*------------------
1CCP01 3210-RETRIEVE-POL.
1CCP01*------------------
1CCP01
1CCP01     MOVE WAT88-POL-ID       TO WPOL-POL-ID
1CCP01
1CCP01     PERFORM  POL-1000-READ
1CCP01         THRU POL-1000-READ-X
1CCP01
1CCP01     IF NOT WPOL-IO-OK
1CCP01*MSG: 'POL RECORD MISSING FOR POLICY (@1)
1CCP01         MOVE 'CS93900012'        TO WGLOB-MSG-REF-INFO
1CCP01         MOVE WPOL-POL-ID         TO WGLOB-MSG-PARM (1)
1CCP01         PERFORM  0260-1000-GENERATE-MESSAGE
1CCP01             THRU 0260-1000-GENERATE-MESSAGE-X
1CCP01         SET WS-CNVR-CASE-NO      TO TRUE
1CCP01         GO TO 3210-RETRIEVE-POL-X
1CCP01     END-IF.
1CCP01
1CCP01     MOVE RPOL-POL-ID TO WS-SAVE-POL-ID-READ.
1CCP01
1CCP01* EXIT IF NOT A CONVERSION POLICY
1CCP01
UCPUPL*1CCP01     IF  RPOL-POL-CNVR-TYP-NONE
UCPUPL     IF  NOT RPOL-POL-CNVR-TYP-DHY-PHASE1
1CCP01         GO TO 3210-RETRIEVE-POL-X
1CCP01     END-IF.
1CCP01
1CCP01     PERFORM  CVGS-1000-LOAD-CVGS-ARRAY
1CCP01         THRU CVGS-1000-LOAD-CVGS-ARRAY-X.
1CCP01
1CCP01     PERFORM  PGA-1000-BUILD-PARMS
1CCP01         THRU PGA-1000-BUILD-PARMS-X.
1CCP01
1CCP01 3210-RETRIEVE-POL-X.
1CCP01     EXIT.
1CCP01
1CCP01*---------------------
1CCP01 3220-GET-RENEWAL-IND.
1CCP01*---------------------
1CCP01
1CCP01* RETRIEVE RENEWAL INFORMATION FOR CURRENT COVERAGE
1CCP01
1CCP01     PERFORM  9396-1000-BUILD-PARM-INFO
1CCP01         THRU 9396-1000-BUILD-PARM-INFO-X.
1CCP01
1CCP01* PRESERVATION ALLOWANCE RECORDS ARE NOT TIED
1CCP01* TO A COVERAGE (COVERAGE NUMBER IS ZEROES) SO
1CCP01* RENEWALS ARE NOT APPLICABLE
1CCP01
1CCP01     IF  WAT88-COMM-TYP-PREV-ALL
1CCP01         GO TO 3220-GET-RENEWAL-IND-X
1CCP01     END-IF.
1CCP01
1CCP01     MOVE WAT88-CVG-ID         TO L9396-CVG.
1CCP01     MOVE WAT88-TRANS-DT       TO L9396-EFF-DT.
1CCP01
1CCP01     PERFORM  9396-1000-GET-RENW-CVG-INFO
1CCP01         THRU 9396-1000-GET-RENW-CVG-INFO-X.
1CCP01
1CCP01     IF  NOT L9396-RETRN-OK
1CCP01*MSG:  ERROR IN PROCESSING COVERAGE RENEWAL INFORMATION
1CCP01         MOVE 'CS93900010' TO WGLOB-MSG-REF-INFO
1CCP01         MOVE RPOL-POL-ID  TO WGLOB-MSG-PARM (1)
1CCP01         MOVE WAT88-CVG-ID TO WGLOB-MSG-PARM (2)
1CCP01         PERFORM 0260-1000-GENERATE-MESSAGE
1CCP01            THRU 0260-1000-GENERATE-MESSAGE-X
1CCP01     END-IF.
1CCP01
1CCP01 3220-GET-RENEWAL-IND-X.
1CCP01     EXIT.
1CCP01
1CCP01*-------------------------
1CCP01 3300-PRCES-MCOM-CNVR-REC.
1CCP01*-------------------------
1CCP01
1CCP01     IF  WS-CNVR-CASE-NO
1CCP01     OR  WS-ASSET-BASE-REC-NO
1CCP01         GO TO 3300-PRCES-MCOM-CNVR-REC-X
1CCP01     END-IF.
1CCP01
1CCP01     MOVE WS-SAVE-RMCOM-SEQ-REC-INFO
1CCP01                                  TO RMCOM-SEQ-REC-INFO.
1CCP01
1CCP01****************************************************************
1CCP01* FIRST SET SPECIFIC FIELD VALUES FOR THE PRE-CONVERSION RECORD
1CCP01* (THE FIELDS ARE SET IN THE SAME ORDER AS ON THE RECORD LAYOUT)
1CCP01****************************************************************
1CCP01
1CCP01     MOVE ZEROES                  TO RMCOM-CVG-ID.
1CCP01     MOVE SPACES                  TO RMCOM-INSRD-CLI-NM.
1CCP01     INSPECT RMCOM-INSRD-CLI-NM REPLACING ALL WS-SB-SPACE-SPACE
1CCP01                                           BY WS-DB-SPACE.
1CCP01     MOVE ZEROES                  TO RMCOM-SUB-AGNT-ID.
1CCP01     MOVE ZEROES                  TO RMCOM-RT.
1CCP01     SET RMCOM-COMM-TYP-CNVR      TO TRUE.
1CCP01     MOVE ZEROS                   TO RMCOM-LRG-PROD-CD.
1CCP01     MOVE ZEROS                   TO RMCOM-SM-PROD-CD.
1CCP01     MOVE WWKDT-ZERO-DT           TO RMCOM-APP-RECV-DT.
1CCP01
1CCP01     MOVE ZERO                    TO RMCOM-BILL-TYP-CD.
B01150*    MOVE SPACE                   TO RMCOM-AGT-HOLDER-IND.
1CCP01     MOVE ZERO                    TO RMCOM-RENW-TYP-CD.
1CCP01     MOVE ZERO                    TO RMCOM-CLI-GR-TYP-CD.
1CCP01     MOVE ZERO                    TO RMCOM-CORP-OWNER-IND.
1CCP01     MOVE ZERO                    TO RMCOM-PREV-POL-ID.
1CCP01     MOVE ZERO                    TO RMCOM-PREV-CVG-NUM-N.
MP0020     MOVE ZERO                    TO RMCOM-EXTR-PREM-AMT.
MP0020     MOVE ZERO                    TO RMCOM-EXTR-PREM-COMM-RT.
MP0020     MOVE ZERO                    TO RMCOM-EXTR-CNVR-P-AMT.
NWLCOM     MOVE ZEROES                      TO RMCOM-PREM-PMT-PERI.
NWLCOM     MOVE ZEROES                      TO RMCOM-INSRD-RT-AGE.
NWLC88     MOVE WWKDT-ZERO-DT               TO RMCOM-CWA-PRCES-DT.
NWLC88     MOVE WWKDT-ZERO-DT               TO RMCOM-LIAB-STRT-DT.
NWLC88     MOVE WWKDT-ZERO-DT               TO RMCOM-PREM-PD-DT.
NWLC88     MOVE ZEROES                      TO RMCOM-CVG-ME-DUR.
MP143C     SET RMCOM-ADV-MED-BNFT-NO     TO TRUE.
U50285     SET RMCOM-SA-DPOS-NO         TO TRUE.
U50285     MOVE WWKDT-ZERO-DT           TO RMCOM-FRST-SA-DPOS-DT.
U50285     SET RMCOM-PIRA-NO            TO TRUE.
1CCP01
1CCP01     SET  RMCOM-CNVR-POL-PRE-CVNR TO TRUE.
1CCP01
1CCP01***************************************************************
1CCP01* THE FIRST POLX RECORD IS REQUIRED TO SET SOME OF THE FIELDS
1CCP01***************************************************************
1CCP01
1CCP01     MOVE LOW-VALUES              TO WPOLX-KEY.
1CCP01     MOVE RMCOM-POL-ID            TO WPOLX-POL-ID.
1CCP01     MOVE 000                     TO WPOLX-SEQ-NUM-N.
1CCP01
1CCP01     MOVE WPOLX-KEY               TO WPOLX-ENDBR-KEY.
1CCP01     MOVE 999                     TO WPOLX-ENDBR-SEQ-NUM-N.
1CCP01
1CCP01     PERFORM  POLX-1000-BROWSE
1CCP01         THRU POLX-1000-BROWSE-X.
1CCP01
1CCP01     PERFORM  POLX-2000-READ-NEXT
1CCP01         THRU POLX-2000-READ-NEXT-X.
1CCP01
1CCP01     IF  NOT WPOLX-IO-OK
1CCP01*MSG: 'POLX RECORD MISSING FOR POLICY (@1) - PRE-CONVERSION
1CCP01*                                      RECORD NOT CREATED
1CCP01         MOVE 'CS93900009'        TO WGLOB-MSG-REF-INFO
1CCP01         MOVE WPOLX-POL-ID        TO WGLOB-MSG-PARM (1)
1CCP01         PERFORM  0260-1000-GENERATE-MESSAGE
1CCP01             THRU 0260-1000-GENERATE-MESSAGE-X
1CCP01         PERFORM  POLX-3000-END-BROWSE
1CCP01             THRU POLX-3000-END-BROWSE-X
1CCP01         SET WS-CNVR-CASE-NO      TO TRUE
1CCP01         GO TO 3300-PRCES-MCOM-CNVR-REC-X
1CCP01     END-IF.
1CCP01
1CCP01****************************************************************
1CCP01* NEXT, SET THE RMCOM FIELDS WITH DATA FROM THE POLX RECORD
1CCP01* (THE FIELDS ARE SET IN THE SAME ORDER AS ON THE RECORD LAYOUT)
1CCP01****************************************************************
1CCP01
1CCP01     MOVE RPOLX-ORIG-CPREM-AMT     TO RMCOM-AMT.
1CCP01     MOVE RPOLX-ORIG-POL-ISS-DT    TO RMCOM-CVG-ISS-DT.
1CCP01     MOVE SPACES                   TO RMCOM-INSRD-CLI-NM-KA.
1CCP01     MOVE SPACES                   TO RMCOM-INSRD-BTH-DT.
1CCP01
1CCP01     PERFORM  2435-1000-BUILD-PARM-INFO
1CCP01         THRU 2435-1000-BUILD-PARM-INFO-X.
1CCP01     MOVE RPOLX-INSRD-CLI-ID       TO L2435-CLI-ID.
1CCP01     PERFORM  2435-1000-OBTAIN-CLI-INFO
1CCP01         THRU 2435-1000-OBTAIN-CLI-INFO-X.
1CCP01
1CCP01     IF  L2435-RETRN-OK
1CCP01         MOVE L2435-CLI-NM-COMPRESSED
1CCP01                                   TO RMCOM-INSRD-CLI-NM-KA
1CCP01         MOVE L2435-CLI-BTH-DT     TO RMCOM-INSRD-BTH-DT
1CCP01     END-IF.
1CCP01
1CCP01     MOVE RPOLX-ORIG-COMM-FACE-AMT TO RMCOM-CVG-FACE-AMT.
1CCP01     MOVE RPOLX-ORIG-PAY-NUM       TO RMCOM-PAY-NUM.
1CCP01
B01150*    MOVE RPOLX-ORIG-PMT-MTHD-CD   TO RMCOM-BILL-MODE-CD.
B01150     MOVE RPOLX-ORIG-PMT-MTHD-CD   TO L0280-INPUT-DATA.
B01150     SET L0280-SIGN-NOT-PERMITTED  TO TRUE.
B01150     MOVE LENGTH OF RPOLX-ORIG-PMT-MTHD-CD
B01150                                   TO L0280-LENGTH.
B01150     MOVE 0                        TO L0280-PRECISION.
B01150     MOVE LENGTH OF RPOLX-ORIG-PMT-MTHD-CD
B01150                                   TO L0280-INPUT-SIZE.
B01150     PERFORM  0280-1000-NUMERIC-EDIT
B01150         THRU 0280-1000-NUMERIC-EDIT-X.
B01150     IF  L0280-OK
B01150         MOVE L0280-OUTPUT         TO WS-NUMERIC-2
B01150         MOVE WS-NUMERIC-2         TO RMCOM-BILL-MODE-CD
B01150     ELSE
B01150         MOVE ZEROS                TO RMCOM-BILL-MODE-CD
B01150     END-IF.
1CCP01
B01150*    SET RMCOM-COMM-CNVR-P-SIGN-NEG TO TRUE.
B01174*
B01174*    IF ANY AMOUNT IN THE PRECEEDING SET OF DATA FOR THE
B01174*    POLICY / AGENT / DATE COMBINATION WAS NEGATIVE,
B01174*    THEN THE PRE-CONVERSION RECORD MUST INDICATE NEGATIVE
B01174*
B01174*    MADE OBSOLETE BY B01184 CHANGES
B01174*
B01174*    IF PRE-CONV-MUST-BE-NEG
B01174*       SET RMCOM-COMM-CNVR-P-SIGN-NEG TO TRUE
B01174*    ELSE
B01174*       SET RMCOM-COMM-CNVR-P-SIGN-POS TO TRUE
B01174*    END-IF.
B01174*
B10794*    POPULATE THE SIGN INDICATOR DEPENDING ON THE SIGN INDICATOR
B10794*    OF THE COMMISSION RECORDS IN THE SET
B10794*
B10794*     IF PRE-CONV-MUST-BE-NEG
B10794*        SET RMCOM-COMM-CNVR-P-SIGN-NEG TO TRUE
B10794*     ELSE
B10794*        IF PRE-CONV-MUST-BE-POS
B10794*           SET RMCOM-COMM-CNVR-P-SIGN-POS TO TRUE
B10794*        END-IF
B10794*     END-IF.
B10794
1CCP01     COMPUTE L0289-CRCY-AMT =
1CCP01                 RPOLX-ORIG-AFYC-AMT *
1CCP01                 RMCOM-SHR-PCT / 100.
1CCP01     PERFORM  0289-1000-CRCY-RND
1CCP01         THRU 0289-1000-CRCY-RND-X.
P01182
P01182* 'RMCOM-COMM-CNVR-P-SIGN-IND' FOR PRE-CONVERSION(B) RECORD SHOULD BE
P01182* SET BASED ON THE UNDO/REDO INDICATOR FOR THE ASEEET RECORD.
P01182
P01182     IF  WS-SAVE-MTHV-OPT-UNDO
P01182         SET RMCOM-COMM-CNVR-P-SIGN-NEG  TO TRUE
P01182     ELSE
P01182         SET RMCOM-COMM-CNVR-P-SIGN-POS  TO TRUE
P01182     END-IF.
P01182
1CCP01     MOVE L0289-CRCY-AMT           TO RMCOM-COMM-CNVR-P-AMT.
1CCP01
B01150*    MOVE RPOLX-ORIG-POL-ID        TO RMCOM-CNVR-POL-ID.
B01150     MOVE RPOLX-ORIG-POL-ID        TO L0280-INPUT-DATA.
B01150     SET L0280-SIGN-NOT-PERMITTED  TO TRUE.
B01150     MOVE LENGTH OF RPOLX-ORIG-POL-ID
B01150                                   TO L0280-LENGTH.
B01150     MOVE 0                        TO L0280-PRECISION.
B01150     MOVE LENGTH OF RPOLX-ORIG-POL-ID
B01150                                   TO L0280-INPUT-SIZE.
B01150     PERFORM  0280-1000-NUMERIC-EDIT
B01150         THRU 0280-1000-NUMERIC-EDIT-X.
B01150     IF  L0280-OK
B01150         MOVE L0280-OUTPUT         TO WS-NUMERIC-7
B01150         MOVE WS-NUMERIC-7         TO RMCOM-CNVR-POL-ID
B01150     ELSE
B01150         MOVE ZEROS                TO RMCOM-CNVR-POL-ID
B01150     END-IF.
1CCP01
B01150*    MOVE RPOLX-ORIG-SML-PROD-CD   TO RMCOM-CNVR-SML-PROD-CD.
B01150     MOVE RPOLX-ORIG-SML-PROD-CD   TO L0280-INPUT-DATA.
B01150     SET L0280-SIGN-NOT-PERMITTED  TO TRUE.
B01150     MOVE LENGTH OF RPOLX-ORIG-SML-PROD-CD
B01150                                   TO L0280-LENGTH.
B01150     MOVE 0                        TO L0280-PRECISION.
B01150     MOVE LENGTH OF RPOLX-ORIG-SML-PROD-CD
B01150                                   TO L0280-INPUT-SIZE.
B01150     PERFORM  0280-1000-NUMERIC-EDIT
B01150         THRU 0280-1000-NUMERIC-EDIT-X.
B01150     IF  L0280-OK
B01150         MOVE L0280-OUTPUT         TO WS-NUMERIC-3
B01150         MOVE WS-NUMERIC-3         TO RMCOM-CNVR-SML-PROD-CD
B01150     ELSE
B01150         MOVE ZEROS                TO RMCOM-CNVR-SML-PROD-CD
B01150     END-IF.
1CCP01
1CCP01     PERFORM  POLX-3000-END-BROWSE
1CCP01         THRU POLX-3000-END-BROWSE-X.
1CCP01
B794D ********************************************************************
B794D * START OF OBSOLETE SIGN INDICATOR CODE !!!!!!!!!!!!!!!!!!!!!!!!!!!!
B794D *    MOVE ZERO TO WS-PRE-CNVR-REC-SUB.
B794D *    MOVE ZERO TO WS-POS-NEG-CNT.
B01184
B794D *    PERFORM WS-ASS-BASE-CNT TIMES
B01184
B794D *       ADD 1 TO WS-PRE-CNVR-REC-SUB
B794D *       ADD 1 TO WS-POS-NEG-CNT
B794B
B794D *       IF WS-POS-NEG-CNT > 2
B794D *          MOVE 1 TO WS-POS-NEG-CNT
B794D *       END-IF
B01184
B10794*       IF WS-SAVE-AMT (WS-PRE-CNVR-REC-SUB) = ZERO
B10794*          SET RMCOM-COMM-CNVR-P-SIGN-NEG  TO TRUE
B10794*       ELSE
B10794*          MOVE WS-SAVE-SIGN     (WS-PRE-CNVR-REC-SUB)
B10794*          TO   RMCOM-COMM-CNVR-P-SIGN-IND
B10794*       END-IF

B10794*
B10794* IF THE SIGN OF THE PRE-COMVERSION RECORD IS AVAILABLE
B10794* AT THIS POINT, IT MEANS WE DID NOT HAVE ANY NON-ASSET
B10794* TYPE RECORDS SO WE WILL RE-USE THE SIGN FROM THE
B10794* ASSET TYPE RECORD.
B10794*
B10794*        IF PRE-CONV-SIGN-AVAIL (WS-SET-SUB)
B10794*           MOVE WS-SAVE-SIGN (WS-PRE-CNVR-REC-SUB)
B10794*           TO   RMCOM-COMM-CNVR-P-SIGN-IND
B10794*        END-IF

B794B *
B794B *       IF  PRE-CONV-POS
B794B *       AND PRE-CONV-NEG
B794B *           IF WS-POS-NEG-CNT = 1
B794B *              SET RMCOM-COMM-CNVR-P-SIGN-POS TO TRUE
B794B *           ELSE
B794B *              SET RMCOM-COMM-CNVR-P-SIGN-NEG TO TRUE
B794B *           END-IF
B794B *       ELSE IF PRE-CONV-POS
B794B *               SET RMCOM-COMM-CNVR-P-SIGN-POS TO TRUE
B794B *            ELSE IF PRE-CONV-NEG
B794B *                    SET RMCOM-COMM-CNVR-P-SIGN-NEG TO TRUE
B794B *                 ELSE
B794B *                    MOVE WS-SAVE-SIGN (WS-PRE-CNVR-REC-SUB)
B794B *                    TO   RMCOM-COMM-CNVR-P-SIGN-IND
B794B *                 END-IF
B794B *            END-IF
B794B *       END-IF
B794D * END OF OBSOLETE SIGN INDICATOR CODE !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
B794D ********************************************************************

B794D ********************************************************************
B794D * WRITE THE PRE-CONVERSION 'B' TYPE RECORD,
1CCP01* UPDATE THE RECORDS WRITTEN COUNTER,
1CCP01* UPDATE THE PRE-CONVERSION RECORDS COUNTER
B794D ********************************************************************
B794D *
B794D * SET THE SIGN INDICATOR BASED ON THE SIGN OF THE SET OF
B794D * COMMISSION RECORDS
B794D *
B794D * IF IN FACT THERE WERE NO COMMISSION RECORDS THEN WE USE THE
B794D * SIGN THAT WAS SAVED FROM THE CORRESPONDING 'A' TYPE RECORD
P01182
P01182* 'RMCOM-COMM-CNVR-P-SIGN-IND' FOR PRE-CONVERSION(B) RECORD SHOULD BE
P01182* SET BASED ON THE UNDO/REDO INDICATOR FOR THE ASEEET RECORD.
P01182
P01182*B794D
P01182*B794D         IF PRE-CONV-SIGN-POS
P01182*B794D            SET RMCOM-COMM-CNVR-P-SIGN-POS TO TRUE
P01182*B794D         ELSE IF PRE-CONV-SIGN-NEG
P01182*B794D                 SET RMCOM-COMM-CNVR-P-SIGN-NEG TO TRUE
P01182*B794D              ELSE
P01182*B794D                 MOVE WS-SAVE-SIGN
P01182*B794D                 TO   RMCOM-COMM-CNVR-P-SIGN-IND
P01182*B794D              END-IF
P01182*B794D         END-IF.

B01184
B794D      MOVE WS-SAVE-TRANS-ID
B01184                              TO RMCOM-TRNXT-TASK-ID.

B794D      MOVE WS-SAVE-PRCES-DT
B01174                              TO RMCOM-PRCES-DT.
B01174
EN9200     PERFORM  7000-CALC-PYMT-PERI
EN9200         THRU 7000-CALC-PYMT-PERI-X.
EN9200
EN9200     MOVE WAT88-PREM-PMT-PERI         TO RMCOM-PREM-PMT-PERI.
EN9200
1CCP01     PERFORM  MCOM-1000-WRITE
1CCP01         THRU MCOM-1000-WRITE-X.
B01184
1CCP01     ADD +1                   TO WS-MCOM-RECORDS-WRITE.
1CCP01     ADD +1                   TO WS-MCOM-PRE-CNVR-RECS.
B01184
B794D *    END-PERFORM.
1CCP01
1CCP01 3300-PRCES-MCOM-CNVR-REC-X.
1CCP01     EXIT.

      *-----------------
       4000-UPDATE-NB88.
      *-----------------

B00549*    ADD +1                   TO WS-MCOM-RECORDS-WRITE.
           MOVE RNB88-REC-DETAIL    TO WAT88-REC-INFO.
B00549     SET  WS-COMM-RECRD-NOT-WRITTEN  TO TRUE.

           PERFORM  3100-SET-UP-MCOM-REC
               THRU 3100-SET-UP-MCOM-REC-X.

B00549     IF  WS-COMM-RECRD-WRITTEN
B00549         ADD +1                   TO WS-MCOM-RECORDS-WRITE
               PERFORM  6000-ACCUM-NB88-PRINT
                   THRU 6000-ACCUM-NB88-PRINT-X
B00549     ELSE
B00549         PERFORM  8700-PRINT-WARNING
B00549             THRU 8700-PRINT-WARNING-X
B00549     END-IF.

           PERFORM  NB88-1000-READ
               THRU NB88-1000-READ-X.

           IF  WNB88-SEQ-IO-OK
               ADD +1               TO WS-NB88-RECORDS-READ
           END-IF.

       4000-UPDATE-NB88-X.
           EXIT.
      /

FEID06*-----------------
FEID06 4100-UPDATE-AC88.
FEID06*-----------------
FEID06
FEID06     MOVE RAC88-REC-DETAIL            TO WAT88-REC-INFO.
FEID06     SET  WS-COMM-RECRD-NOT-WRITTEN   TO TRUE.
FEID06
FEID06     PERFORM  3100-SET-UP-MCOM-REC
FEID06         THRU 3100-SET-UP-MCOM-REC-X.
FEID06
FEID06     IF  WS-COMM-RECRD-WRITTEN
FEID06         ADD +1                       TO WS-MCOM-RECORDS-WRITE
FEID06         PERFORM  4200-ACCUM-AC88-PRINT
FEID06             THRU 4200-ACCUM-AC88-PRINT-X
FEID06     ELSE
FEID06         PERFORM  8700-PRINT-WARNING
FEID06             THRU 8700-PRINT-WARNING-X
FEID06     END-IF.
FEID06
FEID06     PERFORM  AC88-1000-READ
FEID06         THRU AC88-1000-READ-X.
FEID06
FEID06     IF  WAC88-SEQ-IO-OK
FEID06         ADD +1                       TO WS-AC88-RECORDS-READ
FEID06     END-IF.
FEID06
FEID06 4100-UPDATE-AC88-X.
FEID06     EXIT.
FEID06
FEID06*----------------------
FEID06 4200-ACCUM-AC88-PRINT.
FEID06*----------------------
FEID06
FEID06     EVALUATE TRUE
FEID06
FEID06         WHEN WAT88-COMM-TYP-COI
FEID06              ADD +1                  TO WS-COI-REC-AC88
FEID06              ADD WAT88-COMM-CNVR-P-AMT
FEID06                                      TO WS-COI-CNVR-P-AC88
FEID06
FEID06         WHEN WAT88-COMM-TYP-COI-REF
FEID06              ADD +1                  TO WS-COIR-REC-AC88
FEID06              ADD WAT88-COMM-CNVR-P-AMT
FEID06                                      TO WS-COIR-CNVR-P-AC88
FEID06
FEID06         WHEN WAT88-COMM-TYP-COI-SHRT
FEID06              ADD +1                  TO WS-COIS-REC
FEID06              ADD WAT88-COMM-CNVR-P-AMT
FEID06                                      TO WS-COIS-CNVR-P
FEID06
FEID06         WHEN WAT88-COMM-TYP-ASS-BASE
FEID06              ADD +1                  TO WS-AB-AC88-REC
FEID06              ADD WAT88-COMM-CNVR-P-AMT
FEID06                                      TO WS-AB-AC88-COMM-AMT
FEID06
FEID06     END-EVALUATE.
FEID06
FEID06 4200-ACCUM-AC88-PRINT-X.
FEID06     EXIT.


      *----------------------
       5000-ACCUM-TP88-PRINT.
      *----------------------

           EVALUATE TRUE

               WHEN WAT88-COMM-TYP-COI
                    ADD +1                      TO WS-COI-REC-TP88
                    ADD WAT88-COMM-CNVR-P-AMT   TO WS-COI-CNVR-P-TP88

               WHEN WAT88-COMM-TYP-COI-REF
                    ADD +1                      TO WS-COIR-REC-TP88
                    ADD WAT88-COMM-CNVR-P-AMT   TO WS-COIR-CNVR-P-TP88

               WHEN WAT88-COMM-TYP-COI-SHRT
                    ADD +1                      TO WS-COIS-REC
                    ADD WAT88-COMM-CNVR-P-AMT   TO WS-COIS-CNVR-P

               WHEN WAT88-COMM-TYP-ASS-BASE
B00659*             ADD +1                      TO WS-AB-REC
B00659              ADD +1                      TO WS-AB-TP88-REC
B00659*             ADD WAT88-COMM-CNVR-P-AMT   TO WS-AB-COMM-AMT
B00659              ADD WAT88-COMM-CNVR-P-AMT   TO WS-AB-TP88-COMM-AMT

           END-EVALUATE.

       5000-ACCUM-TP88-PRINT-X.
           EXIT.
      /

      *----------------------
       6000-ACCUM-NB88-PRINT.
      *----------------------

           EVALUATE TRUE

               WHEN WAT88-COMM-TYP-COI
                    ADD +1                      TO WS-COI-REC-NB88
                    ADD WAT88-COMM-CNVR-P-AMT   TO WS-COI-CNVR-P-NB88

               WHEN WAT88-COMM-TYP-COI-REF
                    ADD +1                      TO WS-COIR-REC-NB88
                    ADD WAT88-COMM-CNVR-P-AMT   TO WS-COIR-CNVR-P-NB88

               WHEN WAT88-COMM-TYP-COI-SHRT
                    ADD +1                      TO WS-COIS-REC
                    ADD WAT88-COMM-CNVR-P-AMT   TO WS-COIS-CNVR-P

               WHEN WAT88-COMM-TYP-ASS-BASE
B00659*             ADD +1                      TO WS-AB-REC
B00659              ADD +1                      TO WS-AB-NB88-REC
B00659*             ADD WAT88-COMM-CNVR-P-AMT   TO WS-AB-COMM-AMT
B00659              ADD WAT88-COMM-CNVR-P-AMT   TO WS-AB-NB88-COMM-AMT

           END-EVALUATE.

       6000-ACCUM-NB88-PRINT-X.
           EXIT.
      /
EN9200*-------------------
EN9200 7000-CALC-PYMT-PERI.
EN9200*-------------------
EN9200
EN9200**CALCULATE THE PREMIUM PERIOD FOR UL POLICIES ONLY
EN9200     IF  RPOL-POL-INS-TYP-TRAD
EN9200         GO TO 7000-CALC-PYMT-PERI-X
EN9200     END-IF.
EN9200
EN9200     MOVE ZEROS                       TO WAT88-PREM-PMT-PERI
EN9200
EN9200     IF  RMCOM-CVG-ID NOT = ZEROS
EN9200         MOVE RMCOM-CVG-ID            TO I
EN9200     ELSE
EN9200         GO TO 7000-CALC-PYMT-PERI-X
EN9200     END-IF.
EN9200
EN9200     MOVE RPOL-POL-ID                 TO WCVG-POL-ID.
EN9200
EN9200* IN ORDER TO OPTIMIZE THE PERFORMANCE OF THE JOB EACH COVG WAS
EN9200* READ INDIVIDUALLY INSTEAD OF LOADING THE FULL WCVGS ARRAY
EN9200
EN9200     PERFORM  CVGS-1100-LOAD-COVERAGE
EN9200         THRU CVGS-1100-LOAD-COVERAGE-X.
EN9200
EN9200     PERFORM  PLIN-1000-PLAN-HEADER-IN
EN9200        THRU  PLIN-1000-PLAN-HEADER-IN-X.
EN9200
EN9200*    IF FUND RIDERS(BASE AND SA RIDER) OR PAY OUT RIDERS
EN9200*    SET THE VALUE AS SPACES
EN9200
EN9200     IF  I = RPOL-POL-BASE-CVG-NUM
EN9200     OR  WCVGS-CVG-INS-TYP-SEG-FUND (I)
EN9200     OR  WCVGS-CVG-INS-TYP-PURE-ENDOW (I)
EN9200         GO TO 7000-CALC-PYMT-PERI-X
EN9200     END-IF.
EN9200
EN9200*    IF TERM RIDER(IRRESPECTIVE OF MEDICAL OR LIFE) PASS 
EN9200*    THE DURATION OF THE RIDER(PLAN LEVEL DURATION FIELD FOR 
EN9200*    OLD TERM RIDERS AND SUB-TABLE 1 FIELD FOR LATTER ONES)
EN9200
EN9200     IF  WCVGS-CVG-PREM-CHNG-DT (I) NOT = WWKDT-ZERO-DT
EN9200         IF  WCVGS-CVG-STBL-1-CD (I) IS NUMERIC
EN9200             MOVE WCVGS-CVG-STBL-1-CD (I) TO WAT88-PREM-PMT-PERI
EN9200         ELSE
EN9200             MOVE RPH-PREM-CHNG-AGE-DUR-N TO WAT88-PREM-PMT-PERI
EN9200         END-IF
EN9200         GO TO 7000-CALC-PYMT-PERI-X
EN9200     END-IF.
EN9200
EN9200*    IF IPDD RIDERS SET THE VALUE AS EXPIRY AGE MINUS ISSUE AGE
EN9200
EN9200     IF  RPH-XPRY-DT-CALC-STBL-1-AGE
EN9200     OR  RPH-XPRY-DT-CALC-STBL-1-DUR
EN9200         COMPUTE WAT88-PREM-PMT-PERI = WCVGS-CVG-STBL-1-CD-N (I)
EN9200                                     - WCVGS-CVG-RT-AGE-N (I)
EN9200         GO TO 7000-CALC-PYMT-PERI-X
EN9200     END-IF.
EN9200
EN9200*    DEFAULT THE VALUE AS 99 AS AT THIS POINT IT SHOULD BE EITHER WL OR LP
EN9200
EN9200     SET WS-CVG-PREM-PMT-PERI-99      TO TRUE.
EN9200     MOVE WS-CVG-PREM-PMT-PERI        TO WAT88-PREM-PMT-PERI.
EN9200
EN9200     MOVE WCVGS-PLAN-ID (I)           TO WS-PLAN-ID.
EN9200     IF  WS-PLAN-01-WL 
EN9200         COMPUTE WAT88-PREM-PMT-PERI = RPH-CVG-UL-PU-AGE-DUR-N
EN9200                                     - WCVGS-CVG-RT-AGE-N (I)
EN9200         GO TO 7000-CALC-PYMT-PERI-X
EN9200     END-IF.
EN9200
EN9200*    IF LIMITED PAY RIDER SET THE VALUE AS LIMITED PAY AGE MINUS ISSUE AGE.
EN9200
M241A2*EN9200     IF  WCVGS-CVG-STBL-3-07-LP (I)
M241A2*EN9200         MOVE WCVGS-CVG-STBL-3-CD (I) TO WS-CVG-STBL-3-CD
M241A2*EN9200         COMPUTE WAT88-PREM-PMT-PERI = WS-CVG-STBL-3-CD-N
M241A2*EN9200                                     - WCVGS-CVG-RT-AGE-N (I)
M241A2*EN9200     END-IF.
EN9200
M241A2*    TO POPULATE PREMIUM PAYMENT PERIOD INVOKING NEW COPYBOOK
M241A2
M241A2     PERFORM  STB3-1000-BUILD-PARM-INFO
M241A2         THRU STB3-1000-BUILD-PARM-INFO-X.
M241A2
M241A2     MOVE WCVGS-CVG-STBL-3-CD (I)     TO LSTB3-CVG-STBL-3-CD.
M241A2     MOVE WCVGS-CVG-RT-AGE-N (I)      TO LSTB3-CVG-RT-AGE.
M241A2     MOVE WCVGS-PLAN-ID (I)           TO LSTB3-PLAN-ID.
M241A2
M241A2     PERFORM  STB3-3000-GET-PREM-PMT-DUR
M241A2         THRU STB3-3000-GET-PREM-PMT-DUR-X.
M241A2
M241A2     IF  LSTB3-CVG-STB3-LP-AGE 
M241A2         MOVE LSTB3-PREM-PMT-PERI     TO WAT88-PREM-PMT-PERI
M241A2     END-IF.
M241A2
EN9200 7000-CALC-PYMT-PERI-X.
EN9200     EXIT.
EN9200/
      *--------------------
       8000-PRINT-HEADINGS.
      *--------------------

      *
      * GET THE REPORT TITLE IF NEW PAGE
      *
           MOVE ZERO                    TO WS-LINE-CNT.
           ADD  +1                      TO WS-PAGE-NUM.
           MOVE WS-PAGE-NUM             TO WHDG-PAGE.

           MOVE WHDG-LINE-1             TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-2000-WRITE
               THRU PRT1-2000-WRITE-X.

           MOVE WHDG-LINE-2             TO RPRT1-SEQ-REC-INFO.
           MOVE +2                      TO WPRT1-NUMBER-LINES.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           MOVE SPACES                  TO RPRT1-SEQ-REC-INFO.
           MOVE +1                      TO WPRT1-NUMBER-LINES.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           PERFORM  2490-1000-BUILD-PARM-INFO
               THRU 2490-1000-BUILD-PARM-INFO-X.

           MOVE +3                      TO WS-LINE-CNT.

       8000-PRINT-HEADINGS-X.
           EXIT.
      /

      *------------------
       8500-PRINT-DETAIL.
      *------------------

           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           PERFORM  2490-1000-BUILD-PARM-INFO
               THRU 2490-1000-BUILD-PARM-INFO-X.

      * PRINT COI TOTAL

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00002'                   TO L2490-TXT-SRC-REF-ID.

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00007'                   TO L2490-TXT-SRC-REF-ID.
           MOVE WS-COI-REC-TP88           TO WS-PIC-COUNTER.
           MOVE WS-PIC-COUNTER            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00008'                   TO L2490-TXT-SRC-REF-ID.
           MOVE WS-COI-CNVR-P-TP88        TO WS-PIC-DECIMAL.
           MOVE WS-PIC-DECIMAL            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00009'                   TO L2490-TXT-SRC-REF-ID.
           MOVE WS-COI-REC-NB88           TO WS-PIC-COUNTER.
           MOVE WS-PIC-COUNTER            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00010'                   TO L2490-TXT-SRC-REF-ID.
           MOVE WS-COI-CNVR-P-NB88        TO WS-PIC-DECIMAL.
           MOVE WS-PIC-DECIMAL            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

FEID06     MOVE 'CSBM9390'                  TO L2490-TXT-SRC-ID.
FEID06     MOVE WGLOB-USER-LANG             TO L2490-TXT-LANG-CD.
FEID06     MOVE '00018'                     TO L2490-TXT-SRC-REF-ID.
FEID06     MOVE WS-COI-REC-AC88             TO WS-PIC-COUNTER.
FEID06     MOVE WS-PIC-COUNTER              TO L2490-TXT-PARM (1).
FEID06
FEID06     PERFORM  2490-1000-RETRIEVE-TEXT
FEID06         THRU 2490-1000-RETRIEVE-TEXT-X.
FEID06
FEID06     MOVE L2490-TXT-STR-TXT           TO WS-REPORT-DET-LINE.
FEID06
FEID06     MOVE WS-REPORT-DET-LINE          TO RPRT1-SEQ-REC-INFO.
FEID06     MOVE +1                          TO WPRT1-NUMBER-LINES.
FEID06
FEID06     PERFORM  PRT1-1000-WRITE
FEID06         THRU PRT1-1000-WRITE-X.
FEID06
FEID06     ADD +1                           TO WS-LINE-CNT.
FEID06     MOVE SPACES                      TO WS-REPORT-DET-LINE.
FEID06
FEID06     MOVE 'CSBM9390'                  TO L2490-TXT-SRC-ID.
FEID06     MOVE WGLOB-USER-LANG             TO L2490-TXT-LANG-CD.
FEID06     MOVE '00019'                     TO L2490-TXT-SRC-REF-ID.
FEID06     MOVE WS-COI-CNVR-P-AC88          TO WS-PIC-DECIMAL.
FEID06     MOVE WS-PIC-DECIMAL              TO L2490-TXT-PARM (1).
FEID06
FEID06     PERFORM  2490-1000-RETRIEVE-TEXT
FEID06         THRU 2490-1000-RETRIEVE-TEXT-X.
FEID06
FEID06     MOVE L2490-TXT-STR-TXT           TO WS-REPORT-DET-LINE.
FEID06
FEID06     MOVE WS-REPORT-DET-LINE          TO RPRT1-SEQ-REC-INFO.
FEID06     MOVE +1                          TO WPRT1-NUMBER-LINES.
FEID06
FEID06     PERFORM  PRT1-1000-WRITE
FEID06         THRU PRT1-1000-WRITE-X.
FEID06
FEID06     ADD +1                           TO WS-LINE-CNT.
FEID06     MOVE SPACES                      TO WS-REPORT-DET-LINE.
      * PRINT COI REFERRAL TOTAL

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00003'                   TO L2490-TXT-SRC-REF-ID.

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00007'                   TO L2490-TXT-SRC-REF-ID.
           MOVE WS-COIR-REC-TP88          TO WS-PIC-COUNTER.
           MOVE WS-PIC-COUNTER            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00008'                   TO L2490-TXT-SRC-REF-ID.
           MOVE WS-COIR-CNVR-P-TP88       TO WS-PIC-DECIMAL.
           MOVE WS-PIC-DECIMAL            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00009'                   TO L2490-TXT-SRC-REF-ID.
           MOVE WS-COIR-REC-NB88          TO WS-PIC-COUNTER.
           MOVE WS-PIC-COUNTER            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00010'                   TO L2490-TXT-SRC-REF-ID.
           MOVE WS-COIR-CNVR-P-NB88       TO WS-PIC-DECIMAL.
           MOVE WS-PIC-DECIMAL            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.
FEID06
FEID06     MOVE 'CSBM9390'                  TO L2490-TXT-SRC-ID.
FEID06     MOVE WGLOB-USER-LANG             TO L2490-TXT-LANG-CD.
FEID06     MOVE '00018'                     TO L2490-TXT-SRC-REF-ID.
FEID06     MOVE WS-COIR-REC-AC88            TO WS-PIC-COUNTER.
FEID06     MOVE WS-PIC-COUNTER              TO L2490-TXT-PARM (1).
FEID06
FEID06     PERFORM  2490-1000-RETRIEVE-TEXT
FEID06         THRU 2490-1000-RETRIEVE-TEXT-X.
FEID06
FEID06     MOVE L2490-TXT-STR-TXT           TO WS-REPORT-DET-LINE.
FEID06
FEID06     MOVE WS-REPORT-DET-LINE          TO RPRT1-SEQ-REC-INFO.
FEID06     MOVE +1                          TO WPRT1-NUMBER-LINES.
FEID06
FEID06     PERFORM  PRT1-1000-WRITE
FEID06         THRU PRT1-1000-WRITE-X.
FEID06
FEID06     ADD +1                           TO WS-LINE-CNT.
FEID06     MOVE SPACES                      TO WS-REPORT-DET-LINE.
FEID06
FEID06     MOVE 'CSBM9390'                  TO L2490-TXT-SRC-ID.
FEID06     MOVE WGLOB-USER-LANG             TO L2490-TXT-LANG-CD.
FEID06     MOVE '00019'                     TO L2490-TXT-SRC-REF-ID.
FEID06     MOVE WS-COIR-CNVR-P-AC88         TO WS-PIC-DECIMAL.
FEID06     MOVE WS-PIC-DECIMAL              TO L2490-TXT-PARM (1).
FEID06
FEID06     PERFORM  2490-1000-RETRIEVE-TEXT
FEID06         THRU 2490-1000-RETRIEVE-TEXT-X.
FEID06
FEID06     MOVE L2490-TXT-STR-TXT           TO WS-REPORT-DET-LINE.
FEID06
FEID06     MOVE WS-REPORT-DET-LINE          TO RPRT1-SEQ-REC-INFO.
FEID06     MOVE +1                          TO WPRT1-NUMBER-LINES.
FEID06
FEID06     PERFORM  PRT1-1000-WRITE
FEID06         THRU PRT1-1000-WRITE-X.
FEID06
FEID06     ADD +1                           TO WS-LINE-CNT.
FEID06     MOVE SPACES                      TO WS-REPORT-DET-LINE.

      * PRINT COI FUND SHORTAGE TOTAL

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00004'                   TO L2490-TXT-SRC-REF-ID.

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00011'                   TO L2490-TXT-SRC-REF-ID.
           MOVE WS-COIS-REC               TO WS-PIC-COUNTER.
           MOVE WS-PIC-COUNTER            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00012'                   TO L2490-TXT-SRC-REF-ID.
           MOVE WS-COIS-CNVR-P            TO WS-PIC-DECIMAL.
           MOVE WS-PIC-DECIMAL            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.


      * PRINT ASSET BASE TOTAL

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00005'                   TO L2490-TXT-SRC-REF-ID.

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00013'                   TO L2490-TXT-SRC-REF-ID.
B00659*    MOVE WS-AB-REC                 TO WS-PIC-COUNTER.
B00659     MOVE WS-AB-TP88-REC            TO WS-PIC-COUNTER.
           MOVE WS-PIC-COUNTER            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

           MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
           MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
           MOVE '00014'                   TO L2490-TXT-SRC-REF-ID.
B00659*    MOVE WS-AB-COMM-AMT            TO WS-PIC-DECIMAL.
B00659     MOVE WS-AB-TP88-COMM-AMT       TO WS-PIC-DECIMAL.
           MOVE WS-PIC-DECIMAL            TO L2490-TXT-PARM (1).

           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

           MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

           MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
           MOVE +1                        TO WPRT1-NUMBER-LINES.

           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           ADD +1                         TO WS-LINE-CNT.
           MOVE SPACES                    TO WS-REPORT-DET-LINE.

B00659     MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
B00659     MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
B00659     MOVE '00016'                   TO L2490-TXT-SRC-REF-ID.
B00659     MOVE WS-AB-NB88-REC            TO WS-PIC-COUNTER.
B00659     MOVE WS-PIC-COUNTER            TO L2490-TXT-PARM (1).

B00659     PERFORM  2490-1000-RETRIEVE-TEXT
B00659         THRU 2490-1000-RETRIEVE-TEXT-X.

B00659     MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

B00659     MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
B00659     MOVE +1                        TO WPRT1-NUMBER-LINES.

B00659     PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

B00659     ADD +1                         TO WS-LINE-CNT.
B00659     MOVE SPACES                    TO WS-REPORT-DET-LINE.

B00659     MOVE 'CSBM9390'                TO L2490-TXT-SRC-ID.
B00659     MOVE WGLOB-USER-LANG           TO L2490-TXT-LANG-CD.
B00659     MOVE '00017'                   TO L2490-TXT-SRC-REF-ID.
B00659     MOVE WS-AB-NB88-COMM-AMT       TO WS-PIC-DECIMAL.
B00659     MOVE WS-PIC-DECIMAL            TO L2490-TXT-PARM (1).

B00659     PERFORM  2490-1000-RETRIEVE-TEXT
B00659         THRU 2490-1000-RETRIEVE-TEXT-X.

B00659     MOVE L2490-TXT-STR-TXT         TO WS-REPORT-DET-LINE.

B00659     MOVE WS-REPORT-DET-LINE        TO RPRT1-SEQ-REC-INFO.
B00659     MOVE +1                        TO WPRT1-NUMBER-LINES.

B00659     PERFORM  PRT1-1000-WRITE
B00659         THRU PRT1-1000-WRITE-X.

B00659     ADD +1                         TO WS-LINE-CNT.
B00659     MOVE SPACES                    TO WS-REPORT-DET-LINE.

FEID06     MOVE 'CSBM9390'                  TO L2490-TXT-SRC-ID.
FEID06     MOVE WGLOB-USER-LANG             TO L2490-TXT-LANG-CD.
FEID06     MOVE '00020'                     TO L2490-TXT-SRC-REF-ID.
FEID06     MOVE WS-AB-AC88-REC              TO WS-PIC-COUNTER.
FEID06     MOVE WS-PIC-COUNTER              TO L2490-TXT-PARM (1).
FEID06
FEID06     PERFORM  2490-1000-RETRIEVE-TEXT
FEID06         THRU 2490-1000-RETRIEVE-TEXT-X.
FEID06
FEID06     MOVE L2490-TXT-STR-TXT           TO WS-REPORT-DET-LINE.
FEID06
FEID06     MOVE WS-REPORT-DET-LINE          TO RPRT1-SEQ-REC-INFO.
FEID06     MOVE +1                          TO WPRT1-NUMBER-LINES.
FEID06
FEID06     PERFORM  PRT1-1000-WRITE
FEID06         THRU PRT1-1000-WRITE-X.
FEID06
FEID06     ADD +1                           TO WS-LINE-CNT.
FEID06     MOVE SPACES                      TO WS-REPORT-DET-LINE.
FEID06
FEID06     MOVE 'CSBM9390'                  TO L2490-TXT-SRC-ID.
FEID06     MOVE WGLOB-USER-LANG             TO L2490-TXT-LANG-CD.
FEID06     MOVE '00021'                     TO L2490-TXT-SRC-REF-ID.
FEID06     MOVE WS-AB-AC88-COMM-AMT         TO WS-PIC-DECIMAL.
FEID06     MOVE WS-PIC-DECIMAL              TO L2490-TXT-PARM (1).
FEID06
FEID06     PERFORM  2490-1000-RETRIEVE-TEXT
FEID06         THRU 2490-1000-RETRIEVE-TEXT-X.
FEID06
FEID06     MOVE L2490-TXT-STR-TXT           TO WS-REPORT-DET-LINE.
FEID06
FEID06     MOVE WS-REPORT-DET-LINE          TO RPRT1-SEQ-REC-INFO.
FEID06     MOVE +1                          TO WPRT1-NUMBER-LINES.
FEID06
FEID06     PERFORM  PRT1-1000-WRITE
FEID06         THRU PRT1-1000-WRITE-X.
FEID06
FEID06     ADD +1                           TO WS-LINE-CNT.
FEID06     MOVE SPACES                      TO WS-REPORT-DET-LINE.

       8500-PRINT-DETAIL-X.
           EXIT.
      /

B00549*-------------------
B00549 8700-PRINT-WARNING.
B00549*-------------------

B00549* MSG:'COMMISSION RECORD NOT WRITTEN. ONE OR MORE OF THE'
B00549*     'FOLLOWING FIELDS NOT NUMERIC:'
           MOVE 'CS93900006'            TO WGLOB-MSG-REF-INFO.

B00549     PERFORM  0260-2000-GET-MESSAGE
B00549         THRU 0260-2000-GET-MESSAGE-X.

B00549     MOVE WGLOB-MSG-TXT           TO L0040-INPUT-LINE.

B00549     PERFORM  0040-3000-WRITE-OTHER
B00549         THRU 0040-3000-WRITE-OTHER-X.

B00549     MOVE SPACES                  TO L0040-INPUT-LINE.

B00549* MSG:POLICY ID: @1, AGENT ID: @2, BRANCH ID: @3,
B00596*     SALES OFFICE: @4
B00549     MOVE 'CS93900007'            TO WGLOB-MSG-REF-INFO.
B00549     MOVE WAT88-POL-ID            TO WGLOB-MSG-PARM (1).
B00549     MOVE WAT88-AGT-ID            TO WGLOB-MSG-PARM (2).
B00549     MOVE WAT88-BR-ID             TO WGLOB-MSG-PARM (3).
B00549     MOVE WAT88-SO-ID             TO WGLOB-MSG-PARM (4).

B00549     PERFORM  0260-2000-GET-MESSAGE
B00549         THRU 0260-2000-GET-MESSAGE-X.

B00549     MOVE WGLOB-MSG-TXT           TO L0040-INPUT-LINE.

B00549     PERFORM  0040-3000-WRITE-OTHER
B00549         THRU 0040-3000-WRITE-OTHER-X.

B00549     MOVE SPACES                  TO L0040-INPUT-LINE.

B00596* MSG: FROM THE FOLLOWING RECORD
B00596     MOVE 'CS93900008'            TO WGLOB-MSG-REF-INFO.

B00596     PERFORM  0260-2000-GET-MESSAGE
B00596         THRU 0260-2000-GET-MESSAGE-X.

B00596     MOVE WGLOB-MSG-TXT           TO L0040-INPUT-LINE.

B00596     PERFORM  0040-3000-WRITE-OTHER
B00596         THRU 0040-3000-WRITE-OTHER-X.

B00596     MOVE SPACES                  TO L0040-INPUT-LINE.
B00596     MOVE WAT88-REC-INFO          TO L0040-INPUT-LINE.

B00596     PERFORM  0040-3000-WRITE-OTHER
B00596         THRU 0040-3000-WRITE-OTHER-X.

B00596     MOVE SPACES                  TO L0040-INPUT-LINE.

B00596     PERFORM  0040-3000-WRITE-OTHER
B00596         THRU 0040-3000-WRITE-OTHER-X.

B00596 8700-PRINT-WARNING-X.
B00596     EXIT.
      /

      *-----------------
       9000-PRINT-STATS.
      *-----------------

           PERFORM  8500-PRINT-DETAIL
               THRU 8500-PRINT-DETAIL-X.

           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.

           MOVE SPACES                  TO L0040-INPUT-LINE.

      * MSG:TOTAL NUMBER OF MTD COMMISSION (TP88) RECORDS READ'
           MOVE 'CS93900003'            TO WGLOB-MSG-REF-INFO.
           MOVE WS-TP88-RECORDS-READ    TO WS-PIC-COUNTER.
           MOVE WS-PIC-COUNTER          TO WGLOB-MSG-PARM (1).

           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.

           MOVE WGLOB-MSG-TXT           TO L0040-INPUT-LINE.

           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.

           MOVE SPACES                  TO L0040-INPUT-LINE.

      * MSG:TOTAL NUMBER OF NB MTD COMMISSION (NB88) RECORDS READ'
           MOVE 'CS93900004'            TO WGLOB-MSG-REF-INFO.
           MOVE WS-NB88-RECORDS-READ    TO WS-PIC-COUNTER.
           MOVE WS-PIC-COUNTER          TO WGLOB-MSG-PARM (1).

           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.

           MOVE WGLOB-MSG-TXT           TO L0040-INPUT-LINE.

           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.

           MOVE SPACES                  TO L0040-INPUT-LINE.
FEID06
FEID06* MSG:TOTAL NUMBER OF AC MTD COMMISSION (AC88) RECORDS READ'
FEID06     MOVE 'CS93900014'                TO WGLOB-MSG-REF-INFO.
FEID06     MOVE WS-AC88-RECORDS-READ        TO WS-PIC-COUNTER.
FEID06     MOVE WS-PIC-COUNTER              TO WGLOB-MSG-PARM (1).
FEID06
FEID06     PERFORM  0260-2000-GET-MESSAGE
FEID06         THRU 0260-2000-GET-MESSAGE-X.
FEID06
FEID06     MOVE WGLOB-MSG-TXT               TO L0040-INPUT-LINE.
FEID06
FEID06     PERFORM  0040-3000-WRITE-OTHER
FEID06         THRU 0040-3000-WRITE-OTHER-X.
FEID06
FEID06     MOVE SPACES                      TO L0040-INPUT-LINE.

1CCP01* MSG:TOTAL NUMBER OF PRE-CONVERSION RECORDS WRITTEN'
1CCP01     MOVE 'CS93900011'            TO WGLOB-MSG-REF-INFO.
1CCP01     MOVE WS-MCOM-PRE-CNVR-RECS   TO WS-PIC-COUNTER.
1CCP01     MOVE WS-PIC-COUNTER          TO WGLOB-MSG-PARM (1).
1CCP01
1CCP01     PERFORM  0260-2000-GET-MESSAGE
1CCP01         THRU 0260-2000-GET-MESSAGE-X.
1CCP01
1CCP01     MOVE WGLOB-MSG-TXT           TO L0040-INPUT-LINE.
1CCP01
1CCP01     PERFORM  0040-3000-WRITE-OTHER
1CCP01         THRU 0040-3000-WRITE-OTHER-X.
1CCP01
1CCP01     MOVE SPACES                  TO L0040-INPUT-LINE.

      * MSG:TOTAL NUMBER OF MCL COMMISSION (MCOM) RECORDS WRITE'
           MOVE 'CS93900005'            TO WGLOB-MSG-REF-INFO.
           MOVE WS-MCOM-RECORDS-WRITE   TO WS-PIC-COUNTER.
           MOVE WS-PIC-COUNTER          TO WGLOB-MSG-PARM (1).

           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.

           MOVE WGLOB-MSG-TXT           TO L0040-INPUT-LINE.

           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.

           MOVE SPACES                  TO L0040-INPUT-LINE.

       9000-PRINT-STATS-X.
           EXIT.
      /


      *-----------------
       9999-CLOSE-FILES.
      *-----------------

           PERFORM  BCF-4000-CLOSE
               THRU BCF-4000-CLOSE-X.

           PERFORM  TP88-4000-CLOSE
               THRU TP88-4000-CLOSE-X.

           PERFORM  NB88-4000-CLOSE
               THRU NB88-4000-CLOSE-X.

FEID06    PERFORM  AC88-4000-CLOSE
FEID06        THRU AC88-4000-CLOSE-X.
FEID06
           PERFORM  MCOM-4000-CLOSE
               THRU MCOM-4000-CLOSE-X.

           PERFORM  PRT1-4000-CLOSE
               THRU PRT1-4000-CLOSE-X.

           PERFORM  OCF-4000-CLOSE
               THRU OCF-4000-CLOSE-X.

       9999-CLOSE-FILES-X.
           EXIT.

P02229 COPY XCPL0035.

1CCP01 COPY CCPSPGA.
      /
1CCP01 COPY NCPPCVGS.
      /
       COPY XCPPHDG.
       COPY XCPPTIME.
      /
       COPY CCPS0950.
      /
1CCP01 COPY CCPL2435.
1CCP01 COPY CCPS2435.
      /
1CCP01 COPY CCPL9396.
1CCP01 COPY CCPS9396.
      /
       COPY CCPS0010.
       COPY CCPL0010.
      /
       COPY XCPL0260.
B10203 COPY XCPL0015.
       COPY XCPL0040.
B00468 COPY XCPL0280.
1CCP01 COPY XCPL0289.
       COPY XCPL1640.
MP0010 COPY XCPL1680.
       COPY XCPS2490.
       COPY XCPL2490.
      /
1CCP01 COPY CCPNCVG.
      /
1CCP01 COPY CCPNPOL.
      /
1CCP01 COPY CCPBPOLX.
      /
       COPY CCPNPH.
      / 
       COPY XCPLOCF.
       COPY XCPOOCF.
       COPY XCPOBCF.
      /
       COPY XCPLBCF.
       COPY XCPNBCF.
      /
       COPY CCPLTP88.
       COPY CCPNTP88.
       COPY CCPOTP88.
      /
       COPY CCPLNB88.
       COPY CCPNNB88.
       COPY CCPONB88.
      /
FEID06 COPY XCSLFILE REPLACING ==:ID:==  BY AC88
FEID06                         ==':PGM:'== BY =='CSRQAC88'==.
FEID06 COPY XCSNSEQ  REPLACING ==:ID:==  BY AC88.
FEID06 COPY XCSOFILE REPLACING ==:ID:==  BY AC88.
FEID06/
       COPY CCPAMCOM.
       COPY CCPLMCOM.
       COPY CCPOMCOM.
      /
       COPY CCPIPRT1.
       COPY CCPPCCC.
EN9200 COPY CCPPPLIN.
       COPY CCPL0950.
       COPY XCPL0030.
M241A2 COPY CCPLSTB3.
M241A2 COPY CCPSSTB3.

      *****************************************************************
      **                 END OF PROGRAM ZSBM9390                     **
      *****************************************************************
