      *************************
       IDENTIFICATION DIVISION.
      *************************

       PROGRAM-ID. ZSBM9176.

       COPY XCWWCRHT.

      *****************************************************************
      **  MEMBER :  ZSBM9176                                         **
      **  REMARKS:  INGENIUM LINC UPLOAD PROGRAM FOR DATA MIGRATION  **
      **            THIS PROGRAM IS CLONEOF NSBM9076 PROGRAM FOR     **
      **            LINC DATA INFORMATION UPDATE ON LINC TABLE FOR   **
      **               - REGISTRATION ID                             **
      **               - REGISTRATION DATE                           **
      **            THE FOLLOWING REPORTS ARE PRODUCED:              **
      **               - OCF REPORT OF STATISTICS                    **
      **               - ERROR REPORT FOR FAILED UPDATES             **
      **  DOMAIN : UW                                                **
      **  CLASS  : PD                                                **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
P00170**  01AUG01  EKM    CREATION OF PROGRAM FOR PHASE 2 SPEC SNB05A**
P00232**  11DEC01  EKM    ADD NEW REQT MATCHING ROUTINE.             **
HNB303**  08DEC02  HIN/EC COMPLEX TEST REQUIRING UNISYS DATA         **
HNB303**                  ALTER REQUIREMENT STATUS TO REVIEWED &     **
HNB303**                  ACCEPTED (PREVIOUSLY RECEIVED)             **
HNB403**  09DEC02  HIN/EC LINC UPLOAD CHANGES                        **
HNB403**                  UPATE LINC RECORD WITH A TALLY OF          **
HNB403**                  HOSPITALIZATION & DEATH BENEFIT AMOUNTS    **
HNB403**                  ORIGINATING FROM ANY NON-MANULIFE BUSINESS **
HNB403**                  THAT A CLIENT IN MANUFLEX MAY HAVE.        **
HIS078**  20DEC02  HIN/EC INITIATE CLEAR CASE                        **
HIS085**  03JAN03  HIN/EC ALLOW LINC UPDATE TO PROCEED EVEN IF LINC  **
HIS085**                  DETAILS HAVE BEEN PREVIOUSLY RECORDED      **
HIS106**  09JAN03  HIN/AI FIX OCF TOTALS AND HANDLING OF EMPTY FILES **
B10934**  13FEB03  HIN/AI CHANGES FOR AUTO SETTLE                    **
B10903**  24FEB03  HIN/AI CHANGE TO CLEAR CASE EACH CLIENT AS        **
B10903**                  REQUIREMENT IS RECEIVED                    **
P02229**  20OCT04  CY     ADD COMMIT LOGIC TO MAINLINES              **
MFFFU4**  27MAY05  ACR    UW CHANGES FOR FUNDS PROJECT               **
MP55AI**  09SEP08  CTS    CHANGE FOR NEW LEVELS OF UNDER WRITTING    **
M119NB**  10NOV09  CTS    PROCESS LINC EXTRACT FOR THE NEW LINC TABLE**
M119NB**                  LAYOUT				     **
M119DM**  10FEB10  CTS    UPLOAD TLINC TABLE WITH REG. DETAILS	     **
27676C**  24OCT23  CTS    LINC RECORD CREATION REQUIREMENT CHANGES   **
      *****************************************************************

      /
      **********************
       ENVIRONMENT DIVISION.
      **********************

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

       COPY NCSSPRT1.

      /
      ***************
       DATA DIVISION.
      ***************

       FILE SECTION.

       COPY NCSDPRT1.
       COPY NCSRPRT1.

      /
      *************************
       WORKING-STORAGE SECTION.
      *************************

       COPY XCWWPGWS REPLACING '$VAR1' BY 'ZSBM9176'.

       COPY SQLCA.

       01  WORK-AREA.
HNB403     03  WS-TOT-REC-CNTR-IN         PIC S9(9)    VALUE +0.
HNB403*    03  WS-REC-CNTR-OUT            PIC S9(9)    VALUE +0.
HNB403     03  WS-REC-CNTR-MLJ-IN         PIC S9(9)    VALUE +0.
HNB403     03  WS-REC-CNTR-MLJ-OUT        PIC S9(9)    VALUE +0.
HNB403     03  WS-REC-CNTR-NON-MLJ-OUT    PIC S9(9)    VALUE +0.
HIS106     03  WS-REC-CNTR-NON-MLJ-IN     PIC S9(9)    VALUE +0.
HIS106     03  WS-TEMP-MLJ-REC-CNT        PIC S9(9)    VALUE +0.
HIS106     03  WS-TEMP-NON-MLJ-REC-CNT    PIC S9(9)    VALUE +0.
           03  WS-MAX-LINE-CNTR           PIC S9(4)    VALUE +50.
           03  WS-TXT-SRC-REF-ID          PIC X(05)    VALUE SPACES.
           03  WS-COMPANY-NAME            PIC X(50).
           03  WS-RUN-IND                 PIC X(01)    VALUE 'Y'.
               88  WS-RUN-START                        VALUE 'Y'.
               88  WS-RUN-STOP                         VALUE 'N'.
           03  WS-EDIT-ERROR-IND          PIC X(01)    VALUE 'N'.
               88  WS-EDIT-ERROR                       VALUE 'Y'.
               88  WS-EDIT-ERROR-NO                    VALUE 'N'.
HNB403     03  WS-EDIT-WARNING-IND          PIC X(01)  VALUE 'N'.
HNB403         88  WS-EDIT-WARNING                     VALUE 'Y'.
HNB403         88  WS-EDIT-WARNING-NO                  VALUE 'N'.
           03  WS-MSG-REF-INFO.
               10  WS-MSG-REF-ID          PIC X(06).
               10  WS-MSG-REF-NUM         PIC X(04).
           03  WS-LINC-EXISTS-IND         PIC X(01)    VALUE 'N'.
               88  WS-LINC-EXISTS                      VALUE 'Y'.
               88  WS-LINC-EXISTS-NO                   VALUE 'N'.
HIS106     03  WS-FIRST-READ-SW           PIC X(01).
HIS106         88  WS-FIRST-READ-YES                   VALUE 'Y'.
HIS106         88  WS-FIRST-READ-NO                    VALUE 'N'.
               
HNB403     03  WS-LINC-EFF-DT             PIC X(10)    VALUE SPACES.

HNB403     03  WS-LINC-DISEASE-HOSP-BNFT-AMT PIC S9(07)V9(02) COMP-3.
HNB403     03  WS-LINC-NRML-DEATH-FACE-AMT   PIC S9(11)V9(02) COMP-3.

HNB403     03  WS-BYPASS-POL-IND          PIC X(01)    VALUE 'N'.
HNB403         88  WS-BYPASS-POL-YES                   VALUE 'Y'.
HNB403         88  WS-BYPASS-POL-NO                    VALUE 'N'.
27676C     03  WS-LINC-AD-BNFT-AMT        PIC S9(07)V9(02) COMP-3.
27676C     03  WS-LINC-TOT-AD-BNFT-AMT    PIC S9(07)V9(02) COMP-3.
27676C     03  WS-LINC-IP-BNFT-AMT        PIC S9(07)V9(02) COMP-3.
27676C     03  WS-LINC-CNCR-BNFT-AMT      PIC S9(07)V9(02) COMP-3.
27676C     03  WS-LINC-HOSP-BNFT-AMT      PIC S9(07)V9(02) COMP-3.
27676C     03  WS-LINC-MEDIC-BNFT-QTY     PIC 99.

HNB403     03  WS-HOLD-DATA.
HNB403         05  WS-HOLD-POL-ID         PIC X(07).
HNB403         05  WS-HOLD-CLI-ID         PIC X(10).
HNB403         05  WS-HOLD-LINC-REG-ID    PIC X(12).
HNB403         05  WS-HOLD-LINC-REG-DT    PIC X(10).
HNB403         05  WS-HOLD-TOT-HOSP-AMT   PIC S9(07)V9(02) COMP-3.
HNB403         05  WS-HOLD-TOT-DB-AMT     PIC S9(11)V9(02) COMP-3.
M119NB         05  WS-AGGR-FACE-AMT-IND   PIC X(01).
27676C         05  WS-HOLD-AD-BNFT-AMT    PIC S9(07)V9(02) COMP-3.
27676C         05  WS-HOLD-IP-BNFT-AMT    PIC S9(07)V9(02) COMP-3.
27676C         05  WS-HOLD-CNCR-BNFT-AMT  PIC S9(07)V9(02) COMP-3.
27676C         05  WS-HOLD-HOSP-BNFT-AMT  PIC S9(07)V9(02) COMP-3.
27676C         05  WS-HOLD-MEDIC-BNFT-QTY PIC 99.

       COPY NCSWPRT1.

      **** STANDARD HEADING LAYOUT 1ST 2 LINES ****

       COPY XCWWHDG.

      *
      * PRT1 WORKING STORAGE VARIABLES & PRINT LINES
      *
       01  WS-PRT1-VARIABLES.
           03  WS-PRT1-PAGE-CNTR          PIC S9(4)   VALUE +0.
           03  WS-PRT1-LINE-CNTR          PIC S9(4).
           03  WS-PRT1-ERROR-CNTR         PIC S9(9)   VALUE +0.
           03  WS-PRT1-ERR-TYP-CD         PIC X(04)   VALUE SPACES.
               88  WS-PRT1-ERR-TYP-REG-ID-SPACES      VALUE '0001'.
               88  WS-PRT1-ERR-TYP-REG-ID-NUM         VALUE '0002'.
               88  WS-PRT1-ERR-TYP-REG-DT-SPACES      VALUE '0003'.
               88  WS-PRT1-ERR-TYP-REG-DT-INVALID     VALUE '0004'.
               88  WS-PRT1-ERR-TYP-INFO-EXISTS        VALUE '0005'.
               88  WS-PRT1-ERR-TYP-PCC-INVALID        VALUE '0008'.
HNB403         88  WS-PRT1-ERR-TYP-AMT-INVALID        VALUE '9700'.
HNB403         88  WS-PRT1-ERR-TYP-NO-MLJ-REC         VALUE '9701'.
HIS106         88  WS-PRT1-ERR-TYP-POL-BYPASS         VALUE '9706'.               
                   
       01  WS-PRT1-HEADING-1              PIC X(132).
       01  WS-PRT1-HEADING-2              PIC X(132).

       01  WS-PRT1-REPORT-TITLE.
           03  WS-PRT1-REPORT-TITLE-1     PIC X(150).

       01  WS-PRT1-DETAIL-LINE            PIC X(132).

       01  WS-PRT1-DETAIL-LINE-1  REDEFINES WS-PRT1-DETAIL-LINE.
           03  FILLER                     PIC X(01).
           03  WS-PRT1-DL1-CLI-ID         PIC X(10).
           03  FILLER                     PIC X(09).
           03  WS-PRT1-DL1-POL-ID         PIC X(10).
           03  FILLER                     PIC X(09).
           03  WS-PRT1-DL1-REG-NUM        PIC X(12).
           03  FILLER                     PIC X(10).
           03  WS-PRT1-DL1-PRCES-DT       PIC X(08).
           03  FILLER                     PIC X(10).
           03  WS-PRT1-DL1-ERROR-TEXT     PIC X(53).

       01  WS-PRT1-DETAIL-FOOT-1  REDEFINES WS-PRT1-DETAIL-LINE.
           03  FILLER                     PIC X(01).
           03  WS-PRT1-DF1-TOTAL-TEXT     PIC X(26).
           03  WS-PRT1-DF1-TOTAL-X        PIC X(20).
           03  FILLER                     PIC X(85).

      * OCF FOOTINGS

       01  WS-OCF-TOTAL-LINE.
           03  FILLER                     PIC X(01).
HIS106*           03  WS-OCF-TOTAL-TEXT          PIC X(26).
HIS106     03  WS-OCF-TOTAL-TEXT          PIC X(40).
           03  WS-OCF-TOTAL-CNTR          PIC X(20).
HIS106*           03  FILLER                     PIC X(85).
HIS106     03  FILLER                     PIC X(71).
      /
      *****************************************************************
      *    COMMON COPYBOOKS                                           *
      *****************************************************************
       COPY XCWWWKDT.
      /
       COPY CCWWCCC.
      /
       COPY CCWWINDX.
      /
       COPY XCWWTIME.
      /
       COPY XCWTFCMD.
      /
       COPY XCWLDTLK.
      /
      *****************************************************************
      *    I/O COPYBOOKS                                              *
      *****************************************************************
      /
M119DM*COPY NCSWLNCI.
M119DM*COPY NCSRLNCI.
       COPY NCSRLNCX.
M119DM/
M119DM COPY ZCSR9176.
M119DM COPY XCSWSEQ  REPLACING ==:ID:==    BY    9176
M119DM                         ==':ID:'==  BY =='9176'==.
      /
       COPY CCFWCCLI.
       COPY CCFRCVGC.
      /
       COPY NCFWLINC.
       COPY NCFRLINC.
      /
       COPY XCSWOCF.
       COPY XCSROCF.
      /
       COPY XCSWBCF.
       COPY XCSRBCF.
HNB403/ 
HNB403 COPY CCFWMAST.
HNB403 COPY CCFRMAST.

HIS078 COPY NCFWCLUA.
HIS078 COPY NCFRCLIU.
HIS078 COPY CCFRPOL.

      /
      *****************************************************************
      *    CALLED MODULE PARAMETER INFORMATION                        *
      *****************************************************************
P02229 COPY XCWL0035.

       COPY CCWL0010.
       COPY NCWL0080.
       COPY CCWL0620.
       COPY CCWL0950.

       COPY XCWL0040.
       COPY XCWL0270.
HNB403 COPY XCWL0280.
       COPY XCWL1640.
HNB403 COPY XCWL1670.
HNB403 COPY XCWL1680.
       COPY XCWL2490.
HIS078 COPY NCWL9316.
HIS078 COPY NCWW9316.
       COPY CCWLPGA.

       01  WGLOB-GLOBAL-AREA.
       COPY XCWWGLOB.
      /
      ********************
       PROCEDURE DIVISION.
      ********************

      *--------------
       0000-MAINLINE.
      *--------------

           PERFORM  0100-OPEN-FILES
               THRU 0100-OPEN-FILES-X.

           PERFORM  2000-INITIALIZE
               THRU 2000-INITIALIZE-X.

           PERFORM  3000-PROCESS-TRANSACTION
               THRU 3000-PROCESS-TRANSACTION-X
M119DM*        UNTIL WLNCI-SEQ-IO-EOF
M119DM         UNTIL W9176-SEQ-IO-EOF
                 OR WS-RUN-STOP.
                 
           PERFORM  9000-WRITE-FOOTINGS
               THRU 9000-WRITE-FOOTINGS-X.

           PERFORM  9999-CLOSE-FILES
               THRU 9999-CLOSE-FILES-X.

P02229     PERFORM  0035-1000-COMMIT
P02229         THRU 0035-1000-COMMIT-X.

           STOP RUN.

       0000-MAINLINE-X.
           EXIT.
      /
      *----------------
       0100-OPEN-FILES.
      *----------------

           PERFORM  OCF-3000-OPEN-OUTPUT
               THRU OCF-3000-OPEN-OUTPUT-X.

           PERFORM  BCF-1000-OPEN-INPUT
               THRU BCF-1000-OPEN-INPUT-X.

           PERFORM  PRT1-3000-OPEN-OUTPUT
               THRU PRT1-3000-OPEN-OUTPUT-X.

M119NB*    PERFORM  LNCI-1000-OPEN-INPUT
M119NB*        THRU LNCI-1000-OPEN-INPUT-X.

M119NB     PERFORM  9176-1000-OPEN-INPUT
M119NB         THRU 9176-1000-OPEN-INPUT-X.

       0100-OPEN-FILES-X.
           EXIT.
      /
      *----------------
       2000-INITIALIZE.
      *----------------

           MOVE 'NS9076'                TO WS-MSG-REF-ID.

      * BUILD THE GENERAL PARAMETER AREA USED TO PASS INFO BETWEEN
      * MODULES.
           PERFORM  PGA-1000-BUILD-PARMS
               THRU PGA-1000-BUILD-PARMS-X.

           PERFORM  CCC-1000-PRCES-CO-CTL-CARD
               THRU CCC-1000-PRCES-CO-CTL-CARD-X.

           PERFORM  4000-INIT-FOR-COMPANY
               THRU 4000-INIT-FOR-COMPANY-X.

           PERFORM  4100-INIT-OCF-TITLES
               THRU 4100-INIT-OCF-TITLES-X.

           PERFORM  4200-INIT-PRT-HEADINGS
               THRU 4200-INIT-PRT-HEADINGS-X.

B10934     MOVE WGLOB-COMPANY-CODE      TO WMAST-CO-ID.
B10934
B10934     PERFORM  MAST-1000-READ
B10934         THRU MAST-1000-READ-X.
B10934
B10934     IF  WMAST-IO-OK
B10934         MOVE RMAST-APPL-CTL-PRCES-DT TO WGLOB-PROCESS-DATE
B10934     ELSE
B10934* MSG: MASTER CONTROL RECORD NOT FOUND (@1)
B10934         MOVE WMAST-KEY           TO WGLOB-MSG-PARM (1)
B10934         MOVE 'CS00000061'        TO WGLOB-MSG-REF-INFO
B10934         PERFORM 0260-1000-GENERATE-MESSAGE
B10934            THRU 0260-1000-GENERATE-MESSAGE-X
B10934         PERFORM 0030-5000-LOGIC-ERROR
B10934            THRU 0030-5000-LOGIC-ERROR-X
B10934     END-IF.
B10934
      *
      * PERFORM INITIAL INPUT FILE READ
      *
HIS106     SET WS-FIRST-READ-YES        TO TRUE.
HIS106
HNB403*    PERFORM LNCI-1000-READ
HNB403*       THRU LNCI-1000-READ-X.
M119DM*HNB403     PERFORM 8100-READ-LNCI
M119DM*HNB403        THRU 8100-READ-LNCI-X.
M119DM*HIS106
M119DM*HIS106     SET WS-FIRST-READ-NO         TO TRUE.
M119DM*HIS106
      * IN CASE OF HEADER RECORD DO ADDITIONAL READ...
      *    IF  WLNCI-SEQ-IO-OK
      *        PERFORM  8100-READ-LNCI
      *            THRU 8100-READ-LNCI-X
      *    END-IF.

M119DM*    IF  NOT WLNCI-SEQ-IO-OK
M119DM*    OR  WS-RUN-STOP
M119DM     PERFORM 8100-READ-9176
M119DM        THRU 8100-READ-9176-X.
M119DM
M119DM     SET WS-FIRST-READ-NO         TO TRUE.
M119DM
M119DM     IF  NOT W9176-SEQ-IO-OK
M119DM     OR  WS-RUN-STOP
      *TEXT: LINC INPUT FILE IS EMPTY.  END-OF-JOB
               MOVE '00001'             TO WS-TXT-SRC-REF-ID
               PERFORM  8000-GET-TEXT-DESC
                   THRU 8000-GET-TEXT-DESC-X
               MOVE SPACES              TO L0040-SBSDRY-CO-NAME
               MOVE L2490-TXT-STR-TXT   TO L0040-INPUT-LINE
               PERFORM  0040-2000-WRITE-ERROR
                   THRU 0040-2000-WRITE-ERROR-X
           END-IF.

HNB403     INITIALIZE WS-HOLD-DATA.
HNB403*
HNB403* SAVE KEY OF FIRST LINC RECORD 
HNB403*
HNB403     MOVE RLNCX-EACH-CO2-POL-ID TO WS-HOLD-POL-ID.
HNB403     MOVE RLNCX-EACH-CO2-CLI-ID TO WS-HOLD-CLI-ID.


           
       2000-INITIALIZE-X.
           EXIT.
      /
      *-------------------------
       3000-PROCESS-TRANSACTION.
      *-------------------------

           ADD +1                       TO WS-TOT-REC-CNTR-IN.
HIS106
HIS106     IF  RLNCX-TRNSMT-CO-MCL
HIS106         ADD +1                   TO WS-REC-CNTR-MLJ-IN
HIS106     ELSE
HIS106         ADD +1                   TO WS-REC-CNTR-NON-MLJ-IN
HIS106     END-IF.
      *
      * PROCESS THE INPUT RECORD.
      *
HNB403*      
HNB403*           PERFORM  3100-LINC-UPDATE
HNB403*               THRU 3100-LINC-UPDATE-X.
HNB403* 
HNB403* UPDATE DATABASE (TLINC & TREQT) AFTER THE TALLYING OF NON-MLJ 
HNB403* RECORDS FOR THE CURRENT POLICY/CLIENT IS COMPLETED
HNB403* NB: FOR A GIVEN POL/CLI, THE MLJ RECORD WILL ALWAYS PRECEDE THE
HNB403* NON-MLJ RECORDS (CONTROLLED IN UNISYS) 
HNB403*
HNB403     IF  RLNCX-EACH-CO2-POL-ID NOT = WS-HOLD-POL-ID
HNB403     OR  RLNCX-EACH-CO2-CLI-ID NOT = WS-HOLD-CLI-ID
HNB403*
HNB403         IF  WS-BYPASS-POL-NO
HNB403             PERFORM  3100-LINC-UPDATE
HNB403                 THRU 3100-LINC-UPDATE-X
HNB403         END-IF
HNB403*
HNB403* RESET SAVED DATA & STORE CURRENT KEY
HNB403* 
HNB403         INITIALIZE WS-HOLD-DATA
HNB403         SET  WS-BYPASS-POL-NO      TO TRUE
HNB403         MOVE RLNCX-EACH-CO2-POL-ID TO WS-HOLD-POL-ID
HNB403         MOVE RLNCX-EACH-CO2-CLI-ID TO WS-HOLD-CLI-ID
HIS106         INITIALIZE WS-TEMP-MLJ-REC-CNT
HIS106         INITIALIZE WS-TEMP-NON-MLJ-REC-CNT
HNB403*         
HNB403* FIRST RECORD AT CHANGE OF KEY SHOULD ALWAYS BE AN MLJ 
HNB403* RECORD (TYPE 49) - IF NOT GENERATE ERROR MESSAGE
HNB403*
HNB403         IF  NOT RLNCX-TRNSMT-CO-MCL
HNB403*MSG: MISSING LINC RECORD FOR POLICY @1 CLIENT @2
HNB403             SET WS-PRT1-ERR-TYP-NO-MLJ-REC TO TRUE
HNB403             MOVE WS-HOLD-POL-ID            TO WGLOB-MSG-PARM (1)
HNB403             MOVE WS-HOLD-CLI-ID            TO WGLOB-MSG-PARM (2)
HNB403             PERFORM  3900-WRITE-PRT1-DETAIL
HNB403                 THRU 3900-WRITE-PRT1-DETAIL-X
HNB403             SET WS-BYPASS-POL-YES          TO TRUE
M119DM*HIS106             PERFORM  8100-READ-LNCI
M119DM*HIS106                 THRU 8100-READ-LNCI-X
M119DM*
M119DM              PERFORM  8100-READ-9176
M119DM                  THRU 8100-READ-9176-X
HIS106             GO TO 3000-PROCESS-TRANSACTION-X
HNB403         END-IF
HNB403     END-IF.
HNB403
HNB403* IF CURRENT REC IS MLJ, THEN VALIDATE & SAVE THE CORRESPONDING
HNB403* REG DATE & REG ID - WILL BE USED TO UPDATE TLINC AT CHANGE 
HNB403* OF KEY.
HNB403* OTHERWISE TALLY HOSPITALIZATION AND DEATH BENEFIT AMOUNT
HNB403* TOTALS FOR THE CURRENT POL/CLI, USING THE NON-MLJ RECORDS 
HNB403* THAT FOLLOW.
HNB403*
HNB403     IF  WS-BYPASS-POL-NO
HIS106
HIS106         SET WS-EDIT-ERROR-NO           TO TRUE
HIS106         PERFORM  3300-GENERAL-EDITS
HIS106             THRU 3300-GENERAL-EDITS-X
HIS106         IF  WS-EDIT-ERROR
HIS106             SET WS-BYPASS-POL-YES      TO TRUE
M119DM*HIS106             PERFORM  8100-READ-LNCI
M119DM*HIS106                 THRU 8100-READ-LNCI-X
M119DM*
M119DM              PERFORM  8100-READ-9176
M119DM                  THRU 8100-READ-9176-X
HIS106             GO TO 3000-PROCESS-TRANSACTION-X
HIS106         END-IF
HIS106
HNB403         IF  RLNCX-TRNSMT-CO-MCL
HIS106*HNB403             ADD +1 TO WS-REC-CNTR-MLJ-IN
HNB403             PERFORM  3200-LINC-REG-FIELD-EDITS
HNB403                 THRU 3200-LINC-REG-FIELD-EDITS-X
HNB403         ELSE 
HNB403             PERFORM  3500-TALLY-AMT-TOTALS
HNB403                 THRU 3500-TALLY-AMT-TOTALS-X
HNB403         END-IF
HIS106     ELSE
HIS106         SET WS-PRT1-ERR-TYP-POL-BYPASS TO TRUE
HIS106         PERFORM  3900-WRITE-PRT1-DETAIL
HIS106             THRU 3900-WRITE-PRT1-DETAIL-X
HNB403     END-IF.

      *
      * READ THE NEXT RECORD.
      *
M119DM*             PERFORM  8100-READ-LNCI
M119DM*                 THRU 8100-READ-LNCI-X
M119DM*
M119DM     PERFORM  8100-READ-9176
M119DM         THRU 8100-READ-9176-X.


       3000-PROCESS-TRANSACTION-X.
           EXIT.
      /
      *-----------------
       3100-LINC-UPDATE.
      *-----------------

      * NOTE THIS PROGRAM USES THE LINC EXTRACT RECORD FORMAT (NCSRLNCX)
      * BECAUSE IT SHARES THE SAME LAYOUT AS THE LINC UPLOAD RECORD.
      * IF THIS EVER CHANGES, THE NCSRLNCI LAYOUT WILL NEED TO BE FULLY
      * DEFINED.
      
           SET  WS-EDIT-ERROR-NO        TO TRUE.
HNB403*    MOVE RLNCI-SEQ-REC-INFO      TO RLNCX-SEQ-REC-INFO.

      *
      * READ LINC RECORD & SET SWITCH USED TO CREATE/REWRITE LINC LATER.
      *
HNB403* USE SAVED KEY TO READ LINC RECORD FROM THE DATABASE
HNB403*
HNB403*    MOVE RLNCX-POL-MGMT-CLI-ID   TO WLINC-CLI-ID.
HNB403*    MOVE RLNCX-POL-ID            TO WLINC-POL-ID. 
HNB403     MOVE WS-HOLD-CLI-ID          TO WLINC-CLI-ID.
HNB403     MOVE WS-HOLD-POL-ID          TO WLINC-POL-ID.
           PERFORM  LINC-1000-READ
               THRU LINC-1000-READ-X.
           IF  WLINC-IO-OK
               SET  WS-LINC-EXISTS      TO TRUE
               PERFORM  LINC-1000-READ-FOR-UPDATE
                   THRU LINC-1000-READ-FOR-UPDATE-X
           ELSE
               SET  WS-LINC-EXISTS-NO   TO TRUE
               PERFORM  LINC-1000-CREATE
                   THRU LINC-1000-CREATE-X
           END-IF.

      *
      * DO EDITS 
      *
HNB403* ORIG PARA 3200 RENAMED TO 3110
HNB403**   PERFORM  3200-LINC-FIELD-EDITS
HNB403**       THRU 3200-LINC-FIELD-EDITS-X.
HNB403     PERFORM  3110-LINC-FIELD-EDITS
HNB403         THRU 3110-LINC-FIELD-EDITS-X.
M119NB
M119NB     IF  WS-AGGR-FACE-AMT-IND = SPACES
M119NB     OR  WS-AGGR-FACE-AMT-IND = '0'
M119NB         MOVE 'N'                   TO WS-AGGR-FACE-AMT-IND
M119NB     ELSE
M119NB         MOVE 'Y'                   TO WS-AGGR-FACE-AMT-IND
M119NB     END-IF.
M119NB
           PERFORM  3300-GENERAL-EDITS
               THRU 3300-GENERAL-EDITS-X.
           
           IF  WS-EDIT-ERROR
               IF  WS-LINC-EXISTS
                   PERFORM  LINC-3000-UNLOCK
                       THRU LINC-3000-UNLOCK-X
               END-IF
HIS106*               ADD +1                   TO WS-PRT1-ERROR-CNTR
               GO TO 3100-LINC-UPDATE-X
           END-IF.
         
HNB403* 
HNB403* SET UP LINC RECORD USING THE SAVED LINC INFORMATION
HNB403* 
HNB403     MOVE WS-HOLD-LINC-REG-ID     TO RLINC-LINC-REG-ID                            
HNB403     MOVE WS-HOLD-LINC-REG-DT     TO RLINC-LINC-REG-DT                            
HNB403     MOVE WS-HOLD-TOT-HOSP-AMT    TO RLINC-TOT-HOSP-AMT                            
HNB403     MOVE WS-HOLD-TOT-DB-AMT      TO RLINC-TOT-DB-AMT                            
M119NB     MOVE WS-AGGR-FACE-AMT-IND    TO RLINC-AGGR-FACE-AMT-IND.
27676C     MOVE WS-HOLD-AD-BNFT-AMT     TO RLINC-TOT-AD-BNFT-AMT.
27676C     MOVE WS-HOLD-IP-BNFT-AMT     TO RLINC-TOT-IP-BNFT-AMT.
27676C     MOVE WS-HOLD-CNCR-BNFT-AMT   TO RLINC-TOT-CNCR-BNFT-AMT.
27676C     MOVE WS-HOLD-HOSP-BNFT-AMT   TO RLINC-TOT-HOSP-BNFT-AMT.
27676C     MOVE WS-HOLD-MEDIC-BNFT-QTY  TO RLINC-TOT-MEDIC-BNFT-QTY.

      *
      * CREATE/UPDATE LINC RECORD.
      *
           IF  WS-LINC-EXISTS
               PERFORM  LINC-2000-REWRITE
                   THRU LINC-2000-REWRITE-X
           ELSE
               PERFORM  LINC-1000-WRITE
                   THRU LINC-1000-WRITE-X
           END-IF.

      *
      * UPDATE THE LINC REQUIRMENT TO "RECEIVED" STATUS      
HNB303* NOW UPDATED TO "REVIEWED AND ACCEPTED"           
      *
M119DM*    PERFORM  3400-PRCES-LINC-REQT
M119DM*        THRU 3400-PRCES-LINC-REQT-X.

HIS078*
HIS078* INITIIATE CLEAR-CASE
HIS078*
M119DM*HIS078     PERFORM 3600-START-CLEAR-CASE
M119DM*HIS078       THRU  3600-START-CLEAR-CASE-X.

               
      * UPDATE THE PROCESSED RECORD COUNTER.

HNB403*    ADD +1                           TO WS-REC-CNTR-OUT.
HIS106*HNB403     ADD +1                           TO WS-REC-CNTR-MLJ-OUT.
HIS106     ADD WS-TEMP-MLJ-REC-CNT          TO WS-REC-CNTR-MLJ-OUT.
HIS106     ADD WS-TEMP-NON-MLJ-REC-CNT      TO WS-REC-CNTR-NON-MLJ-OUT.

       3100-LINC-UPDATE-X.
           EXIT.
      /
      *----------------------
HNB403*3200-LINC-FIELD-EDITS.
HNB403 3110-LINC-FIELD-EDITS.
      *----------------------
      
           IF  RLINC-LINC-REG-ID NOT = SPACES
           OR  RLINC-LINC-REG-DT NOT = WWKDT-ZERO-DT
HIS085*MSG: LINC REC HAS BEEN OVERWRITTEN FOR POL @1 
HIS085*     (ORIG REG ID = @2,ORIG REG DATE = @3)
HIS085*        SET WS-PRT1-ERR-TYP-INFO-EXISTS   TO TRUE
HIS085*        SET WS-EDIT-ERROR                 TO TRUE
HIS085*        PERFORM  3900-WRITE-PRT1-DETAIL
HIS085*            THRU 3900-WRITE-PRT1-DETAIL-X
HNB403*        GO TO 3200-LINC-FIELD-EDITS-X
HIS085         MOVE WS-HOLD-POL-ID           TO WGLOB-MSG-PARM (1)
HIS085         MOVE RLINC-LINC-REG-ID        TO WGLOB-MSG-PARM (2)
HIS085         MOVE RLINC-LINC-REG-DT        TO WGLOB-MSG-PARM (3)
HIS085         MOVE 'NS90769704'             TO WGLOB-MSG-REF-INFO
HIS085         PERFORM  0260-1000-GENERATE-MESSAGE
HIS085             THRU 0260-1000-GENERATE-MESSAGE-X
HNB403         GO TO 3110-LINC-FIELD-EDITS-X
           END-IF.
                      
HNB403* FOLLOWING EDITS HAVE BEEN MOVED TO PARA 3200
HNB403* 
HNB403*    PERFORM  3210-EDIT-LINC-REG-ID
HNB403*        THRU 3210-EDIT-LINC-REG-ID-X.
HNB403*
HNB403*    PERFORM  3220-EDIT-LINC-REG-DT
HNB403*        THRU 3220-EDIT-LINC-REG-DT-X.
               
HNB403*3200-LINC-FIELD-EDITS-X.
HNB403 3110-LINC-FIELD-EDITS-X.
           EXIT.

      /
      *-------------------------
       3200-LINC-REG-FIELD-EDITS.
      *-------------------------
      
HNB403     SET  WS-EDIT-ERROR-NO        TO TRUE.
HNB403
HNB403     PERFORM  3210-EDIT-LINC-REG-ID
HNB403         THRU 3210-EDIT-LINC-REG-ID-X.
HNB403
HNB403     PERFORM  3220-EDIT-LINC-REG-DT
HNB403         THRU 3220-EDIT-LINC-REG-DT-X.

M119NB     MOVE RLNCX-AGGR-FACE-AMT-IND   TO WS-AGGR-FACE-AMT-IND.
HNB403     IF  WS-EDIT-ERROR
HNB403         SET WS-BYPASS-POL-YES    TO TRUE
HIS106     ELSE
HIS106         ADD +1                   TO WS-TEMP-MLJ-REC-CNT
HNB403     END-IF.
HNB403         
HNB403 3200-LINC-REG-FIELD-EDITS-X.
HNB403     EXIT.
      /
      *----------------------
       3210-EDIT-LINC-REG-ID.
      *----------------------
    
           IF  RLNCX-REG-NUM = SPACES
           OR  RLNCX-REG-NUM = '000000000000'
      *MSG: REGISTRATION NUMBER IS BLANK OR ALL ZEROES.
               SET WS-PRT1-ERR-TYP-REG-ID-SPACES TO TRUE
               SET WS-EDIT-ERROR                 TO TRUE
               PERFORM  3900-WRITE-PRT1-DETAIL
                   THRU 3900-WRITE-PRT1-DETAIL-X
               GO TO 3210-EDIT-LINC-REG-ID-X
           END-IF.
    
           IF  RLNCX-REG-NUM NOT NUMERIC
      *MSG: REGISTRATION ID MUST BE NUMERIC.
               SET WS-PRT1-ERR-TYP-REG-ID-NUM    TO TRUE
               SET WS-EDIT-ERROR                 TO TRUE
               PERFORM  3900-WRITE-PRT1-DETAIL
                   THRU 3900-WRITE-PRT1-DETAIL-X
               GO TO 3210-EDIT-LINC-REG-ID-X
           END-IF.
    
HNB403* SAVE REG NUM/ID FOR LATER UPDATE
HNB403*    MOVE RLNCX-REG-NUM           TO RLINC-LINC-REG-ID.
HNB403     MOVE RLNCX-REG-NUM           TO WS-HOLD-LINC-REG-ID.
       
       3210-EDIT-LINC-REG-ID-X.
           EXIT.
      /
      *-----------------------
       3220-EDIT-LINC-REG-DT.
      *-----------------------
    
           IF  RLNCX-LINC-PRCES-DT = SPACES
           OR  RLNCX-LINC-PRCES-DT = '00000000'
      *MSG: REGISTRATION DATE FORMAT IS BLANK OR ZEROES.
               SET WS-PRT1-ERR-TYP-REG-DT-SPACES  TO TRUE
               SET WS-EDIT-ERROR                  TO TRUE
               PERFORM  3900-WRITE-PRT1-DETAIL
                   THRU 3900-WRITE-PRT1-DETAIL-X
               GO TO 3220-EDIT-LINC-REG-DT-X
           END-IF.

           MOVE RLNCX-LINC-PRCES-YR     TO L1640-YYYY-1
           MOVE RLNCX-LINC-PRCES-MO     TO L1640-MM-1
           MOVE RLNCX-LINC-PRCES-DY     TO L1640-DD-1
           
           PERFORM  1640-2000-INTERNAL-TO-EXT
               THRU 1640-2000-INTERNAL-TO-EXT-X
           
           IF  NOT L1640-VALID
      *MSG: REGISTRATION DATE FORMAT IS INVALID
               SET WS-PRT1-ERR-TYP-REG-DT-INVALID TO TRUE
               SET WS-EDIT-ERROR                  TO TRUE
               PERFORM  3900-WRITE-PRT1-DETAIL
                   THRU 3900-WRITE-PRT1-DETAIL-X
               GO TO 3220-EDIT-LINC-REG-DT-X
           END-IF.
    
HNB403* SAVE REG DATE FOR LATER UPDATE
HNB403*    MOVE L1640-INTERNAL-DATE     TO RLINC-LINC-REG-DT.
HNB403     MOVE L1640-INTERNAL-DATE     TO WS-HOLD-LINC-REG-DT.
    
       3220-EDIT-LINC-REG-DT-X.
           EXIT.
      /
      *-------------------
       3300-GENERAL-EDITS.
      *-------------------
      
      *
      * MAKE SURE THAT POLICY / INSURED COMBINATION EXISTS
      *
           MOVE LOW-VALUES                TO WCCLI-KEY.
HNB403*
HNB403* USE SAVED KEY TO READ CVGC RECORD FROM THE DATABASE
HNB403*         
HNB403*    MOVE RLNCX-POL-ID              TO WCCLI-POL-ID.
HNB403*    MOVE RLNCX-POL-MGMT-CLI-ID     TO WCCLI-INSRD-CLI-ID.
HNB403     MOVE WS-HOLD-POL-ID            TO WCCLI-POL-ID.
HNB403     MOVE WS-HOLD-CLI-ID            TO WCCLI-INSRD-CLI-ID.


           MOVE HIGH-VALUES               TO WCCLI-ENDBR-KEY.
HNB403*    MOVE RLNCX-POL-ID              TO WCCLI-ENDBR-POL-ID.
HNB403*    MOVE RLNCX-POL-MGMT-CLI-ID     TO WCCLI-ENDBR-INSRD-CLI-ID.
HNB403     MOVE WS-HOLD-POL-ID            TO WCCLI-ENDBR-POL-ID.
HNB403     MOVE WS-HOLD-CLI-ID            TO WCCLI-ENDBR-INSRD-CLI-ID.


           PERFORM  CCLI-1000-BROWSE
               THRU CCLI-1000-BROWSE-X.

           PERFORM  CCLI-2000-READ-NEXT
               THRU CCLI-2000-READ-NEXT-X.

           IF  NOT WCCLI-IO-OK
      *MSG: POLICY (@1) / CLIENT (@2) COMBINATION DOES NOT EXIST.
               SET WS-PRT1-ERR-TYP-PCC-INVALID TO TRUE
               SET WS-EDIT-ERROR               TO TRUE
               PERFORM  3900-WRITE-PRT1-DETAIL
                   THRU 3900-WRITE-PRT1-DETAIL-X
           END-IF.

           PERFORM  CCLI-3000-END-BROWSE
               THRU CCLI-3000-END-BROWSE-X.
      
       3300-GENERAL-EDITS-X.
           EXIT.
      /
M119DM*---------------------
M119DM*3400-PRCES-LINC-REQT.
M119DM*---------------------
M119DM*
M119DM*HNB403*  DETERMINE IF OUTSTANDING REQT EXISTS AND UPDATE TO 'REVIEWED 
M119DM*HNB403*  AND ACCEPTED' (PREVIOUSLY RECEIVED)
M119DM*      *
M119DM*           PERFORM  0080-1000-BUILD-PARM-INFO
M119DM*               THRU 0080-1000-BUILD-PARM-INFO-X.
M119DM*
M119DM*           SET L0080-CLIENT-LEVEL       TO TRUE.
M119DM*           MOVE 'LINC'                  TO L0080-REQIR-CODE.
M119DM*           MOVE RLINC-CLI-ID            TO L0080-CLI-ID.
M119DM*      
M119DM*P00232*    PERFORM  0080-1000-SEARCH-ONE
M119DM*P00232*        THRU 0080-1000-SEARCH-ONE-X.
M119DM*       
M119DM*HNB303*P00232     SET L0080-REQIR-STAT-RECV TO TRUE.
M119DM*HNB303     SET L0080-REQIR-STAT-REVW-ACPT TO TRUE.
M119DM*P00232     PERFORM  0080-9100-UPDATE-OS-REQT
M119DM*P00232         THRU 0080-9100-UPDATE-OS-REQT-X.
M119DM*
M119DM*           EVALUATE TRUE
M119DM*               
M119DM*               WHEN L0080-RETRN-OK
M119DM*                AND L0080-RSLT-OUTSTNDG-FOUND
M119DM*P00232              CONTINUE
M119DM*P00232
M119DM*P00232*             SET L0080-REQIR-STAT-RECV TO TRUE      
M119DM*P00232*             PERFORM  0080-3600-FORCE-STAT-UPDATE
M119DM*P00232*                 THRU 0080-3600-FORCE-STAT-UPDATE-X
M119DM*P00232*        
M119DM*P00232*        WHEN L0080-RETRN-OK
M119DM*P00232*         AND NOT L0080-RSLT-OUTSTNDG-FOUND
M119DM*P00232*         AND NOT L0080-RSLT-NOT-FOUND
M119DM*P00232* REQUIREMENT EXISTS, BUT IS NOT OUTSTANDING - DO NOTHING
M119DM*P00232*             CONTINUE
M119DM*               
M119DM*P00232         WHEN L0080-RETRN-OK
M119DM*P00232          AND L0080-RSLT-WRITTEN
M119DM*P00232*MSG: EXISTING LINC REQUIREMENT NOT FOUND, NEW REQUIREMENT CREATED
M119DM*P00232*     WITH RECEIVED STATUS FOR CLIENT (@1).
M119DM*P00232              MOVE 'NS90760007'         TO WGLOB-MSG-REF-INFO
M119DM*                    MOVE RLINC-CLI-ID         TO WGLOB-MSG-PARM (1)
M119DM*P00232              PERFORM  0260-1000-GENERATE-MESSAGE
M119DM*P00232                  THRU 0260-1000-GENERATE-MESSAGE-X
               
M119DM*               WHEN OTHER
M119DM*P00232*MSG: ERROR UPDATING LINC REQUIREMENT. CHECK LINC UNDERWRITING 
M119DM*P00232*     REQUIREMENT FOR CLIENT (@1).
M119DM*                    MOVE 'NS90760006'         TO WGLOB-MSG-REF-INFO
M119DM*                    MOVE RLINC-CLI-ID         TO WGLOB-MSG-PARM (1)
M119DM*                    PERFORM  0260-1000-GENERATE-MESSAGE
M119DM*                        THRU 0260-1000-GENERATE-MESSAGE-X
M119DM*           
M119DM*           END-EVALUATE.
M119DM*
M119DM*       3400-PRCES-LINC-REQT-X.
M119DM*           EXIT.
M119DM*HNB403/
HNB403*-----------------------
HNB403 3500-TALLY-AMT-TOTALS.
HNB403*-----------------------
HNB403
HNB403* ACCUMULATE HOSPITALIZATION & DEATH BENEFIT AMOUNT TOTALS FROM
HNB403* NON-MLJ RECORDS ONLY IF THE POLICY ISSUE DATE SUPPLIED IS 
HNB403* WITHIN THE LAST SIX MONTHS. IF THE POLICY ISSUE DATE WAS NOT 
HNB403* SUPPLIED, THEN USE THE CORRESPONDING LINC REGISTRATION DATE 
HNB403* 
HNB403* IF ERRORS ARISE WHILST PROCESSING THE NON-MLJ RECORDS THEN TREAT
HNB403* AS WARNING - LINC UPDATE OF REG DATE & REG ID WILL STILL PROCEED 
HNB403
HNB403     SET  WS-EDIT-WARNING-NO      TO TRUE.
HNB403*
HNB403* ENSURE THAT HOSPITALIZATION & DEATH BENEFIT AMOUNTS ARE 
HNB403* VALID FORMAT
HNB403*
HNB403     PERFORM  3510-EDIT-AMT-FIELDS
HNB403         THRU 3510-EDIT-AMT-FIELDS-X.
HNB403
HNB403     IF  WS-EDIT-WARNING
HNB403         GO TO 3500-TALLY-AMT-TOTALS-X
HNB403     END-IF.
HNB403*
HNB403* LINC EFFECTIVE DATE MUST BE WITHIN 6 MONTHS OF THE PROCESS DATE.
HNB403* IF NOT, DO NOT INCLUDE THIS LINC RECORD WHEN TALLYING AMOUNTS
HNB403*
HNB403     PERFORM  3520-DERIVE-LINC-EFF-DT
HNB403         THRU 3520-DERIVE-LINC-EFF-DT-X.
HNB403*
B10934*HNB403     MOVE SPACES                 TO RMAST-KEY.
B10934*HNB403     MOVE WGLOB-COMPANY-CODE     TO WMAST-CO-ID.
B10934*HNB403     PERFORM  MAST-1000-READ
B10934*HNB403         THRU MAST-1000-READ-X.
B10934*HNB403
B10934*HNB403     MOVE RMAST-APPL-CTL-PRCES-DT TO L1680-INTERNAL-1.
B10934     MOVE WGLOB-PROCESS-DATE      TO L1680-INTERNAL-1.
HNB403     MOVE 6                       TO L1680-NUMBER-OF-MONTHS.
HNB403*
HNB403     PERFORM  1680-6000-SUB-M-FROM-DATE
HNB403         THRU 1680-6000-SUB-M-FROM-DATE-X.
HNB403*
HNB403     IF  WS-LINC-EFF-DT < L1680-INTERNAL-2
HNB403*MSG: REG DATE MORE THAN SIX MTHS IN THE PAST. 
HNB403*     AMT TOTALS IGNORED FOR POL @1, CLI @2
HNB403         MOVE WS-HOLD-POL-ID           TO WGLOB-MSG-PARM (1)
HNB403         MOVE WS-HOLD-CLI-ID           TO WGLOB-MSG-PARM (2)
HNB403         MOVE 'NS90769705'             TO WGLOB-MSG-REF-INFO
HNB403         PERFORM  0260-1000-GENERATE-MESSAGE
HNB403             THRU 0260-1000-GENERATE-MESSAGE-X
HNB403         ADD +1                        TO WS-REC-CNTR-NON-MLJ-OUT
HNB403         GO TO 3500-TALLY-AMT-TOTALS-X
HNB403     END-IF.
HNB403* 
HNB403     ADD WS-LINC-DISEASE-HOSP-BNFT-AMT TO WS-HOLD-TOT-HOSP-AMT.
27676C*HNB403     ADD WS-LINC-NRML-DEATH-FACE-AMT   TO WS-HOLD-TOT-DB-AMT.
HNB403
27676C     COMPUTE WS-HOLD-TOT-DB-AMT = WS-LINC-NRML-DEATH-FACE-AMT
27676C                                + WS-LINC-TOT-AD-BNFT-AMT
27676C
27676C     ADD WS-LINC-CNCR-BNFT-AMT        TO WS-HOLD-CNCR-BNFT-AMT
27676C     ADD WS-LINC-AD-BNFT-AMT          TO WS-HOLD-AD-BNFT-AMT
27676C     ADD WS-LINC-IP-BNFT-AMT          TO WS-HOLD-IP-BNFT-AMT
27676C     ADD WS-LINC-HOSP-BNFT-AMT        TO WS-HOLD-HOSP-BNFT-AMT
27676C     ADD WS-LINC-MEDIC-BNFT-QTY       TO WS-HOLD-MEDIC-BNFT-QTY
27676C
HIS106*HNB403     ADD +1                            TO WS-REC-CNTR-NON-MLJ-OUT.
HIS106     ADD +1                        TO WS-TEMP-NON-MLJ-REC-CNT.
HNB403
HNB403* 
HNB403 3500-TALLY-AMT-TOTALS-X.
HNB403     EXIT.
HNB403/
HNB403*-------------------------
HNB403 3510-EDIT-AMT-FIELDS.
HNB403*-------------------------
HNB403
HNB403* VALIDATE HOSPITALIZATION AMOUNT & DEATH BENEFIT AMOUNT ON EACH 
HNB403* NON-MLJ LINC RECORD FOR A GIVEN POLICY/CLIENT
HNB403*
HNB403     INITIALIZE WS-LINC-DISEASE-HOSP-BNFT-AMT
HNB403                WS-LINC-NRML-DEATH-FACE-AMT.
HNB403
HNB403     MOVE 0                        TO L0280-PRECISION.
HNB403     MOVE 'N'                      TO L0280-SIGN-IND.
HNB403     MOVE LENGTH OF RLNCX-DISEASE-HOSP-BNFT-AMT-X
HNB403                                   TO L0280-INPUT-SIZE.
HNB403     COMPUTE L0280-LENGTH = L0280-INPUT-SIZE - L0280-PRECISION.
HNB403     MOVE RLNCX-DISEASE-HOSP-BNFT-AMT-X TO L0280-INPUT-DATA.
HNB403     PERFORM  0280-1000-NUMERIC-EDIT
HNB403         THRU 0280-1000-NUMERIC-EDIT-X.
HNB403
HNB403     IF  L0280-OK
HNB403         MOVE L0280-OUTPUT        TO WS-LINC-DISEASE-HOSP-BNFT-AMT
HNB403     ELSE
HNB403*MSG: INVALID AMOUNT @1 FOR NON-MLJ CLIENT ID @2  
HNB403         SET WS-EDIT-WARNING                 TO TRUE
HNB403         SET WS-PRT1-ERR-TYP-AMT-INVALID     TO TRUE
HNB403         MOVE RLNCX-DISEASE-HOSP-BNFT-AMT-X  TO WGLOB-MSG-PARM (1)
HNB403         MOVE RLNCX-POL-MGMT-CLI-ID          TO WGLOB-MSG-PARM (2)
HNB403
HNB403         PERFORM  3900-WRITE-PRT1-DETAIL
HNB403             THRU 3900-WRITE-PRT1-DETAIL-X
HNB403         GO TO 3510-EDIT-AMT-FIELDS-X
HNB403     END-IF.
HNB403
HNB403     MOVE 0                        TO L0280-PRECISION.
HNB403     MOVE 'N'                      TO L0280-SIGN-IND.
HNB403     MOVE LENGTH OF RLNCX-NRML-DEATH-FACE-AMT
HNB403                                   TO L0280-INPUT-SIZE.
HNB403     COMPUTE L0280-LENGTH = L0280-INPUT-SIZE - L0280-PRECISION.
HNB403     MOVE RLNCX-NRML-DEATH-FACE-AMT TO L0280-INPUT-DATA.
HNB403     PERFORM  0280-1000-NUMERIC-EDIT
HNB403         THRU 0280-1000-NUMERIC-EDIT-X.
HNB403
HNB403     IF  L0280-OK
HNB403         MOVE L0280-OUTPUT        TO WS-LINC-NRML-DEATH-FACE-AMT
HNB403     ELSE
HNB403*MSG: INVALID AMOUNT @1 FOR NON-MLJ CLIENT ID @2  
HNB403         SET WS-EDIT-WARNING                 TO TRUE
HNB403         SET WS-PRT1-ERR-TYP-AMT-INVALID     TO TRUE
HNB403         MOVE RLNCX-NRML-DEATH-FACE-AMT      TO WGLOB-MSG-PARM (1)
HNB403         MOVE RLNCX-POL-MGMT-CLI-ID          TO WGLOB-MSG-PARM (2)
HNB403         PERFORM  3900-WRITE-PRT1-DETAIL
HNB403             THRU 3900-WRITE-PRT1-DETAIL-X
HNB403         GO TO 3510-EDIT-AMT-FIELDS-X
HNB403     END-IF.
27676C
27676C     MOVE 0                           TO L0280-PRECISION.
27676C     MOVE 'N'                         TO L0280-SIGN-IND.
27676C     MOVE LENGTH OF RLNCX-AD-BNFT-AMT-X
27676C                                      TO L0280-INPUT-SIZE.
27676C     COMPUTE L0280-LENGTH = L0280-INPUT-SIZE - L0280-PRECISION.
27676C     MOVE RLNCX-AD-BNFT-AMT-X         TO L0280-INPUT-DATA.
27676C     PERFORM  0280-1000-NUMERIC-EDIT
27676C         THRU 0280-1000-NUMERIC-EDIT-X.
27676C
27676C     IF  L0280-OK
27676C         MOVE L0280-OUTPUT            TO 
27676C                                    WS-LINC-AD-BNFT-AMT
27676C     ELSE
27676C*MSG: INVALID AMOUNT @1 FOR NON-MLJ CLIENT ID @2  
27676C         SET WS-EDIT-WARNING          TO TRUE
27676C         SET WS-PRT1-ERR-TYP-AMT-INVALID
27676C                                      TO TRUE
27676C         MOVE RLNCX-AD-BNFT-AMT-X     TO WGLOB-MSG-PARM (1)
27676C         MOVE RLNCX-POL-MGMT-CLI-ID   TO WGLOB-MSG-PARM (2)
27676C
27676C         PERFORM  3900-WRITE-PRT1-DETAIL
27676C             THRU 3900-WRITE-PRT1-DETAIL-X
27676C         GO TO 3510-EDIT-AMT-FIELDS-X
27676C     END-IF.
27676C
27676C     MOVE 0                           TO L0280-PRECISION.
27676C     MOVE 'N'                         TO L0280-SIGN-IND.
27676C     MOVE LENGTH OF RLNCX-IP-BNFT-AMT-X
27676C                                      TO L0280-INPUT-SIZE.
27676C     COMPUTE L0280-LENGTH = L0280-INPUT-SIZE - L0280-PRECISION.
27676C     MOVE RLNCX-IP-BNFT-AMT-X         TO L0280-INPUT-DATA.
27676C     PERFORM  0280-1000-NUMERIC-EDIT
27676C         THRU 0280-1000-NUMERIC-EDIT-X.
27676C
27676C     IF  L0280-OK
27676C         MOVE L0280-OUTPUT            TO 
27676C                                    WS-LINC-IP-BNFT-AMT
27676C     ELSE
27676C*MSG: INVALID AMOUNT @1 FOR NON-MLJ CLIENT ID @2  
27676C         SET WS-EDIT-WARNING          TO TRUE
27676C         SET WS-PRT1-ERR-TYP-AMT-INVALID
27676C                                      TO TRUE
27676C         MOVE RLNCX-IP-BNFT-AMT-X     TO WGLOB-MSG-PARM (1)
27676C         MOVE RLNCX-POL-MGMT-CLI-ID   TO WGLOB-MSG-PARM (2)
27676C
27676C         PERFORM  3900-WRITE-PRT1-DETAIL
27676C             THRU 3900-WRITE-PRT1-DETAIL-X
27676C         GO TO 3510-EDIT-AMT-FIELDS-X
27676C     END-IF.
27676C
27676C     MOVE 0                           TO L0280-PRECISION.
27676C     MOVE 'N'                         TO L0280-SIGN-IND.
27676C     MOVE LENGTH OF RLNCX-CNCR-BNFT-AMT-X
27676C                                      TO L0280-INPUT-SIZE.
27676C     COMPUTE L0280-LENGTH = L0280-INPUT-SIZE - L0280-PRECISION.
27676C     MOVE RLNCX-CNCR-BNFT-AMT-X       TO L0280-INPUT-DATA.
27676C     PERFORM  0280-1000-NUMERIC-EDIT
27676C         THRU 0280-1000-NUMERIC-EDIT-X.
27676C
27676C     IF  L0280-OK
27676C         MOVE L0280-OUTPUT            TO 
27676C                                    WS-LINC-CNCR-BNFT-AMT
27676C     ELSE
27676C*MSG: INVALID AMOUNT @1 FOR NON-MLJ CLIENT ID @2  
27676C         SET WS-EDIT-WARNING          TO TRUE
27676C         SET WS-PRT1-ERR-TYP-AMT-INVALID
27676C                                      TO TRUE
27676C         MOVE RLNCX-CNCR-BNFT-AMT-X   TO WGLOB-MSG-PARM (1)
27676C         MOVE RLNCX-POL-MGMT-CLI-ID   TO WGLOB-MSG-PARM (2)
27676C
27676C         PERFORM  3900-WRITE-PRT1-DETAIL
27676C             THRU 3900-WRITE-PRT1-DETAIL-X
27676C         GO TO 3510-EDIT-AMT-FIELDS-X
27676C     END-IF.
27676C
27676C     MOVE 0                           TO L0280-PRECISION.
27676C     MOVE 'N'                         TO L0280-SIGN-IND.
27676C     MOVE LENGTH OF RLNCX-HOSP-BNFT-AMT-X
27676C                                      TO L0280-INPUT-SIZE.
27676C     COMPUTE L0280-LENGTH = L0280-INPUT-SIZE - L0280-PRECISION.
27676C     MOVE RLNCX-HOSP-BNFT-AMT-X       TO L0280-INPUT-DATA.
27676C     PERFORM  0280-1000-NUMERIC-EDIT
27676C         THRU 0280-1000-NUMERIC-EDIT-X.
27676C
27676C     IF  L0280-OK
27676C         MOVE L0280-OUTPUT            TO 
27676C                                    WS-LINC-HOSP-BNFT-AMT
27676C     ELSE
27676C*MSG: INVALID AMOUNT @1 FOR NON-MLJ CLIENT ID @2  
27676C         SET WS-EDIT-WARNING          TO TRUE
27676C         SET WS-PRT1-ERR-TYP-AMT-INVALID
27676C                                      TO TRUE
27676C         MOVE RLNCX-HOSP-BNFT-AMT-X   TO WGLOB-MSG-PARM (1)
27676C         MOVE RLNCX-POL-MGMT-CLI-ID   TO WGLOB-MSG-PARM (2)
27676C
27676C         PERFORM  3900-WRITE-PRT1-DETAIL
27676C             THRU 3900-WRITE-PRT1-DETAIL-X
27676C         GO TO 3510-EDIT-AMT-FIELDS-X
27676C     END-IF.
27676C
27676C     MOVE RLNCX-MEDIC-BNFT-QTY        TO 
27676C                                    WS-LINC-MEDIC-BNFT-QTY.
HNB403
HNB403 3510-EDIT-AMT-FIELDS-X.
HNB403     EXIT.
HNB403/
HNB403*-------------------------
HNB403 3520-DERIVE-LINC-EFF-DT.
HNB403*-------------------------
HNB403
HNB403* CONVERT POLICY ISSUE DATE (IF AVAILABLE) TO INTERNAL FORMAT.
HNB403* IF NOT AVAILABLE OR INVALID, TRY USING LINC REG RQST DATE - 
HNB403* (I.E. NO NEED TO GENERATE ERROR MSG...YET)
HNB403*
HNB403     INITIALIZE WS-LINC-EFF-DT.
HNB403
HNB403     IF  RLNCX-POL-ISS-DT = SPACES
HNB403     OR  RLNCX-POL-ISS-DT = '00000000'
HNB403         CONTINUE 
HNB403     ELSE 
HNB403         MOVE RLNCX-POL-ISS-DT-YR    TO L1640-YYYY-1
HNB403         MOVE RLNCX-POL-ISS-DT-MO    TO L1640-MM-1
HNB403         MOVE RLNCX-POL-ISS-DT-DY    TO L1640-DD-1

HNB403         PERFORM  1640-2000-INTERNAL-TO-EXT
HNB403             THRU 1640-2000-INTERNAL-TO-EXT-X
HNB403* IF VALID, USE POLICY ISSUE DATE AS EFFECTIVE DATE
HNB403         IF  L1640-VALID
HNB403             MOVE L1640-INTERNAL-DATE TO WS-LINC-EFF-DT
HNB403             GO TO 3520-DERIVE-LINC-EFF-DT-X
HNB403         END-IF
HNB403     END-IF.

HNB403* POLICY ISSUE DATE WAS UNAVAILABLE/INVALID, SO TRY REG RQST DATE
HNB403* NB: THIS IS THE REG RQST DATE FROM THE NON-MLJ RECORD 
HNB403*
HNB403     IF  RLNCX-APP-RECV-DT = SPACES
HNB403     AND RLNCX-APP-RECV-DT = '00000000' 

HNB403*MSG: REGISTRATION DATE FORMAT IS BLANK OR ZEROES 
HNB403         SET WS-PRT1-ERR-TYP-REG-DT-SPACES   TO TRUE
HNB403         SET WS-EDIT-WARNING                 TO TRUE
HNB403         PERFORM  3900-WRITE-PRT1-DETAIL
HNB403             THRU 3900-WRITE-PRT1-DETAIL-X
HNB403         GO TO 3520-DERIVE-LINC-EFF-DT-X
HNB403     END-IF.
HNB403
HNB403     MOVE RLNCX-APP-RECV-DT-YR    TO L1640-YYYY-1.
HNB403     MOVE RLNCX-APP-RECV-DT-MO    TO L1640-MM-1.
HNB403     MOVE RLNCX-APP-RECV-DT-DY    TO L1640-DD-1.
HNB403     
HNB403     PERFORM  1640-2000-INTERNAL-TO-EXT
HNB403         THRU 1640-2000-INTERNAL-TO-EXT-X.
HNB403     
HNB403     IF  NOT L1640-VALID
HNB403*MSG: REGISTRATION DATE FORMAT IS INVALID
HNB403         SET WS-PRT1-ERR-TYP-REG-DT-INVALID TO TRUE
HNB403         SET WS-EDIT-WARNING                TO TRUE
HNB403         PERFORM  3900-WRITE-PRT1-DETAIL
HNB403             THRU 3900-WRITE-PRT1-DETAIL-X
HNB403         GO TO 3520-DERIVE-LINC-EFF-DT-X
HNB403     END-IF.
HNB403
HNB403* IF VALID, USE LINC REG DATE AS EFFECTIVE DATE
HNB403     MOVE L1640-INTERNAL-DATE    TO WS-LINC-EFF-DT.
HNB403
HNB403 3520-DERIVE-LINC-EFF-DT-X.
HNB403     EXIT.
HNB403/
M119DM*HIS078*------------------------
M119DM*HIS078 3600-START-CLEAR-CASE.
M119DM*HIS078*------------------------
M119DM*HIS078
M119DM*HIS078* VALIDATE ALL REQUIREMENTS.
M119DM*HIS078
M119DM*HIS078     INITIALIZE L9316-INPUT-PARM-INFO.
M119DM*HIS078     INITIALIZE L9316-IO-PARM-INFO.
M119DM*HIS078
M119DM*HIS078     PERFORM 3610-GET-UW-LEVEL
M119DM*HIS078        THRU 3610-GET-UW-LEVEL-X.
M119DM*HIS078
M119DM*HIS078     MOVE  WS-HOLD-POL-ID        TO L9316-POL-ID.
M119DM*B10903     MOVE  WS-HOLD-CLI-ID        TO L9316-CLI-ID.
M119DM*HIS078
M119DM*HIS078     PERFORM  9316-1000-EDIT-REQT
M119DM*HIS078         THRU 9316-1000-EDIT-REQT-X.
M119DM*HIS078     
M119DM*HIS078     IF L9316-CLEAR-CASE-NO
M119DM*HIS078        GO TO 3600-START-CLEAR-CASE-X
M119DM*HIS078     END-IF.
M119DM*HIS078*
M119DM*HIS078* STARTS CLEAR CASE PROCESSING IF ALL REQUIREMENTS ARE STATISFIED
M119DM*HIS078*
M119DM*B10903*HIS078     PERFORM 9316-3000-STRT-POL-CLR-CASE
M119DM*B10903*HIS078        THRU 9316-3000-STRT-POL-CLR-CASE-X.
M119DM*B10903
M119DM*B10903     PERFORM 9316-2000-STRT-CLI-CLR-CASE
M119DM*B10903        THRU 9316-2000-STRT-CLI-CLR-CASE-X.
M119DM*HIS078        
M119DM*HIS078     IF  L9316-RETRN-OK
M119DM*HIS078         CONTINUE
M119DM*HIS078     ELSE
M119DM*B10903*HIS078*MSG: CLEAR CASE FAILED FOR POL (@1) 
M119DM*B10903*MSG: CLEAR CASE FAILED FOR CLIENT (@1) 
M119DM*B10903*HIS078  MOVE WS-HOLD-POL-ID           TO WGLOB-MSG-PARM (1)
M119DM*B10903         MOVE WS-HOLD-CLI-ID           TO WGLOB-MSG-PARM (1)
M119DM*HIS078         MOVE 'NS90769702'             TO WGLOB-MSG-REF-INFO
M119DM*HIS078         PERFORM  0260-1000-GENERATE-MESSAGE
M119DM*HIS078             THRU 0260-1000-GENERATE-MESSAGE-X
M119DM*HIS078         GO TO 3600-START-CLEAR-CASE-X
M119DM*HIS078     END-IF.
M119DM*HIS078
M119DM*HIS078 3600-START-CLEAR-CASE-X.
M119DM*HIS078     EXIT.
M119DM*HIS078
M119DM*HIS078*-------------------------
M119DM*HIS078 3610-GET-UW-LEVEL.
M119DM*HIS078*-------------------------
M119DM*HIS078
M119DM*HIS078* READ CLIU TABLE TO FIND THE LEVEL OF UNDERWRITING REQUIRED
M119DM*HIS078
M119DM*HIS078     MOVE WS-HOLD-POL-ID       TO WCLUA-POL-ID.
M119DM*HIS078     MOVE WS-HOLD-CLI-ID       TO WCLUA-CLI-ID.
M119DM*HIS078
M119DM*HIS078     MOVE WCLUA-KEY            TO WCLUA-ENDBR-KEY.
M119DM*HIS078     
M119DM*HIS078     PERFORM  CLUA-1000-BROWSE
M119DM*HIS078         THRU CLUA-1000-BROWSE-X.
M119DM*HIS078
M119DM*HIS078     PERFORM  CLUA-2000-READ-NEXT
M119DM*HIS078         THRU CLUA-2000-READ-NEXT-X.
M119DM*HIS078     
M119DM*HIS078     IF  NOT WCLUA-IO-OK
M119DM*HIS078         MOVE WS-HOLD-CLI-ID    TO WGLOB-MSG-PARM (1)
M119DM*HIS078         MOVE WS-HOLD-POL-ID    TO WGLOB-MSG-PARM (2)
M119DM*HIS078* MSG: CLIENT UNDERWRITING LEVEL NOT FOUND FOR CLIENT @1
M119DM*HIS078*      AND POLICY @2
M119DM*HIS078         MOVE 'NS90769703'      TO WGLOB-MSG-REF-INFO
M119DM*HIS078         PERFORM  0260-1000-GENERATE-MESSAGE
M119DM*HIS078             THRU 0260-1000-GENERATE-MESSAGE-X
M119DM*HIS078     ELSE
M119DM*MP55AI         IF RCLIU-UW-TYP-FORMD
M119DM*MP55AI            SET L9316-UW-LEVD-FORM-REQT-EDIT TO TRUE
M119DM*MP55AI         END-IF
M119DM*MP55AI         IF RCLIU-UW-TYP-FORMC
M119DM*MP55AI            SET L9316-UW-LEVC-FORM-REQT-EDIT TO TRUE
M119DM*MP55AI         END-IF
M119DM*MP55AI         IF RCLIU-UW-TYP-FORMB
M119DM*MP55AI            SET L9316-UW-LEVB-FORM-REQT-EDIT TO TRUE
M119DM*MP55AI         END-IF
M119DM*MP55AI         IF RCLIU-UW-TYP-FORMA
M119DM*MP55AI            SET L9316-UW-LEVA-FORM-REQT-EDIT TO TRUE
M119DM*MP55AI         END-IF
M119DM*MFFFU4         IF RCLIU-UW-TYP-HLTHCHK
M119DM*MFFFU4            SET L9316-UW-LEV7-FORM-REQT-EDIT TO TRUE
M119DM*MFFFU4         END-IF
M119DM*MFFFU4         IF RCLIU-UW-TYP-CLINSURVEY
M119DM*MFFFU4            SET L9316-UW-LEV6-FORM-REQT-EDIT TO TRUE
M119DM*MFFFU4         END-IF
M119DM*MFFFU4         IF RCLIU-UW-TYP-PHYSCHK
M119DM*MFFFU4            SET L9316-UW-LEV5-FORM-REQT-EDIT TO TRUE
M119DM*MFFFU4         END-IF
M119DM*MFFFU4         IF RCLIU-UW-TYP-CORPHLTH
M119DM*MFFFU4            SET L9316-UW-LEV4-FORM-REQT-EDIT TO TRUE
M119DM*MFFFU4         END-IF
M119DM*HIS078         IF RCLIU-UW-TYP-SDSCLSR       
M119DM*HIS078            SET L9316-UW-LEV3-FORM-REQT-EDIT TO TRUE
M119DM*HIS078         END-IF
M119DM*HIS078         IF RCLIU-UW-TYP-INTERV       
M119DM*HIS078            SET L9316-UW-LEV2-FORM-REQT-EDIT TO TRUE
M119DM*HIS078         END-IF
M119DM*HIS078         IF RCLIU-UW-TYP-DOCTOR       
M119DM*HIS078            SET L9316-UW-LEV1-FORM-REQT-EDIT TO TRUE
M119DM*HIS078         END-IF
M119DM*HIS078     END-IF.
M119DM*HIS078
M119DM*HIS078     PERFORM  CLUA-3000-END-BROWSE
M119DM*HIS078         THRU CLUA-3000-END-BROWSE-X.
M119DM*HIS078
M119DM*HIS078 3610-GET-UW-LEVEL-X.
M119DM*HIS078     EXIT.
M119DM*HIS078/
      *-----------------------
       3900-WRITE-PRT1-DETAIL.
      *-----------------------

           MOVE SPACES                  TO WS-PRT1-DETAIL-LINE.

HNB403*    MOVE RLNCX-POL-MGMT-CLI-ID   TO WS-PRT1-DL1-CLI-ID.
HNB403*    MOVE RLNCX-POL-ID            TO WS-PRT1-DL1-POL-ID.
HNB403     MOVE WS-HOLD-CLI-ID          TO WS-PRT1-DL1-CLI-ID.
HNB403     MOVE WS-HOLD-POL-ID          TO WS-PRT1-DL1-POL-ID.
           MOVE RLNCX-REG-NUM           TO WS-PRT1-DL1-REG-NUM.
           MOVE RLNCX-LINC-PRCES-DT     TO WS-PRT1-DL1-PRCES-DT.

      *RETRIEVE ERROR TEXT
           MOVE WS-PRT1-ERR-TYP-CD      TO WS-MSG-REF-NUM.
           MOVE WS-MSG-REF-INFO         TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.
           MOVE WGLOB-MSG-TXT           TO WS-PRT1-DL1-ERROR-TEXT.

           PERFORM  4300-WRITE-PRT1-DETAIL
               THRU 4300-WRITE-PRT1-DETAIL-X.
HIS106
HIS106     ADD +1                       TO WS-PRT1-ERROR-CNTR.

       3900-WRITE-PRT1-DETAIL-X.
           EXIT.
      /
      *----------------------
       4000-INIT-FOR-COMPANY.
      *----------------------

           MOVE SPACES                  TO WHDG-LINE-1.

           PERFORM  0950-0000-INIT-PARM-INFO
               THRU 0950-0000-INIT-PARM-INFO-X.
           PERFORM  0950-1000-GET-COMPANY-NAME
               THRU 0950-1000-GET-COMPANY-NAME-X.

           MOVE L0950-COMPANY-NAME      TO WS-COMPANY-NAME.
           MOVE WS-COMPANY-NAME         TO WHDG-COMPANY-NAME.

           MOVE ZEROS                   TO WS-PRT1-PAGE-CNTR.
      *
      *  FORCE THE HEADER TO PRINT ON FIRST PAGE
      *
           MOVE +99                     TO WS-PRT1-LINE-CNTR.

       4000-INIT-FOR-COMPANY-X.
           EXIT.
      /
      *---------------------
       4100-INIT-OCF-TITLES.
      *---------------------

           MOVE WS-COMPANY-NAME         TO L0040-COMPANY-NAME.
           MOVE ZERO                    TO L0040-ERROR-CNT.

           MOVE SPACES                  TO WHDG-LINE-2.
           MOVE WPGWS-CRNT-PGM-ID       TO WHDG-PROGRAM-ID.

      *TEXT: LINC INTERFACE - RUN MESSAGES
           MOVE '00009'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  8000-GET-TEXT-DESC
               THRU 8000-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO L0040-PROGRAM-DESC.

      **** GET THE SYSTEM ID FOR THE HEADING
           MOVE 'XS00000145'            TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.
           MOVE WGLOB-MSG-TXT           TO L0040-SYSTEM-ID.
           MOVE WGLOB-MSG-TXT           TO WHDG-SYSTEM-ID.

      **** GET THE DETAIL HEADINGS 'RUN MESSAGES'
           MOVE 'XS00000153'            TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.
           MOVE WGLOB-MSG-TXT           TO L0040-HDG-LINE-3.

           MOVE SPACES                  TO L0040-SBSDRY-CO-NAME.

           PERFORM  0040-1000-INIT-TITLE
               THRU 0040-1000-INIT-TITLE-X.

       4100-INIT-OCF-TITLES-X.
           EXIT.
      /
      *-----------------------
       4200-INIT-PRT-HEADINGS.
      *-----------------------

      *  INITIALIZE PARMATERS FOR TEXT RETRIEVAL MODULE
           PERFORM  2490-1000-BUILD-PARM-INFO
               THRU 2490-1000-BUILD-PARM-INFO-X.
M119DM*    MOVE WPGWS-CRNT-PGM-ID       TO L2490-TXT-SRC-ID.
M119DM     MOVE 'NSBM9076'              TO L2490-TXT-SRC-ID.

      **** MOVE DATE TO HEADING
           MOVE WGLOB-SYSTEM-DATE-INT   TO L1640-INTERNAL-DATE.
           PERFORM  1640-2000-INTERNAL-TO-EXT
               THRU 1640-2000-INTERNAL-TO-EXT-X.
           MOVE L1640-EXTERNAL-DATE     TO WHDG-DATE.

      **** MOVE TIME TO HEADING
           MOVE WGLOB-SYSTEM-TIME       TO WTIME-EDIT-TIME.
           PERFORM  TIME-1000-REFORMAT
               THRU TIME-1000-REFORMAT-X.
           MOVE WTIME-DISPLAY-TIME      TO WHDG-TIME.

      **** SET UP HEADING CONTANTS - DATE:, TIME:, PAGE NO:
           PERFORM  HDG-1000-INIT-CONSTANTS
               THRU HDG-1000-INIT-CONSTANTS-X.
           PERFORM  HDG-2000-INIT-SBSDRY-CO
               THRU HDG-2000-INIT-SBSDRY-CO-X.

           PERFORM  4205-INIT-PRT1-HEADINGS
               THRU 4205-INIT-PRT1-HEADINGS-X.


       4200-INIT-PRT-HEADINGS-X.
           EXIT.
      /
      *------------------------
       4205-INIT-PRT1-HEADINGS.
      *------------------------

      *TEXT: LINC INTERFACE ERROR AND STATISTICS REPORT
           MOVE '00005'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  8000-GET-TEXT-DESC
               THRU 8000-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-PRT1-REPORT-TITLE-1.

      **** GET REPORT WS-PRT1-HEADING-1
           MOVE '00006'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  8000-GET-TEXT-DESC
               THRU 8000-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-PRT1-HEADING-1.

      **** GET REPORT WS-PRT1-HEADING-2
           MOVE '00007'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  8000-GET-TEXT-DESC
               THRU 8000-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-PRT1-HEADING-2.


       4205-INIT-PRT1-HEADINGS-X.
           EXIT.
      /
      *-----------------------
       4300-WRITE-PRT1-DETAIL.
      *-----------------------

           ADD +1                       TO WS-PRT1-LINE-CNTR.
           IF  WS-PRT1-LINE-CNTR > WS-MAX-LINE-CNTR
               PERFORM  4400-WRITE-PRT1-HEADINGS
                   THRU 4400-WRITE-PRT1-HEADINGS-X
           END-IF.

           MOVE +1                      TO WPRT1-NUMBER-LINES.
           MOVE WS-PRT1-DETAIL-LINE     TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

       4300-WRITE-PRT1-DETAIL-X.
           EXIT.
      /
      *-------------------------
       4400-WRITE-PRT1-HEADINGS.
      *-------------------------

           ADD 1                        TO WS-PRT1-PAGE-CNTR.
           MOVE WS-PRT1-PAGE-CNTR       TO WHDG-PAGE.
           MOVE SPACES                  TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-2000-WRITE
               THRU PRT1-2000-WRITE-X.

           MOVE +1                      TO WPRT1-NUMBER-LINES.
           MOVE WHDG-LINE-1             TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           MOVE +1                      TO WPRT1-NUMBER-LINES.
           MOVE WS-PRT1-REPORT-TITLE-1  TO WHDG-REPORT-TITLE.
           MOVE WHDG-LINE-2             TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           MOVE +2                      TO WPRT1-NUMBER-LINES.
           MOVE WS-PRT1-HEADING-1       TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           MOVE +1                      TO WPRT1-NUMBER-LINES.
           MOVE WS-PRT1-HEADING-2       TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

           MOVE +1                      TO WPRT1-NUMBER-LINES.
           MOVE SPACES                  TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.
           MOVE 8                       TO WS-PRT1-LINE-CNTR.

       4400-WRITE-PRT1-HEADINGS-X.
           EXIT.
      /
      *-------------------
       8000-GET-TEXT-DESC.
      *-------------------

           PERFORM  2490-1000-BUILD-PARM-INFO
               THRU 2490-1000-BUILD-PARM-INFO-X.
M119DM*    MOVE WPGWS-CRNT-PGM-ID       TO L2490-TXT-SRC-ID.
M119DM     MOVE 'NSBM9076'              TO L2490-TXT-SRC-ID.
           MOVE WS-TXT-SRC-REF-ID       TO L2490-TXT-SRC-REF-ID.
           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

       8000-GET-TEXT-DESC-X.
           EXIT.
      /
M119DM*      *---------------
M119DM*      8100-READ-LNCI.
M119DM*      *---------------
M119DM*
M119DM*      * READ THE NEXT RECORD.
M119DM*
M119DM*           PERFORM LNCI-1000-READ
M119DM*              THRU LNCI-1000-READ-X.
M119DM*
M119DM*HIS106* STOP THE PROGRAM IF THE INPUT FILE IS EMPTY
M119DM*HIS106
M119DM*HIS106     IF  WS-FIRST-READ-YES
M119DM*HIS106     AND RLNCI-SEQ-REC-INFO = SPACES
M119DM*HIS106         SET WS-RUN-STOP        TO TRUE
M119DM*HIS106         GO TO 8100-READ-LNCI-X
M119DM*HIS106     END-IF.
M119DM*HIS106
M119DM*HNB403* NOTE THIS PROGRAM USES THE LINC EXTRACT RECORD FORMAT (NCSRLNCX)
M119DM*HNB403* BECAUSE IT SHARES THE SAME LAYOUT AS THE LINC UPLOAD RECORD.
M119DM*HNB403* IF THIS EVER CHANGES, THE NCSRLNCI LAYOUT WILL NEED TO BE FULLY
M119DM*HNB403* DEFINED.
M119DM*HNB403
M119DM*HNB403     MOVE RLNCI-SEQ-REC-INFO TO RLNCX-SEQ-REC-INFO.
M119DM*
M119DM*      * IN CASE OF FOOTER...
M119DM*      *    IF  RLNCI-XXXXXXXXXXXXXX = SPACES
M119DM*      *        SET WS-RUN-STOP        TO TRUE
M119DM*      *    END-IF.
M119DM*     
M119DM*HNB403*
M119DM*HNB403* PROCESS LAST SAVED POLICY DETAILS IF EOF REACHED
M119DM*HNB403*
M119DM*HNB403     IF  WLNCI-SEQ-IO-EOF
M119DM*HNB403     AND WS-BYPASS-POL-NO
M119DM*HNB403         PERFORM  3100-LINC-UPDATE
M119DM*HNB403             THRU 3100-LINC-UPDATE-X
M119DM*HNB403     END-IF.
M119DM*
M119DM*       8100-READ-LNCI-X.
M119DM*           EXIT.
M119DM*
M119DM*      /
      *---------------
       8100-READ-9176.
      *---------------

      * READ THE NEXT RECORD.

           PERFORM 9176-1000-READ
              THRU 9176-1000-READ-X.

      * STOP THE PROGRAM IF THE INPUT FILE IS EMPTY
      
           IF  WS-FIRST-READ-YES
           AND R9176-SEQ-REC-INFO = SPACES
               SET WS-RUN-STOP        TO TRUE
               GO TO 8100-READ-9176-X
           END-IF.

           MOVE R9176-SEQ-REC-INFO TO RLNCX-SEQ-REC-INFO.

      * PROCESS LAST SAVED POLICY DETAILS IF EOF REACHED

           IF  W9176-SEQ-IO-EOF
           AND WS-BYPASS-POL-NO
               PERFORM  3100-LINC-UPDATE
                   THRU 3100-LINC-UPDATE-X
           END-IF.

       8100-READ-9176-X.
           EXIT.

      /
      *--------------------
       9000-WRITE-FOOTINGS.
      *--------------------

           PERFORM  9100-WRITE-PRT1-FOOTINGS
               THRU 9100-WRITE-PRT1-FOOTINGS-X.

           PERFORM  9120-WRITE-OCF-FOOTINGS
               THRU 9120-WRITE-OCF-FOOTINGS-X.

       9000-WRITE-FOOTINGS-X.
           EXIT.
      /
      *-------------------------
       9100-WRITE-PRT1-FOOTINGS.
      *-------------------------

      * WRITE BLANK LINE
           MOVE SPACES                  TO WS-PRT1-DETAIL-LINE.
           PERFORM  4300-WRITE-PRT1-DETAIL
               THRU 4300-WRITE-PRT1-DETAIL-X.

      *TEXT: END OF REPORT
           MOVE '00008'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  8000-GET-TEXT-DESC
               THRU 8000-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-PRT1-DETAIL-LINE.
           PERFORM  4300-WRITE-PRT1-DETAIL
               THRU 4300-WRITE-PRT1-DETAIL-X.

       9100-WRITE-PRT1-FOOTINGS-X.
           EXIT.
      /
      *------------------------
       9120-WRITE-OCF-FOOTINGS.
      *------------------------

           MOVE SPACES                  TO WS-OCF-TOTAL-LINE.

      * WRITE BLANK LINE
           MOVE SPACES                  TO L0040-INPUT-LINE.
           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.

      *TEXT: TOTAL RECORDS INPUT  =
           MOVE '00003'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  8000-GET-TEXT-DESC
               THRU 8000-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-OCF-TOTAL-TEXT.
           MOVE WS-TOT-REC-CNTR-IN      TO WS-OCF-TOTAL-CNTR.
           MOVE WS-OCF-TOTAL-LINE       TO L0040-INPUT-LINE.

           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.

HNB403*TEXT: MLJ RECORDS INPUT =
           MOVE '00004'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  8000-GET-TEXT-DESC
               THRU 8000-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-OCF-TOTAL-TEXT.
HNB403*    MOVE WS-REC-CNTR-OUT         TO WS-OCF-TOTAL-CNTR.
HNB403     MOVE WS-REC-CNTR-MLJ-IN      TO WS-OCF-TOTAL-CNTR.
           MOVE WS-OCF-TOTAL-LINE       TO L0040-INPUT-LINE.

           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.
               
HNB403*TEXT: MLJ RECORDS OUTPUT   =
HNB403     MOVE '00010'                 TO WS-TXT-SRC-REF-ID.
HNB403     PERFORM  8000-GET-TEXT-DESC
HNB403         THRU 8000-GET-TEXT-DESC-X.
HNB403     MOVE L2490-TXT-STR-TXT       TO WS-OCF-TOTAL-TEXT.
HNB403     MOVE WS-REC-CNTR-MLJ-OUT     TO WS-OCF-TOTAL-CNTR.
HNB403     MOVE WS-OCF-TOTAL-LINE       TO L0040-INPUT-LINE.
HNB403
HNB403     PERFORM  0040-3000-WRITE-OTHER
HNB403         THRU 0040-3000-WRITE-OTHER-X.

HIS106*TEXT: NON-MLJ RECORDS INPUT =
HIS106     MOVE '00016'                 TO WS-TXT-SRC-REF-ID.
HIS106     PERFORM  8000-GET-TEXT-DESC
HIS106         THRU 8000-GET-TEXT-DESC-X.
HIS106     MOVE L2490-TXT-STR-TXT       TO WS-OCF-TOTAL-TEXT.
HIS106     MOVE WS-REC-CNTR-NON-MLJ-IN  TO WS-OCF-TOTAL-CNTR.
HIS106     MOVE WS-OCF-TOTAL-LINE       TO L0040-INPUT-LINE.
HIS106
HIS106     PERFORM  0040-3000-WRITE-OTHER
HIS106         THRU 0040-3000-WRITE-OTHER-X.
HIS106
HNB403*TEXT: NON-MLJ RECORDS OUTPUT   =
HNB403     MOVE '00011'                 TO WS-TXT-SRC-REF-ID.
HNB403     PERFORM  8000-GET-TEXT-DESC
HNB403         THRU 8000-GET-TEXT-DESC-X.
HNB403     MOVE L2490-TXT-STR-TXT       TO WS-OCF-TOTAL-TEXT.
HNB403     MOVE WS-REC-CNTR-NON-MLJ-OUT TO WS-OCF-TOTAL-CNTR.
HNB403     MOVE WS-OCF-TOTAL-LINE       TO L0040-INPUT-LINE.
HNB403
HNB403     PERFORM  0040-3000-WRITE-OTHER
HNB403         THRU 0040-3000-WRITE-OTHER-X.

      *TEXT: TOTAL ERROR RECORDS  =
           MOVE '00015'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  8000-GET-TEXT-DESC
               THRU 8000-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-OCF-TOTAL-TEXT.
           MOVE WS-PRT1-ERROR-CNTR      TO WS-OCF-TOTAL-CNTR.
           MOVE WS-OCF-TOTAL-LINE       TO L0040-INPUT-LINE.

           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.

      * WRITE BLANK LINE
           MOVE SPACES                  TO L0040-INPUT-LINE.
           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.

      *TEXT: NSBM9076 HAS ENDED
           MOVE '00002'             TO WS-TXT-SRC-REF-ID.
           PERFORM  8000-GET-TEXT-DESC
               THRU 8000-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT   TO L0040-INPUT-LINE.

           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.

       9120-WRITE-OCF-FOOTINGS-X.
           EXIT.
      /
      *-----------------
       9999-CLOSE-FILES.
      *-----------------

           PERFORM  BCF-4000-CLOSE
               THRU BCF-4000-CLOSE-X.

           PERFORM  OCF-4000-CLOSE
               THRU OCF-4000-CLOSE-X.

           PERFORM  PRT1-4000-CLOSE
               THRU PRT1-4000-CLOSE-X.

M119DM*    PERFORM  LNCI-4000-CLOSE
M119DM*        THRU LNCI-4000-CLOSE-X.
M119DM*
M119DM     PERFORM  9176-4000-CLOSE
M119DM         THRU 9176-4000-CLOSE-X.

       9999-CLOSE-FILES-X.
           EXIT.

      /
      *****************************************************************
      * LINK COPYBOOKS
      *****************************************************************
P02229 COPY XCPL0035.

       COPY CCPS0010.
       COPY CCPL0010.
      /
       COPY NCPS0080.
       COPY NCPL0080.
      /
       COPY CCPL0620.
      /
       COPY CCPL0950.
       COPY CCPS0950.
      /
       COPY XCPL0030.
      /
       COPY XCPL0040.
      /
       COPY XCPL0260.
      /
       COPY XCPL0270.
      /
HNB403 COPY XCPL0280.
HNB403/      
       COPY XCPL1640.
      /
HNB403 COPY XCPL1680.
HNB403/
       COPY XCPL2490.
       COPY XCPS2490.
HIS078 COPY NCPS9316.
HIS078 COPY NCPL9316.
      /
       COPY XCPLBCF.
      /
       COPY XCPLOCF.
      /
      *****************************************************************
      *  PROCESSING COPYBOOKS
      *****************************************************************
       COPY CCPPCCC.
      /
       COPY XCPPTIME.
      /
       COPY CCPSPGA.
      /
       COPY XCPPHDG.
      /
      *****************************************************************
      *  FILE I/O COPYBOOKS
      *****************************************************************
       COPY CCPBCCLI.
      /
M119DM*COPY NCPLLNCI.
M119DM*COPY NCPOLNCI.
M119DM*COPY NCPNLNCI.
M119DM/
M119DM COPY XCSLFILE REPLACING ==:ID:==  BY 9176
M119DM                         ==':PGM:'== BY =='ZSRQ9176'==.
M119DM COPY XCSOFILE REPLACING ==:ID:==  BY 9176.
M119DM COPY XCSNSEQ  REPLACING ==:ID:==  BY 9176.
M119DM/
       COPY XCPOBCF.
       COPY XCPNBCF.
      /
       COPY XCPOOCF.
      /
       COPY NCPIPRT1.
      /
       COPY NCPALINC.
       COPY NCPCLINC.
       COPY NCPNLINC.
       COPY NCPULINC.
HNB403 COPY CCPNMAST.
HIS078 COPY NCPBCLUA.

      *****************************************************************
      **                 END OF PROGRAM ZSBM9176                     **
      *****************************************************************
