      *************************
       IDENTIFICATION DIVISION.
      *************************
      *
       PROGRAM-ID. ZSBM9175.
      *
       COPY XCWWCRHT.
      *****************************************************************
      **  MEMBER : ZSBM9175                                          **
      **  REMARKS: LINC REQUEST EXTRACT PROCESSING                   **
      **                                                             **
      **           THIS PROGRAM READS THE LCDM EXTRACT AND WRITES OUT**
      **           LNCX EXTRACT RECORDS.                             **
      **                                                             **
      **  DOMAIN : UW                                                **
      **  CLASS  : PD                                                **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
01NB05**  01AUG01  EKM    NEW FOR LINC REQUEST EXTRACT               **
B00378**  01AUG01  EKM    ADD EDITS FOR MISSING ADDRESS INFORMATION  **
B00476**  01AUG01  EKM    PASS CLI-ID IN EXTRACT.                    **
B00525**  01AUG01  EKM    MISC FIELD POPULATION CHANGES              **
B10024**  01AUG01  EKM    REGISTRATION NUMBER CHANGE                 **
B10026**  01AUG01  EKM    CHANGE CONTRACT DEPT TO '027'              **
B10025**  01AUG01  EKM    DON'T SEND NEIGHBORHOOD WITH ADDRESS INFO. **
B10047**  01AUG01  EKM    RLNCX-ADULT-DISEASE-BNFT-AMT MUST BE VALUED**
B10047**                  WITH THE ADULT DISEASE RIDER FACE AMOUNT.  **
B10048**  01AUG01  EKM    RLNCX-OTHER-DISEASE-BNFT-AMT MUST BE ZERO. **
B10094**  01AUG01  EKM    INCLUDE ADULT INJURY RIDER IN              **
B10094**                  RLNCX-ADB-FACE-AMT.                        **
P00004**  01AUG01  EKM    ONLY INCLUDE ISSUE DATE ON SETTLE RECORD.  **
P00036**  11OCT01  JEB    RETRIEVE REGISTRATION FROM LINC TABLE      **
P00036**                  FOR SETTLE REQUESTS                        **
P00120**  20NOV01  EKM    CREATE TLINC RECORD AT TIME OF APPLICATION **
P00120**                  LINC REQUEST EXTRACT.                      **
P00139**  20NOV01  EKM    REMOVE MESSAGE WHERE INSURED NOT = OWNER.  **
02NB64**  14JUN02  RNL    INTERIM RIDER ADDITIONS                    **
02PR63**  15AUG02  AC     SET UP CORP-INS IND. AND BIRTH DATE FOR    **
02PR63**                  CORP-OWNED                                 **
B01012**  15AUG02  AC     FIXED  CORP-INS IND. 0 FOR PAYROLL DED     **
B10544**  30JUL02  RNL    FIXED LINC INTERFACE ERRORS FOR RIDER      **
B10544**                  ADDITIONS                                  **
B10645**  20AUG02  RNL    FIXED ISSUE DATE ON INTERFACE RECORD       **
PR006C**  26JUN03  AT     ADD MANUMED RIDERS                         **
MM0049**  26JUN03  AT     ADD HOSP-ACC, HOSP-DIS, AND A-DIS TOTALS   **
MM0049**                  TO THE TEST THAT DETERMINES WHETHER OR NOT **
MM0049**                  WE CREATE AN EXTRACT OR AN ERROR MESSAGE   **
MM0085**  26JUN03  AT     FINE TUNE RELATIONSHIP BETWEEN C-TYPE      **
MM0085**                  RIDERS AND CORRESPONDING 30-DAY TYPE RIDERS**
MM0156**  26JUN03  AT     FINE TUNE THE TEST THAT DETERMINES         **
MM0156**                  WHETHER OR NOT WE CREATE AN ERROR MESSAGE  **
MM0156**                  OR AN EXTRACT; PREVIOUSLY WE WERE COMPARING**
MM0156**                  TEXT FIELDS TO PACKED FIELDS               **
MU0035**  26JUN03  AT     IF 30DAY-TYPE HOSP-ACC OR HOSP-DIS IS      **
MU0035**                  SUPERCEDED BY ITS RELATIONSHIP WITH A      **
MU0035**                  C-TYPE COVERAGE THEN REPORT IT ANYWAY      **
P02229**  20OCT04  CY     ADD COMMIT LOGIC TO MAINLINES              **
IPDDUW**  26SEP06  CTS    USE THE PRESENT CONVERTED FACE AMOUNT FOR  **
IPDDUW**                  IPDD RIDERS WHILE ACCUMULATING THE FACE    **  
IPDDUW**                  AMOUNTS FOR THE LIFE COVERAGES             ** 
ABF059**  08JAN07  CTS    FIX DONE FOR INCLUDING PRESENT CONVERTED   **
ABF059**                  FACE AMOUNT OF IP RIDERS IN LINC EXTRACT   **
NWL002**  30JUN09  CTS    CHANGES FOR HARDCODED PRODUCT CODE REMOVAL **
NWLEXT**  26OCT09  CTS    CHANGES TO INCLUDE NWL FACE AMOUNT AND     **
NWLEXT**                  ADB FACE AMOUNT IN THE LINC EXTRACT        **
ATF203**  11DEC09  CTS    CHANGED TO COMMENT THE HARDCODE FOR SMALL  **
ATF203**                  PRODUCT CODE                               **
M119NB**  10NOV09  CTS    6 NEW FIELDS ADDED IN THE EXTRACT          **
ADF228**  18JAN10  CTS    FIX FOR AGE CALCULATION OF NB POLICIES     ** 
ADF235**  27JAN10  CTS    FIX FOR KANJI NAMES IN DOUBLE BYTE         **
ADF236**  02FEB10  CTS    MOVE ZEROS TO DUMMY4                       **
M119DM**  10FEB10  CTS    CHANGES FOR DATA MIGRATION 	             **
UYS001**  20MAY16  CTS    CHANGES DONE AS PART OF UNISYS             **
27676C**  24OCT23  CTS    LINC RECORD CREATION REQUIREMENT CHANGE    **
LNC021**  14MAR24  CTS    CHANGES IN LINC REQUIREMENT LIN-21         **
      *****************************************************************
      *
      **********************
       ENVIRONMENT DIVISION.
      **********************

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       COPY NCSSPRT1.
      /
      ***************
       DATA DIVISION.
      ***************

       FILE SECTION.

       COPY NCSDPRT1.
       COPY NCSRPRT1.
      /
       WORKING-STORAGE SECTION.

       COPY XCWWPGWS REPLACING '$VAR1' BY 'ZSBM9175'.

       COPY SQLCA.

       01  WORK-AREA.
           03  WS-PAGE-CNTR               PIC S9(4)    VALUE +0.
           03  WS-LINE-CNTR               PIC S9(4).
           03  WS-REC-CNTR-IN             PIC S9(9)    VALUE +0.
           03  WS-REC-CNTR-OUT            PIC S9(9)    VALUE +0.
           03  WS-REC-CNTR-DEL            PIC S9(9)    VALUE +0.
           03  WS-ERROR-RECORDS           PIC S9(9)    VALUE +0.
           03  WS-MAX-LINE-CNTR           PIC S9(4)    VALUE +50.
02NB64     03  WS-SUB                     PIC S9(4) COMP.
           03  WS-TXT-SRC-REF-ID          PIC X(05)    VALUE SPACES.
           03  WS-COMPANY-NAME            PIC X(50).
           03  WS-RUN-IND                 PIC X(01)    VALUE 'Y'.
               88  WS-RUN-START                        VALUE 'Y'.
               88  WS-RUN-STOP                         VALUE 'N'.
M119NB     03  WS-LINC-EXISTS-IND         PIC X(01)    VALUE 'N'.
M119NB         88  WS-LINC-EXISTS                      VALUE 'Y'.
M119NB         88  WS-LINC-EXISTS-NO                   VALUE 'N'.
           03  WS-BTH-DT                  PIC X(10).
           03  WS-BTH-DT-R                REDEFINES
               WS-BTH-DT.
               05  WS-BTH-DT-YR           PIC 9(04).
               05  FILLER                 PIC X(01).
               05  WS-BTH-DT-MO           PIC 9(02).
               05  FILLER                 PIC X(01).
               05  WS-BTH-DT-DY           PIC 9(02).
           03  WS-TOT-LIFE-FACE-AMT       PIC S9(13)V9(02).
           03  WS-TOT-LIFE-FACE-AMT-X     REDEFINES
               WS-TOT-LIFE-FACE-AMT       PIC X(16).
           03  WS-TOT-LIFE-ADB-FACE-AMT   PIC S9(13)V9(02).
           03  WS-TOT-LIFE-ADB-FACE-AMT-X REDEFINES
               WS-TOT-LIFE-ADB-FACE-AMT   PIC X(16).
           03  WS-TOT-HOSP-ACC-FACE-AMT   PIC S9(13)V9(02).
           03  WS-TOT-HOSP-ACC-FACE-AMT-X REDEFINES
               WS-TOT-HOSP-ACC-FACE-AMT   PIC X(16).
B10048*    03  WS-TOT-HOSP-LT-FACE-AMT    PIC S9(13)V9(02).
B10048*    03  WS-TOT-HOSP-LT-FACE-AMT-X  REDEFINES
B10048*        WS-TOT-HOSP-LT-FACE-AMT    PIC X(16).
           03  WS-TOT-HOSP-DIS-FACE-AMT   PIC S9(13)V9(02).
           03  WS-TOT-HOSP-DIS-FACE-AMT-X REDEFINES
               WS-TOT-HOSP-DIS-FACE-AMT   PIC X(16).
B10047     03  WS-TOT-HOSP-ADULT-DIS-AMT   PIC S9(13)V9(02).
B10047     03  WS-TOT-HOSP-ADULT-DIS-AMT-X REDEFINES
B10047         WS-TOT-HOSP-ADULT-DIS-AMT   PIC X(16).
PR006C     03  WS-TMP-HOSP-ACC30-FACE-AMT  PIC S9(13)V9(02).
PR006C     03  WS-TMP-HOSP-DIS30-AMT       PIC S9(13)V9(02).
PR006C     03  WS-TMP-HOSP-ADIS30-AMT      PIC S9(13)V9(02).
PR006C     03  WS-TMP-HOSP-C-FACE-AMT      PIC S9(13)V9(02).
PR006C     03  WS-TMP-HOSP-C-ADIS-AMT      PIC S9(13)V9(02).
M119NB     03  WS-INFC-LIFE-DB-FACE-AMT    PIC S9(13)V9(02).
M119NB     03  WS-INFC-HOSP-BNFT-AMT       PIC S9(13)V9(02).
27676C     03  WS-FDIS-HOSP-BNFT-AMT       PIC S9(13)V9(02).
27676C     03  WS-AD-BNFT-AMT              PIC S9(13)V9(02).
27676C     03  WS-IP-BNFT-AMT              PIC S9(13)V9(02).
27676C     03  WS-CNCR-BNFT-AMT            PIC S9(13)V9(02).
27676C     03  WS-HOSP-BNFT-AMT            PIC S9(13)V9(02).
27676C     03  WS-MEDIC-BNFT-QTY           PIC 99.
MM0085*
MM0085* WHEN DECIDING WHAT COMBINATION OF HOSP ACC (30 DAY TYPE)
MM0085* AND C-TYPE FACE AMOUNTS TO SEND, WE HAVE TO CONSIDER 
MM0085* WHETHER OR NOT EITHER OF THE COVERAGES HAS ALREADY BEEN 
MM0085* SENT TO LINK
MM0085*
MM0085     03  WS-HOSP-ACC30-CVG-ISS-EFF-DT  PIC X(10).
MM0085     03  WS-HOSP-DIS30-CVG-ISS-EFF-DT  PIC X(10).
MM0085     03  WS-HOSP-ADIS30-CVG-ISS-EFF-DT PIC X(10).
MM0085     03  WS-HOSP-C-CVG-ISS-EFF-DT      PIC X(10).
MM0085     03  WS-HOSP-C-ADIS-CVG-ISS-EFF-DT PIC X(10).
M00085
           03  WS-ERROR-CD                PIC X(01)    VALUE SPACES.
               88  WS-ERROR-SEVERE            VALUE 'S'.
               88  WS-ERROR-WARNING           VALUE 'W'.
               88  WS-ERROR-NO                VALUE 'N'.
           03  WS-ERROR-TYP-CD   PIC X(04)     VALUE SPACES.
               88  WS-ERROR-TYP-CLI-MISSING   VALUE '0001'.
               88  WS-ERROR-TYP-POL-MISSING   VALUE '0002'.
               88  WS-ERROR-TYP-INVALID-SEX   VALUE '0003'.
               88  WS-ERROR-TYP-KA-NM-MISSING VALUE '0004'.
               88  WS-ERROR-TYP-BR-MISSING    VALUE '0005'.
               88  WS-ERROR-TYP-OWNER-KA-NM   VALUE '0006'.
               88  WS-ERROR-TYP-ADDR-CD       VALUE '0007'.
               88  WS-ERROR-TYP-OWNER         VALUE '0008'.
               88  WS-ERROR-TYP-POL-NOT-PEND  VALUE '0009'.
               88  WS-ERROR-TYP-POL-NOT-PREM  VALUE '0010'.
02NB64         88  WS-ERROR-TYP-POL-NOT-INFORCE VALUE '0016'.
               88  WS-ERROR-TYP-INSRD-DOB-ERR VALUE '0011'.
B00378         88  WS-ERROR-TYP-INSRD-ADDR    VALUE '0012'.
B00378         88  WS-ERROR-TYP-OWNER-ADDR    VALUE '0013'.
               88  WS-ERROR-TYP-FACE-AMT      VALUE '0014'.
P00036         88  WS-ERROR-TYP-REG-NUM       VALUE '0015'.
M119NB         88  WS-ERROR-TYP-KJ-NM-MISSING VALUE '0016'.
M119NB         88  WS-ERROR-TYP-OWNER-KJ-NM   VALUE '0017'.
           03  WS-MSG-REF-INFO.
               10  WS-MSG-REF-ID          PIC X(06).
               10  WS-MSG-REF-NUM         PIC X(04).
B00378     03  WS-TEXT-AREA-1             PIC X(60).
B00378     03  WS-TEXT-AREA-1-R           REDEFINES
B00378         WS-TEXT-AREA-1.
B00378         10  WS-TEXT-AREA-1-X       PIC X(01)
B00378                                    OCCURS 60 TIMES.
B00378     03  WS-FOUND-IND               PIC X(01).
B00378         88  WS-FOUND                   VALUE 'Y'.
B00378         88  WS-FOUND-NO                VALUE 'N'.
M119NB     03  WS-SCHD-POL-ISS-EFF-DT         PIC X(10).
M119NB     03  WS-SCHD-POL-ISS-EFF-DT-R       REDEFINES
M119NB         WS-SCHD-POL-ISS-EFF-DT.
M119NB         10  WS-SCHD-POL-ISS-EFF-DT-YR  PIC 9(04).
M119NB         10  FILLER                     PIC X(01).
M119NB         10  WS-SCHD-POL-ISS-EFF-DT-MO  PIC 9(02).
M119NB         10  FILLER                     PIC X(01).
M119NB         10  WS-SCHD-POL-ISS-EFF-DT-DY  PIC 9(02).
M119NB     03  WS-SCHD-POL-SERV-DT            PIC X(10).
M119NB     03  WS-SCHD-POL-SERV-DT-R          REDEFINES
M119NB         WS-SCHD-POL-SERV-DT.
M119NB         10  WS-SCHD-POL-SERV-DT-YR     PIC 9(04).
M119NB         10  FILLER                     PIC X(01).
M119NB         10  WS-SCHD-POL-SERV-DT-MO     PIC 9(02).
M119NB         10  FILLER                     PIC X(01).
M119NB         10  WS-SCHD-POL-SERV-DT-DY     PIC 9(02).
M119NB     03  WS-LINC-RULE-IND               PIC X(01).
M119NB         88  WS-LINC-RULE-OLD               VALUE '0'.
M119NB         88  WS-LINC-RULE-NEW               VALUE '1'.
27676C         88  WS-LINC-RULE-NEW-2             VALUE '2'.
M119NB     03  WS-LINC-AGE                    PIC 9(03).
M119NB     03  WS-LINC-MAX-LIFE-FACE-AMT      PIC S9(15)V99 COMP-3.
M119NB     03  WS-NEW-DBNFT-AMT               PIC S9(15)V99 COMP-3.
M119NB     03  WS-UNDR-AGE-IND                PIC X(01).
M119NB         88  WS-UNDR-AGE-YES               VALUE '0'.
M119NB         88  WS-UNDR-AGE-NO                VALUE '1'.
ADF235     03  WS-DBCS   VALUE X'8140'       PIC X(02).
ADF235     03  WS-SBCS   VALUE X'2020'       PIC X(02).
ADF235     03  WS-KANJI-NM                   PIC X(60).
ADF235     03  WS-OWNER-KJ-NM                PIC X(60).
27676C     03  WS-LINC-AD-FACE-AMT           PIC S9(15)V99 COMP-3.
27676C     03  WS-RTRNS-NEW-2-DT             PIC X(10).
       COPY NCSWPRT1.

      **** STANDARD HEADING LAYOUT 1ST 2 LINES ****
       COPY XCWWHDG.

       01  WS-HEADING-1              PIC X(132).

       01  WS-HEADING-2              PIC X(132).

       01  WS-REPORT-TITLE.
           03  WS-REPORT-TITLE-1     PIC X(150).

      /
       01  WS-DETAIL-LINE            PIC X(132).

       01  WS-DETAIL-LINE-1  REDEFINES WS-DETAIL-LINE.
           03  FILLER                PIC X(01).
           03  WS-DL1-POL-ID         PIC X(10).
           03  FILLER                PIC X(05).
           03  WS-DL1-CLI-ID         PIC X(10).
           03  FILLER                PIC X(10).
           03  WS-DL1-ERROR-TYP-TEXT PIC X(15).
           03  FILLER                PIC X(02).
           03  WS-DL1-ERROR-TEXT     PIC X(75).

       01  WS-DETAIL-FOOT-1  REDEFINES WS-DETAIL-LINE.
           03  FILLER                PIC X(01).
           03  WS-DF1-TOTAL-TEXT     PIC X(26).
           03  WS-DF1-TOTAL-X        PIC X(20).
           03  FILLER                PIC X(85).

      /
      *****************************************************************
      *    COMMON COPYBOOKS                                           *
      *****************************************************************
       COPY CCWWCCC.
       COPY CCWWINDX.
      /
       COPY XCWLDTLK.
       COPY XCWWTIME.
       COPY XCWWWKDT.
      /
      *****************************************************************
      *    I/O COPYBOOKS                                              *
      *****************************************************************
       COPY CCWWCVGS.
      /
       COPY CCFWCVG.
       COPY CCFRCVG.
      /
       COPY CCFWCCLI.
       COPY CCFRCVGC.
      /
M119NB COPY CCFWCLI.
M119NB COPY CCFRCLI.
M119NB/
M119NB COPY CCFWCWAA.
M119NB COPY CCFRCWAR.
M119NB/
       COPY CCFWPOL.
       COPY CCFRPOL.
      /
M119NB COPY CCFWTRNS.
M119NB COPY CCFRTRNS.
M119NB/
       COPY NCFWCLUA.
       COPY NCFRCLIU.
      /
       COPY NCSRLNCX.
M119DM*COPY NCSWLNCX.
      /
M119DM*COPY NCFWLTRN.
M119DM*COPY NCFRLTRN.
      /
P00036 COPY NCFWLINC.
P00036 COPY NCFRLINC.
 
PR006C COPY CCFWPCOM.
PR006C COPY CCFRPCOM.
      /
       COPY XCSRBCF.
       COPY XCSWBCF.
      /
       COPY XCSROCF.
       COPY XCSWOCF.
      /
NWL002 COPY NCFWTTAB.
NWL002 COPY NCFRTTAB.
NWL002/
NWL002 COPY CCFRPH.
M119DM/
UYS001 COPY CCFRETAB.
UYS001 COPY CCFWETAB.
UYS001/
M119DM COPY ZCSRLCDM.
M119DM COPY XCSWSEQ  REPLACING ==:ID:==    BY    LCDM
M119DM                         ==':ID:'==  BY =='LCDM'==.
M119DM/
M119DM COPY ZCSR9175.
M119DM COPY XCSWSEQ  REPLACING ==:ID:==    BY    9175
M119DM                         ==':ID:'==  BY =='9175'==.
NWL002/
      *****************************************************************
      *    CALLED MODULE PARAMETER INFORMATION                        *
      *****************************************************************
P02229 COPY XCWL0035.

       COPY CCWL0010.
       COPY CCWL0950.
       COPY CCWL2430.
       COPY CCWL2435.
       COPY CCWL2440.
      /
B00378 COPY XCWL0015.
       COPY XCWL0040.
       COPY XCWL0290.
       COPY XCWL1640.
       COPY XCWL1670.
       COPY XCWL1680.
       COPY XCWL2490.
UYS001 COPY XCWL1660.       
      /
       01  WGLOB-GLOBAL-AREA.
       COPY XCWWGLOB.
       COPY XCWTFCMD.

      ********************
       PROCEDURE DIVISION.
      ********************

      *---------------
       0000-MAIN-LINE.
      *---------------


           PERFORM  0100-OPEN-FILES
               THRU 0100-OPEN-FILES-X.

           PERFORM 1000-INITIALIZATION
              THRU 1000-INITIALIZATION-X.

M119DM*
M119DM* PROCESS ALL THE LTRN RECORDS
M119DM*
M119DM*    PERFORM  2000-PROCESS-LINC-REQUEST
M119DM*        THRU 2000-PROCESS-LINC-REQUEST-X
M119DM*       UNTIL WLTRN-IO-EOF OR NOT WLTRN-IO-OK
M119DM*          OR WS-RUN-STOP
M119DM*
M119DM*    PERFORM  LTRN-3000-TBL-END-BROWSE
M119DM*        THRU LTRN-3000-TBL-END-BROWSE-X.
M119DM*        
M119DM* PROCESS ALL THE LCDM RECORDS
M119DM
M119DM     PERFORM  2000-PROCESS-LINC-REQUEST
M119DM         THRU 2000-PROCESS-LINC-REQUEST-X
M119DM        UNTIL WLCDM-SEQ-IO-EOF
M119DM           OR WS-RUN-STOP
M119DM
           PERFORM  3600-WRITE-FOOTINGS
               THRU 3600-WRITE-FOOTINGS-X

      *TEXT: ZSBM9175 HAS ENDED
           MOVE '00002'             TO WS-TXT-SRC-REF-ID
           PERFORM  4700-GET-TEXT-DESC
               THRU 4700-GET-TEXT-DESC-X
           MOVE L2490-TXT-STR-TXT   TO L0040-INPUT-LINE

           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X

           PERFORM  9999-CLOSE-FILES
               THRU 9999-CLOSE-FILES-X.

P02229     PERFORM  0035-1000-COMMIT
P02229         THRU 0035-1000-COMMIT-X.

           STOP RUN.

       0000-MAIN-LINE-X.
           EXIT.
      /
      *----------------
       0100-OPEN-FILES.
      *----------------

           PERFORM  OCF-3000-OPEN-OUTPUT
               THRU OCF-3000-OPEN-OUTPUT-X.

           PERFORM  BCF-1000-OPEN-INPUT
               THRU BCF-1000-OPEN-INPUT-X.

M119DM*    PERFORM  LNCX-3000-OPEN-OUTPUT
M119DM*        THRU LNCX-3000-OPEN-OUTPUT-X.
M119DM*
M119DM     PERFORM  LCDM-1000-OPEN-INPUT
M119DM         THRU LCDM-1000-OPEN-INPUT-X.
M119DM
M119DM     PERFORM  9175-3000-OPEN-OUTPUT
M119DM         THRU 9175-3000-OPEN-OUTPUT-X.
M119DM
           PERFORM  PRT1-3000-OPEN-OUTPUT
               THRU PRT1-3000-OPEN-OUTPUT-X.

       0100-OPEN-FILES-X.
           EXIT.

      /
      *--------------------
       1000-INITIALIZATION.
      *--------------------

           MOVE SPACES                  TO WS-DETAIL-LINE.
           MOVE 'NS9075'                TO WS-MSG-REF-ID.


           PERFORM  CCC-1000-PRCES-CO-CTL-CARD
               THRU CCC-1000-PRCES-CO-CTL-CARD-X.

           PERFORM  4000-INIT-FOR-COMPANY
               THRU 4000-INIT-FOR-COMPANY-X.

           PERFORM  4100-INIT-OCF-TITLES
               THRU 4100-INIT-OCF-TITLES-X.

           PERFORM  4200-INIT-DETAIL-HEADINGS
               THRU 4200-INIT-DETAIL-HEADINGS-X.
M119DM*
M119DM* PERFORM INITIAL BROWSE AND READ
M119DM*
M119DM*    MOVE LOW-VALUES                TO WLTRN-KEY.
M119DM*    MOVE HIGH-VALUES               TO WLTRN-ENDBR-KEY.
M119DM*
M119DM*    PERFORM  LTRN-1000-TBL-BROWSE
M119DM*        THRU LTRN-1000-TBL-BROWSE-X.
M119DM*
M119DM*    PERFORM  LTRN-2000-TBL-READ-NEXT
M119DM*        THRU LTRN-2000-TBL-READ-NEXT-X.
M119DM*
M119DM*    IF  WLTRN-IO-EOF
M119DM*
M119DM*TEXT: LTRN TABLE IS EMPTY.  END-OF-JOB

           PERFORM  LCDM-1000-READ
               THRU LCDM-1000-READ.

           IF  WLCDM-SEQ-IO-EOF
           OR  WS-RUN-STOP
      *TEXT: LCDM INPUT FILE IS EMPTY.  END-OF-JOB
               MOVE '00001'             TO WS-TXT-SRC-REF-ID
               PERFORM  4700-GET-TEXT-DESC
                   THRU 4700-GET-TEXT-DESC-X
               MOVE SPACES              TO L0040-SBSDRY-CO-NAME
               MOVE L2490-TXT-STR-TXT   TO L0040-INPUT-LINE
               PERFORM  0040-2000-WRITE-ERROR
                   THRU 0040-2000-WRITE-ERROR-X
           END-IF.
      
MM0049*
MM0049* GET PCOM LINC VALUES ONCE, THAT WILL BE USED LATER.
MM0049*
MM0049     PERFORM  PCOM-1000-READ
MM0049         THRU PCOM-1000-READ-X.
M119NB     
M119NB     SET WTRNS-PROJ-ID-LINC             TO   TRUE.
M119NB
M119NB     PERFORM  TRNS-1000-READ
M119NB         THRU TRNS-1000-READ-X.
M119NB
27676C     IF NOT WTRNS-IO-OK
27676C        MOVE  WWKDT-HIGH-DT           TO WS-RTRNS-NEW-2-DT
27676C        MOVE  WTRNS-KEY               TO WGLOB-MSG-PARM (1)
27676C*MSG:   'RECORD (@1) NOT FOUND'
27676C        MOVE 'NS90759001'             TO WGLOB-MSG-REF-INFO
27676C        PERFORM  0260-1000-GENERATE-MESSAGE
27676C            THRU 0260-1000-GENERATE-MESSAGE-X
27676C     ELSE
27676C        MOVE  RTRNS-END-DT            TO WS-RTRNS-NEW-2-DT
27676C     END-IF.
27676C
27676C*M119NB    SET WS-LINC-RULE-NEW          TO  TRUE.
27676C*M119NB    IF  WGLOB-PROCESS-DATE  <  RTRNS-STRT-DT
27676C*M119NB        SET WS-LINC-RULE-OLD      TO TRUE
27676C*M119NB    END-IF.
M119NB
 
       1000-INITIALIZATION-X.
           EXIT.

      /
      *-------------------------
       2000-PROCESS-LINC-REQUEST.
      *-------------------------

           ADD +1                       TO WS-REC-CNTR-IN.

      * PROCESS LINC REQUESTS ON PENDING POLICIES.

           PERFORM  2200-WRITE-EXTRACT
               THRU 2200-WRITE-EXTRACT-X.

M119DM* DELETE PROCESSED RECORD.
M119DM*
M119DM*   PERFORM  LTRN-2000-DELETE-WITH-KEY
M119DM*         THRU LTRN-2000-DELETE-WITH-KEY-X
M119DM*    IF  NOT WLTRN-IO-OK
M119DM*MSG:  ABNORMAL RECORD DELETE FORCED JOB CANCEL ON KEY: (@1)
M119DM*        MOVE 'NS90750001'      TO WGLOB-MSG-REF-INFO
M119DM*        MOVE WLTRN-KEY         TO WGLOB-MSG-PARM (1)
M119DM*        PERFORM  0260-1000-GENERATE-MESSAGE
M119DM*            THRU 0260-1000-GENERATE-MESSAGE-X
M119DM*        SET  WS-RUN-STOP       TO TRUE
M119DM*        GO TO 2000-PROCESS-LINC-REQUEST-X
M119DM*    ELSE
M119DM*        ADD 1                  TO WS-REC-CNTR-DEL
M119DM*    END-IF.
M119DM*
M119DM* READ NEXT RECORD.
M119DM*
M119DM*    PERFORM  LTRN-2000-TBL-READ-NEXT
M119DM*        THRU LTRN-2000-TBL-READ-NEXT-X.
M119DM*
M119DM* READ NEXT RECORD.
M119DM
M119DM     PERFORM  LCDM-1000-READ
M119DM         THRU LCDM-1000-READ.
M119DM
       2000-PROCESS-LINC-REQUEST-X.
           EXIT.
      /
      *-------------------------
       2100-WRITE-REPORT-DETAIL.
      *-------------------------

           ADD +1                       TO WS-ERROR-RECORDS.
           SET  WS-ERROR-NO             TO TRUE.

M119DM*    MOVE RLTRN-POL-ID            TO WS-DL1-POL-ID.
M119DM*    MOVE RLTRN-INSRD-CLI-ID      TO WS-DL1-CLI-ID.
M119DM     MOVE RLCDM-POL-ID            TO WS-DL1-POL-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID      TO WS-DL1-CLI-ID.

      *RETRIEVE ERROR TEXT
           MOVE WS-ERROR-TYP-CD         TO WS-MSG-REF-NUM.
           MOVE WS-MSG-REF-INFO         TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.
           MOVE WGLOB-MSG-TXT           TO WS-DL1-ERROR-TEXT.

      *RETRIEVE ERROR TYPE TEXT
           EVALUATE TRUE
               WHEN WGLOB-MSG-SEVRTY-INFO
                    MOVE '00010'        TO WS-TXT-SRC-REF-ID

               WHEN WGLOB-MSG-SEVRTY-WARNING
                    MOVE '00011'        TO WS-TXT-SRC-REF-ID

               WHEN WGLOB-MSG-SEVRTY-FATAL-NO-ROLB
                    MOVE '00012'        TO WS-TXT-SRC-REF-ID
                    SET WS-ERROR-SEVERE TO TRUE

               WHEN WGLOB-MSG-SEVRTY-SYSTEM
                    MOVE '00014'        TO WS-TXT-SRC-REF-ID
                    SET WS-ERROR-SEVERE TO TRUE

               WHEN OTHER
                    MOVE '00013'        TO WS-TXT-SRC-REF-ID
                    SET WS-ERROR-SEVERE TO TRUE
           END-EVALUATE.

           PERFORM  4700-GET-TEXT-DESC
               THRU 4700-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-DL1-ERROR-TYP-TEXT.

           PERFORM  4300-WRITE-REPORT-DETAIL
               THRU 4300-WRITE-REPORT-DETAIL-X.

           MOVE SPACES                  TO WS-DETAIL-LINE.

       2100-WRITE-REPORT-DETAIL-X.
           EXIT.
      /
      *-------------------
       2200-WRITE-EXTRACT.
      *-------------------
       
B00525*    MOVE SPACES                  TO RLNCX-SEQ-REC-INFO.
B00525     MOVE ZEROS                   TO RLNCX-SEQ-REC-INFO.
B00525     MOVE SPACES                  TO RLNCX-CHNG-TYP-CD.
B00525     MOVE SPACES                  TO RLNCX-NAYOSE-KA-NM.
B00525     MOVE SPACES                  TO RLNCX-INSRD-ADDR.
B00525     MOVE SPACES                  TO RLNCX-KATAKANA-NM.
B00525     MOVE SPACES                  TO RLNCX-OWNER-KA-NM.
B00525     MOVE SPACES                  TO RLNCX-OWNER-ADDR
B00525     MOVE SPACES                  TO RLNCX-DUMMY1.
B00525     MOVE SPACES                  TO RLNCX-DUMMY2.
M119NB     MOVE SPACES                  TO RLNCX-KANJI-NM.
M119NB     MOVE SPACES                  TO RLNCX-OWNER-KJ-NM.
M119NB     MOVE SPACES                  TO RLNCX-AGGR-FACE-AMT-IND.
M119NB     MOVE SPACES                  TO RLNCX-KJ-OUT-OF-RNGE-IND.
M119NB     MOVE SPACES                  TO RLNCX-DUMMY3.
M119DM     MOVE SPACES                  TO WS-ERROR-TYP-CD
ADF236*M119NB     MOVE SPACES                  TO RLNCX-DUMMY4.

           SET  WS-ERROR-NO             TO TRUE.

      * READ POLICY RECORD.

M119DM*    MOVE RLTRN-POL-ID            TO WPOL-POL-ID.
M119DM     MOVE RLCDM-POL-ID            TO WPOL-POL-ID.
           PERFORM  POL-1000-READ
               THRU POL-1000-READ-X.
           IF  NOT WPOL-IO-OK
      *MSG: POLICY NOT FOUND.
               SET WS-ERROR-TYP-POL-MISSING TO TRUE
               PERFORM  2100-WRITE-REPORT-DETAIL
                   THRU 2100-WRITE-REPORT-DETAIL-X
               IF  WS-ERROR-SEVERE
                   GO TO 2200-WRITE-EXTRACT-X
               END-IF
           END-IF.
27676C               
27676C     EVALUATE TRUE
27676C         WHEN  WGLOB-PROCESS-DATE  <  RTRNS-STRT-DT
27676C             SET WS-LINC-RULE-OLD     TO TRUE
27676C
27676C         WHEN RPOL-SPCL-AGT-SIGN-DT >= WS-RTRNS-NEW-2-DT
27676C         AND  RPOL-SPCL-AGT-SIGN-DT NOT = WWKDT-ZERO-DT
27676C             SET WS-LINC-RULE-NEW-2   TO TRUE
27676C
LNC021         WHEN RPOL-POL-APP-UPLD-DT  >=  WS-RTRNS-NEW-2-DT
LNC021         AND  RPOL-POL-APP-UPLD-DT NOT = WWKDT-ZERO-DT
LNC021         AND  RPOL-SPCL-AGT-SIGN-DT  = WWKDT-ZERO-DT
LNC021             SET WS-LINC-RULE-NEW-2   TO TRUE
LNC021
27676C         WHEN  OTHER
27676C             SET WS-LINC-RULE-NEW     TO TRUE
27676C     END-EVALUATE.
27676C            
M119DM*IF THE POLICY/INSURED IS ALREADY REGISTERED WITH LIAJ, IT SHOULD 
M119DM*NOT BE EXTRACTED IN LINC EXTRACT FOR DATA MIGRATION
M119DM     SET  WS-LINC-EXISTS-NO           TO TRUE.
M119DM     MOVE RLCDM-INSRD-CLI-ID          TO WLINC-CLI-ID.
M119DM     MOVE RLCDM-POL-ID                TO WLINC-POL-ID.
M119DM
M119DM     PERFORM  LINC-1000-READ
M119DM         THRU LINC-1000-READ-X.
M119DM     IF  WLINC-IO-OK
M119DM         SET  WS-LINC-EXISTS      TO TRUE
M119DM     ELSE
M119DM         SET  WS-LINC-EXISTS-NO   TO TRUE
M119DM     END-IF.
M119DM*POLICY/INSURED ALREADY REGISTERED WITH LIAJ HENCE
M119DM*NOT ELEGIBLE FOR DATA MIGRATION
M119DM     IF  WS-LINC-EXISTS
M119DM         SET WS-ERROR-TYP-FACE-AMT TO TRUE
M119DM         PERFORM  2100-WRITE-REPORT-DETAIL
M119DM             THRU 2100-WRITE-REPORT-DETAIL-X
M119DM         IF  WS-ERROR-SEVERE
M119DM             GO TO 2200-WRITE-EXTRACT-X
M119DM         END-IF
M119DM     END-IF.

      * FOR AN ISSUE REQUEST (1ST TRIGGER) THE POLICY MUST BE PENDING
M119DM*   IF  RLTRN-LTRN-REC-TYP-POL-ISS
M119DM    IF  RLCDM-LCDM-REC-TYP-POL-ISS
           AND NOT RPOL-POL-STAT-PENDING
      *MSG: POLICY NOT PENDING. LINC REQUEST NOT CREATED.
               SET WS-ERROR-TYP-POL-NOT-PEND TO TRUE
               PERFORM  2100-WRITE-REPORT-DETAIL
                   THRU 2100-WRITE-REPORT-DETAIL-X
               IF  WS-ERROR-SEVERE
                   GO TO 2200-WRITE-EXTRACT-X
               END-IF
           END-IF.

      * FOR AN SETTLE REQUEST (2ND TRIGGER) THE POLICY MUST BE PREMIUM
      * PAYING
M119DM*    IF  RLTRN-LTRN-REC-TYP-POL-SETL
M119DM     IF  RLCDM-LCDM-REC-TYP-POL-SETL
           AND NOT RPOL-POL-STAT-PREM-PAY-REG
      *MSG: POLICY NOT PREMIUM PAYING. LINC REQUEST NOT CREATED.
               SET WS-ERROR-TYP-POL-NOT-PREM TO TRUE
               PERFORM  2100-WRITE-REPORT-DETAIL
                   THRU 2100-WRITE-REPORT-DETAIL-X
               IF  WS-ERROR-SEVERE
                   GO TO 2200-WRITE-EXTRACT-X
               END-IF
           END-IF.

M119DM*02NB64* FOR AN INTERIM RIDER ADDITION, THE POLICY MUST BE INFORCE
M119DM*02NB64     IF  (RLTRN-LTRN-REC-TYP-RA-OR   
M119DM*02NB64     OR   RLTRN-LTRN-REC-TYP-RA-BOTH
M119DM*M119NB     OR   RLTRN-LTRN-REC-TYP-UA-PP)
M119DM     IF  (RLCDM-LCDM-REC-TYP-RA-OR   
M119DM     OR   RLCDM-LCDM-REC-TYP-RA-BOTH
M119DM     OR   RLCDM-LCDM-REC-TYP-UA-PP)
02NB64     AND NOT RPOL-POL-STAT-IN-FORCE    
02NB64*MSG: POLICY NOT INFORCE FOR INTERIM RIDER. LINC REQUEST NOT CREATED.
02NB64         SET WS-ERROR-TYP-POL-NOT-INFORCE TO TRUE
02NB64         PERFORM  2100-WRITE-REPORT-DETAIL
02NB64             THRU 2100-WRITE-REPORT-DETAIL-X
02NB64         IF  WS-ERROR-SEVERE
02NB64             GO TO 2200-WRITE-EXTRACT-X
02NB64         END-IF
02NB64     END-IF.

           PERFORM  CVGS-1000-LOAD-CVGS-ARRAY
               THRU CVGS-1000-LOAD-CVGS-ARRAY-X.

      * DATA SECTION
           SET  RLNCX-DATA-SECTN-DATA-REC  TO TRUE.

      * RECORD TYPE
M119DM*    MOVE RLTRN-LTRN-REC-TYP-CD   TO RLNCX-REC-TYP-CD.
M119DM     MOVE RLCDM-LCDM-REC-TYP-CD   TO RLNCX-REC-TYP-CD.

B00525* REGISTRATION NUMBER 49XXXXXXXXXX. THE X'S WILL BE 3 ZEROS
B00525* PLUS THE POL-ID, TO CREATE A UNIQUE NUMBER.
B00525*    MOVE '49000'                 TO RLNCX-REG-NUM (1:5).
B00525*    MOVE RLTRN-POL-ID            TO RLNCX-REG-NUM (6:7).
B10024*    IF  RLNCX-REC-TYP-POL-SETL
B10024*        MOVE '49000'                 TO RLNCX-REG-NUM (1:5)
B10024*        MOVE RLTRN-POL-ID            TO RLNCX-REG-NUM (6:7)
B10024*    END-IF.

P00036*   RETRIEVE REGISTRATION NUMBER FROM LINC RECORD
P00036     IF  RLNCX-REC-TYP-POL-SETL
M119NB     OR  RLNCX-REC-TYP-UA-PI
M119NB     OR  RLNCX-REC-TYP-UA-PR
M119DM*P00036         MOVE RLTRN-POL-ID            TO WLINC-POL-ID
M119DM*P00036         MOVE RLTRN-INSRD-CLI-ID      TO WLINC-CLI-ID
M119DM         MOVE RLCDM-POL-ID            TO WLINC-POL-ID
M119DM         MOVE RLCDM-INSRD-CLI-ID      TO WLINC-CLI-ID
P00036         PERFORM  LINC-1000-READ
P00036             THRU LINC-1000-READ-X
P00036         IF  WLINC-IO-OK
P00036             MOVE RLINC-LINC-REG-ID   TO RLNCX-REG-NUM
P00036         END-IF
P00036     END-IF.

P00036     IF  (RLNCX-REC-TYP-POL-SETL
M119NB     OR  RLNCX-REC-TYP-UA-PI
M119NB     OR  RLNCX-REC-TYP-UA-PR)
P00036     AND RLNCX-REG-NUM = ZEROES
P00036*MSG: REGISTRATION # IS ZEROES
P00036         SET WS-ERROR-TYP-REG-NUM     TO TRUE
P00036         PERFORM  2100-WRITE-REPORT-DETAIL
P00036             THRU 2100-WRITE-REPORT-DETAIL-X
P00036         IF  WS-ERROR-SEVERE
P00036             GO TO 2200-WRITE-EXTRACT-X
P00036         END-IF
P00036     END-IF.

B10544*   CHANGE TYPE CODE FOR INTERIM RIDER ADDITIONS
B10544     IF  RLNCX-REC-TYP-RA-OR
B10544     OR  RLNCX-REC-TYP-RA-BOTH
M119NB     OR  RLNCX-REC-TYP-UA-PP
M119DM*B10544         MOVE RLTRN-POL-ID            TO WLINC-POL-ID
M119DM*B10544         MOVE RLTRN-INSRD-CLI-ID      TO WLINC-CLI-ID
M119DM         MOVE RLCDM-POL-ID            TO WLINC-POL-ID
M119DM         MOVE RLCDM-INSRD-CLI-ID      TO WLINC-CLI-ID
               PERFORM  LINC-1000-READ
                   THRU LINC-1000-READ-X
               IF  WLINC-IO-OK
               AND RLINC-LINC-REG-ID NOT = SPACES
                   MOVE RLINC-LINC-REG-ID   TO RLNCX-REG-NUM
                   MOVE 'U'                 TO RLNCX-CHNG-TYP-CD
               ELSE
                   MOVE 'I'                 TO RLNCX-CHNG-TYP-CD
               END-IF
           END-IF.
      
           IF  RLNCX-REC-TYP-UA-PI
               MOVE SPACES                  TO RLNCX-CHNG-TYP-CD
           END-IF.

      * GET INSURED INFORMATION

           PERFORM  2435-1000-BUILD-PARM-INFO
               THRU 2435-1000-BUILD-PARM-INFO-X.
M119DM*    MOVE RLTRN-INSRD-CLI-ID      TO L2435-CLI-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID      TO L2435-CLI-ID.
           PERFORM  2435-1000-OBTAIN-CLI-INFO
               THRU 2435-1000-OBTAIN-CLI-INFO-X.

           IF  NOT L2435-RETRN-OK
      *MSG: CLIENT NOT FOUND.
               SET WS-ERROR-TYP-CLI-MISSING TO TRUE
               PERFORM  2100-WRITE-REPORT-DETAIL
                   THRU 2100-WRITE-REPORT-DETAIL-X
               IF  WS-ERROR-SEVERE
                   GO TO 2200-WRITE-EXTRACT-X
               END-IF
           END-IF.

           EVALUATE TRUE

               WHEN L2435-CLI-SEX-CD = 'M'
                    SET RLNCX-INSRD-SEX-MALE    TO TRUE

               WHEN L2435-CLI-SEX-CD = 'F'
                    SET RLNCX-INSRD-SEX-FEMALE  TO TRUE

               WHEN OTHER
      *MSG: SEX MUST BE MALE OR FEMALE.
                    SET WS-ERROR-TYP-INVALID-SEX    TO TRUE
                    PERFORM  2100-WRITE-REPORT-DETAIL
                        THRU 2100-WRITE-REPORT-DETAIL-X
                    IF  WS-ERROR-SEVERE
                        GO TO 2200-WRITE-EXTRACT-X
                    END-IF

           END-EVALUATE.

           IF  L2435-CLI-BTH-DT = SPACES
           OR  L2435-CLI-BTH-DT = WWKDT-ZERO-DT
      *MSG: INSURED BIRTH DATE IS NOT KNOWN.
               SET WS-ERROR-TYP-INSRD-DOB-ERR  TO TRUE
               PERFORM  2100-WRITE-REPORT-DETAIL
                   THRU 2100-WRITE-REPORT-DETAIL-X
               IF  WS-ERROR-SEVERE
                   GO TO 2200-WRITE-EXTRACT-X
               END-IF
           ELSE
               MOVE L2435-CLI-BTH-DT           TO WS-BTH-DT
               MOVE WS-BTH-DT-YR               TO RLNCX-INSRD-BTH-DT-YR
               MOVE WS-BTH-DT-MO               TO RLNCX-INSRD-BTH-DT-MO
               MOVE WS-BTH-DT-DY               TO RLNCX-INSRD-BTH-DT-DY
           END-IF.

P00004*    MOVE RPOL-POL-ISS-EFF-DT-YR         TO RLNCX-POL-ISS-DT-YR.
P00004*    MOVE RPOL-POL-ISS-EFF-DT-MO         TO RLNCX-POL-ISS-DT-MO.
P00004*    MOVE RPOL-POL-ISS-EFF-DT-DY         TO RLNCX-POL-ISS-DT-DY.
M119NB*POLICY ISSUE EFF. DATE SHOULD BE MOVED TO LNCX IN CASE OF 
M119NB*RECORD TYPE 28,31 &32
P00004     IF  RLNCX-REC-TYP-POL-SETL
B10645     OR  RLNCX-CHNG-TYP-CD = 'U'
B10645     OR  RLNCX-CHNG-TYP-CD = 'I'
M119NB     OR  RLNCX-REC-TYP-UA-PR
M119NB     OR  RLNCX-REC-TYP-UA-PI
P00004         MOVE RPOL-POL-ISS-EFF-DT-YR     TO RLNCX-POL-ISS-DT-YR
P00004         MOVE RPOL-POL-ISS-EFF-DT-MO     TO RLNCX-POL-ISS-DT-MO
P00004         MOVE RPOL-POL-ISS-EFF-DT-DY     TO RLNCX-POL-ISS-DT-DY
P00004     END-IF.
M119NB*****************************************************************
M119NB* GET CWA RECEIPT DATE AND SCHEDULED POLICY ISSUE EFFECTIVE DATE
M119NB*****************************************************************
M119NB     MOVE LOW-VALUES            TO WCWAA-KEY.
M119NB     MOVE HIGH-VALUES           TO WCWAA-ENDBR-KEY.
M119NB      
M119NB     MOVE RPOL-POL-ID           TO WCWAA-POL-ID 
M119NB                                   WCWAA-ENDBR-POL-ID.
M119NB                                    
M119NB     MOVE WWKDT-LOW-DT          TO WCWAA-RECPT-DT.
M119NB     MOVE WWKDT-HIGH-DT         TO WCWAA-ENDBR-RECPT-DT.
M119NB
M119NB     PERFORM  CWAA-1000-BROWSE
M119NB         THRU CWAA-1000-BROWSE-X.
M119NB
M119NB     IF WCWAA-IO-OK 
M119NB         PERFORM  CWAA-2000-READ-NEXT
M119NB             THRU CWAA-2000-READ-NEXT-X
M119NB         IF WCWAA-IO-OK
M119NB         AND RLNCX-REC-TYP-POL-ISS
M119NB             MOVE RCWAR-RECPT-DT TO WS-SCHD-POL-ISS-EFF-DT
M119NB             MOVE WS-SCHD-POL-ISS-EFF-DT-YR 
M119NB                                 TO RLNCX-SCHD-POL-ISS-EFF-DT-YR
M119NB             MOVE WS-SCHD-POL-ISS-EFF-DT-MO 
M119NB                                 TO RLNCX-SCHD-POL-ISS-EFF-DT-MO
M119NB             MOVE WS-SCHD-POL-ISS-EFF-DT-DY
M119NB                                 TO RLNCX-SCHD-POL-ISS-EFF-DT-DY
M119NB         END-IF
M119NB         PERFORM  CWAA-3000-END-BROWSE
M119NB             THRU CWAA-3000-END-BROWSE-X
M119NB     END-IF.
M119NB*
B10645* WHEN THE CHANGE TYPE IS NO PRIOR REQUEST, WE NEED TO INPUT
B10645* THE COVERAGE ISSUE DATE
B10645*    IF  RLNCX-CHNG-TYP-CD = 'I'
B10645*        PERFORM
B10645*        VARYING WS-SUB FROM 1 BY 1
B10645*        UNTIL  WS-SUB > RPOL-POL-CVG-REC-CTR-N
B10645*
B10645*        IF  WCVGS-CVG-STAT-PENDING (WS-SUB)  
B10645*        AND RPOL-POL-STAT-IN-FORCE
B10645*        AND WCVGS-CVG-APP-RECV-DT (WS-SUB) > RPOL-POL-ISS-EFF-DT
B10645*            MOVE WCVGS-CVG-ISS-EFF-DT-YR (WS-SUB) 
B10645*                                       TO RLNCX-POL-ISS-DT-YR
B10645*            MOVE WCVGS-CVG-ISS-EFF-DT-MO (WS-SUB)                        
B10645*                                       TO RLNCX-POL-ISS-DT-MO
B10645*            MOVE WCVGS-CVG-ISS-EFF-DT-DY (WS-SUB)                       
B10645*                                       TO RLNCX-POL-ISS-DT-DY
B10645*        END-IF
B10645*
B10645*        END-PERFORM
B10645*    END-IF.
B10645*
M119NB*MOVED THE BELOW CODE AFTER CROSS VALIDATION OF AMOUTNS WITH PCOM TABLE
M119NB*B10645* FIND COVERAGE ISSUE DATE TO FILL THE REINSTATE DATE FIELD
M119NB*B10645     MOVE LOW-VALUES                TO WCCLI-KEY.
M119NB*B10645     MOVE RLTRN-INSRD-CLI-ID        TO WCCLI-INSRD-CLI-ID.
M119NB*B10645     MOVE RPOL-POL-ID               TO WCCLI-POL-ID.

M119NB*B10645     MOVE HIGH-VALUES               TO WCCLI-ENDBR-KEY.
M119NB*B10645     MOVE RLTRN-INSRD-CLI-ID        TO WCCLI-ENDBR-INSRD-CLI-ID.
M119NB*B10645     MOVE RPOL-POL-ID               TO WCCLI-ENDBR-POL-ID.

M119NB*B10645     PERFORM  CCLI-1000-BROWSE
M119NB*B10645         THRU CCLI-1000-BROWSE-X.

M119NB*B10645     PERFORM  CCLI-2000-READ-NEXT
M119NB*B10645         THRU CCLI-2000-READ-NEXT-X.

M119NB*B10645     PERFORM  2230-PRCES-CVGS-ISS-DT
M119NB*B10645         THRU 2230-PRCES-CVGS-ISS-DT-X
M119NB*B10645        UNTIL NOT WCCLI-IO-OK
M119NB*B10645           OR     WCCLI-IO-EOF.

M119NB*B10645     PERFORM  CCLI-3000-END-BROWSE
M119NB*B10645         THRU CCLI-3000-END-BROWSE-X.

      * READ CLIU RECORD, TO SEE IF THE INSURED IS THE OWNER

M119DM*    MOVE RLTRN-POL-ID                   TO WCLUA-POL-ID.
M119DM*    MOVE RLTRN-INSRD-CLI-ID             TO WCLUA-CLI-ID.
M119DM     MOVE RLCDM-POL-ID                   TO WCLUA-POL-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID             TO WCLUA-CLI-ID.

           MOVE WCLUA-KEY                      TO WCLUA-ENDBR-KEY.

           PERFORM  CLUA-1000-BROWSE
               THRU CLUA-1000-BROWSE-X.

           PERFORM  CLUA-2000-READ-NEXT
               THRU CLUA-2000-READ-NEXT-X.

           PERFORM
               UNTIL NOT WCLUA-IO-OK
                  OR WCLUA-IO-EOF
                  OR RCLIU-OWNR-REL-INSR-SAME

               PERFORM  CLUA-2000-READ-NEXT
                   THRU CLUA-2000-READ-NEXT-X

           END-PERFORM.

           PERFORM  CLUA-3000-END-BROWSE
               THRU CLUA-3000-END-BROWSE-X.

           IF  WCLUA-IO-OK
           AND RCLIU-OWNR-REL-INSR-SAME
               SET RLNCX-POL-OWNER-INSRD       TO TRUE
           ELSE
               SET RLNCX-POL-OWNER-OTHER       TO TRUE
P00139*        SET WS-ERROR-TYP-OWNER          TO TRUE
P00139*        PERFORM  2100-WRITE-REPORT-DETAIL
P00139*            THRU 2100-WRITE-REPORT-DETAIL-X
P00139*        IF  WS-ERROR-SEVERE
P00139*            GO TO 2200-WRITE-EXTRACT-X
P00139*        END-IF
           END-IF.

      * TRANSMITTING COMPANY
           SET RLNCX-TRNSMT-CO-MCL             TO TRUE.

B00378* GET INSURED'S ADDRESS
B00378
B00378     MOVE L2435-CLI-ID                   TO L2440-CLI-ID.
B00378     MOVE 'PR'                           TO L2440-CLI-ADDR-TYP-CD.
B00378
B00378     PERFORM  2440-1000-PRIMARY-ADDRESS
B00378         THRU 2440-1000-PRIMARY-ADDRESS-X.
B00378
B00378     IF  L2440-RETRN-OK
B00378         PERFORM  2205-PRCES-KA-ADDR-INFO
B00378             THRU 2205-PRCES-KA-ADDR-INFO-X
B00378         MOVE L0015-COMP-AREA-OUT        TO RLNCX-INSRD-ADDR
B00378         IF  L0015-COMP-AREA-OUT NOT = SPACES
B00378             NEXT SENTENCE
B00378         END-IF
B00378*MSG: INSURED ADDRESS MISSING.
B00378         SET WS-ERROR-TYP-INSRD-ADDR TO TRUE
B00378         PERFORM  2100-WRITE-REPORT-DETAIL
B00378             THRU 2100-WRITE-REPORT-DETAIL-X
B00378         IF  WS-ERROR-SEVERE
B00378             GO TO 2200-WRITE-EXTRACT-X
B00378         END-IF
B00378     ELSE
B00378*MSG: INSURED ADDRESS MISSING.
B00378         SET WS-ERROR-TYP-INSRD-ADDR     TO TRUE
B00378         PERFORM  2100-WRITE-REPORT-DETAIL
B00378             THRU 2100-WRITE-REPORT-DETAIL-X
B00378         IF  WS-ERROR-SEVERE
B00378             GO TO 2200-WRITE-EXTRACT-X
B00378         END-IF
B00378     END-IF.

      * CALCULATE THE INSURED BENEFIT AMOUNTS.
           PERFORM  2210-PRCES-INSRD-BNFTS
               THRU 2210-PRCES-INSRD-BNFTS-X.

B00525*    MOVE RPOL-POL-APP-RECV-DT-YR        TO RLNCX-APP-RECV-DT-YR.
B00525*    MOVE RPOL-POL-APP-RECV-DT-MO        TO RLNCX-APP-RECV-DT-MO.
B00525*    MOVE RPOL-POL-APP-RECV-DT-DY        TO RLNCX-APP-RECV-DT-DY.
B00525     MOVE WGLOB-PROCESS-DATE-YR          TO RLNCX-APP-RECV-DT-YR.
B00525     MOVE WGLOB-PROCESS-DATE-MO          TO RLNCX-APP-RECV-DT-MO.
B00525     MOVE WGLOB-PROCESS-DATE-DY          TO RLNCX-APP-RECV-DT-DY.

           IF  L2435-CLI-NM-COMPRESSED = SPACES
      *MSG: NAME MUST BE COMPLETE.
               SET WS-ERROR-TYP-KA-NM-MISSING TO TRUE
               PERFORM  2100-WRITE-REPORT-DETAIL
                   THRU 2100-WRITE-REPORT-DETAIL-X
               IF  WS-ERROR-SEVERE
                   GO TO 2200-WRITE-EXTRACT-X
               END-IF
           ELSE
               MOVE L2435-CLI-NM-COMPRESSED    TO RLNCX-KATAKANA-NM
           END-IF.
M119NB     
M119NB     IF  L2435-CLI-KJ-NM-COMPRESSED = SPACES
M119NB*MSG: KANJI NAME MUST BE COMPLETE.
M119NB         SET WS-ERROR-TYP-KJ-NM-MISSING TO TRUE
M119NB         PERFORM  2100-WRITE-REPORT-DETAIL
M119NB             THRU 2100-WRITE-REPORT-DETAIL-X
M119NB         IF  WS-ERROR-SEVERE
M119NB             GO TO 2200-WRITE-EXTRACT-X
M119NB         END-IF
M119NB     ELSE
M119NB         MOVE L2435-CLI-KJ-NM-COMPRESSED  TO RLNCX-KANJI-NM
ADF235         PERFORM
ADF235         VARYING J FROM 1 BY 2
ADF235         UNTIL J > 60
ADF235     
ADF235         IF  RLNCX-KANJI-NM (J:2) = WS-DBCS OR WS-SBCS
ADF235             MOVE WS-DBCS              TO WS-KANJI-NM(J:2)
ADF235         ELSE
ADF235             MOVE RLNCX-KANJI-NM(J:2)  TO WS-KANJI-NM(J:2)
ADF235         END-IF
ADF235
ADF235         END-PERFORM
ADF235
ADF235     MOVE  WS-KANJI-NM TO  RLNCX-KANJI-NM
ADF235
M119NB     END-IF.
M119NB
      *
      * POLICY MANAGEMENT SECTION
      * =========================

      * BRANCH CODE
B00476*    IF  RPOL-SERV-BR-ID = SPACES
B00476*MSG: BRANCH CODE IS MISSING
B00476*        SET WS-ERROR-TYP-BR-MISSING    TO TRUE
B00476*        PERFORM  2100-WRITE-REPORT-DETAIL
B00476*            THRU 2100-WRITE-REPORT-DETAIL-X
B00476*        IF  WS-ERROR-SEVERE
B00476*            GO TO 2200-WRITE-EXTRACT-X
B00476*        END-IF
B00476*    ELSE
B00476*        MOVE RPOL-SERV-BR-ID            TO RLNCX-BR-CD
B00476*    END-IF.
B00476
B00476* INSURED CLIENT ID
M119DM*B00476     MOVE RLTRN-INSRD-CLI-ID             TO RLNCX-POL-MGMT-CLI-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID             TO RLNCX-POL-MGMT-CLI-ID.

      * SMALL CATEGORY, POLICY NUMBER
B00476*    IF  RLTRN-LTRN-REC-TYP-POL-SETL
B00476*        SET  RLNCX-SMALL-PROD-FTJ       TO TRUE
B00476*        MOVE RLTRN-POL-ID               TO RLNCX-POL-ID
B00476*    END-IF.
ATF203*B00476     SET  RLNCX-SMALL-PROD-FTJ           TO TRUE.
M119DM*B00476     MOVE RLTRN-POL-ID                   TO RLNCX-POL-ID.
M119DM     MOVE RLCDM-POL-ID                   TO RLNCX-POL-ID.

      * WORK AREA CODE
           SET  RLNCX-WORK-AREA-POL-GRPS    TO TRUE.
M119DM* FOR DATE MIGRATION ONLY 100 WOULD BE MOVED TO MOVEMENT CODE
M119DM     MOVE  '100'                      TO RLNCX-EACH-CO1-MVMT-CD.
NWL002*
NWL002* THE HARDCODED PRODUCT CODE IS REPLACED BY PRODUCT CODE 
NWL002* OBTAINED BY BROWSING THE TTAB TABLE.
NWL002     MOVE  RPOL-PLAN-ID               TO WTTAB-ETBL-VALU-ID.
NWL002
NWL002     PERFORM  PRSM-1000-EDIT
NWL002         THRU PRSM-1000-EDIT-X.
NWL002
NWL002     IF  WTTAB-IO-OK
NWL002         MOVE RTTAB-TTBL-VALU-TXT     TO RLNCX-SMALL-PROD-CD
NWL002         MOVE RTTAB-TTBL-VALU-TXT     TO 
NWL002                                     RLNCX-EACH-CO1-SMALL-PROD-CD
NWL002         MOVE RTTAB-TTBL-VALU-TXT     TO 
NWL002                                     RLNCX-EACH-CO2-SMALL-PROD-CD
NWL002     ELSE
NWL002         MOVE SPACES                  TO RLNCX-SMALL-PROD-CD
NWL002         MOVE SPACES                  TO 
NWL002                                     RLNCX-EACH-CO1-SMALL-PROD-CD
NWL002         MOVE SPACES                  TO 
NWL002                                     RLNCX-EACH-CO2-SMALL-PROD-CD
NWL002     END-IF.   
NWL002
      * POLICY HOLDERS NAME (KATAKANA)
B00378     MOVE ZERO                           TO I.
           PERFORM  2430-1000-BUILD-PARM-INFO
               THRU 2430-1000-BUILD-PARM-INFO-X
           PERFORM  2430-2100-GET-OWNER
               THRU 2430-2100-GET-OWNER-X
           IF  NOT L2430-RETRN-OK
      *MSG: OWNER NAME MUST BE COMPLETE.
               SET WS-ERROR-TYP-OWNER-KA-NM   TO TRUE
               PERFORM  2100-WRITE-REPORT-DETAIL
                   THRU 2100-WRITE-REPORT-DETAIL-X
               IF  WS-ERROR-SEVERE
                   GO TO 2200-WRITE-EXTRACT-X
               END-IF
           END-IF

           MOVE L2430-CLI-ID                   TO L2435-CLI-ID
           PERFORM  2435-1000-BUILD-PARM-INFO
               THRU 2435-1000-BUILD-PARM-INFO-X.
           PERFORM  2435-1000-OBTAIN-CLI-INFO
               THRU 2435-1000-OBTAIN-CLI-INFO-X.
           IF  NOT L2435-RETRN-OK
      *MSG: OWNER NAME MUST BE COMPLETE.
               SET WS-ERROR-TYP-OWNER-KA-NM   TO TRUE
               PERFORM  2100-WRITE-REPORT-DETAIL
                   THRU 2100-WRITE-REPORT-DETAIL-X
               IF  WS-ERROR-SEVERE
                   GO TO 2200-WRITE-EXTRACT-X
               END-IF
           END-IF.

           IF  L2435-CLI-NM-COMPRESSED = SPACES
      *MSG: OWNER NAME MUST BE COMPLETE.
               SET WS-ERROR-TYP-OWNER-KA-NM   TO TRUE
               PERFORM  2100-WRITE-REPORT-DETAIL
                   THRU 2100-WRITE-REPORT-DETAIL-X
               IF  WS-ERROR-SEVERE
                   GO TO 2200-WRITE-EXTRACT-X
               END-IF
           ELSE
               MOVE L2435-CLI-NM-COMPRESSED    TO RLNCX-OWNER-KA-NM
           END-IF.
M119NB* POLICY HOLDERS NAME (KANJI)
M119NB     MOVE L2430-CLI-ID                   TO L2435-CLI-ID
M119NB     PERFORM  2435-1000-BUILD-PARM-INFO
M119NB         THRU 2435-1000-BUILD-PARM-INFO-X.
M119NB     PERFORM  2435-1000-OBTAIN-CLI-INFO
M119NB         THRU 2435-1000-OBTAIN-CLI-INFO-X.
M119NB     IF  NOT L2435-RETRN-OK
M119NB*MSG: OWNER KANJI NAME MUST BE COMPLETE.
M119NB         SET WS-ERROR-TYP-OWNER-KJ-NM    TO TRUE
M119NB         PERFORM  2100-WRITE-REPORT-DETAIL
M119NB             THRU 2100-WRITE-REPORT-DETAIL-X
M119NB         IF  WS-ERROR-SEVERE
M119NB             GO TO 2200-WRITE-EXTRACT-X
M119NB         END-IF
M119NB     END-IF.
M119NB
M119NB     IF  L2435-CLI-KJ-NM-COMPRESSED = SPACES
M119NB*MSG: OWNER NAME MUST BE COMPLETE.
M119NB         SET WS-ERROR-TYP-OWNER-KA-NM    TO TRUE
M119NB         PERFORM  2100-WRITE-REPORT-DETAIL
M119NB             THRU 2100-WRITE-REPORT-DETAIL-X
M119NB         IF  WS-ERROR-SEVERE
M119NB             GO TO 2200-WRITE-EXTRACT-X
M119NB         END-IF
M119NB     ELSE
M119NB         MOVE L2435-CLI-KJ-NM-COMPRESSED TO RLNCX-OWNER-KJ-NM
ADF235         PERFORM
ADF235         VARYING J FROM 1 BY 2
ADF235         UNTIL J > 60
ADF235     
ADF235         IF  RLNCX-OWNER-KJ-NM (J:2) = WS-DBCS OR WS-SBCS
ADF235             MOVE WS-DBCS                TO WS-OWNER-KJ-NM(J:2)
ADF235         ELSE
ADF235             MOVE RLNCX-OWNER-KJ-NM(J:2) TO WS-OWNER-KJ-NM(J:2)
ADF235         END-IF
ADF235
ADF235         END-PERFORM
ADF235
ADF235         MOVE  WS-OWNER-KJ-NM TO  RLNCX-OWNER-KJ-NM
ADF235
M119NB     END-IF.
M119NB     
      * NORMAL DEATH FACE AMOUNT
           COMPUTE L0290-INPUT-NUMBER   =  WS-TOT-LIFE-FACE-AMT
                                        *  L0290-CRCY-MULT-FCT.
           MOVE WGLOB-CRCY-SCALE-QTY     TO L0290-PRECISION.
           MOVE 10                       TO L0290-MAX-OUT-LEN.
           SET  L0290-LEAD-ZEROS-DISPLAY TO TRUE.
           SET  L0290-SIGN-SUPPRESS      TO TRUE.
           PERFORM  0290-1000-NUMERIC-FORMAT
               THRU 0290-1000-NUMERIC-FORMAT-X.
           IF  NOT L0290-RETRN-OK
      *MSG: ERROR FORMATTING NUMERIC VALUE (@1) ON POLICY (@2)
               MOVE 'NS90750100'         TO WGLOB-MSG-REF-INFO
               MOVE WS-TOT-LIFE-FACE-AMT-X
                                         TO WGLOB-MSG-PARM (1)
               MOVE WPOL-POL-ID          TO WGLOB-MSG-PARM (2)
               PERFORM  0260-2000-GET-MESSAGE
                   THRU 0260-2000-GET-MESSAGE-X
               MOVE WGLOB-MSG-TXT        TO L0040-INPUT-LINE
               PERFORM  0040-3000-WRITE-OTHER
                   THRU 0040-3000-WRITE-OTHER-X
           ELSE
               MOVE L0290-OUTPUT-DATA    TO RLNCX-NRML-DEATH-FACE-AMT
           END-IF.

MM0049*    IF  RLNCX-NRML-DEATH-FACE-AMT = ZEROS
MM0156*MM0049 IF  RLNCX-NRML-DEATH-FACE-AMT    < RPCOM-LINC-LIFE-FACE-AMT
MM0156*MM0049 AND RLNCX-ACCDNT-HOSP-BNFT-AMT   < RPCOM-LINC-HLTH-FACE-AMT
MM0156*MM0049 AND RLNCX-DISEASE-HOSP-BNFT-AMT  < RPCOM-LINC-HLTH-FACE-AMT
MM0156*MM0049 AND RLNCX-ADULT-DISEASE-BNFT-AMT < RPCOM-LINC-HLTH-FACE-AMT
M119NB*CROSS VALIDATE THE LINC LIFE DB AMT/MEDICAL BENEFIT AMT WITH PCOM LIMIT
M119NB     MOVE ZERO                  TO WS-LINC-AGE.
M119NB     MOVE ZERO                  TO WS-LINC-MAX-LIFE-FACE-AMT.
M119NB     MOVE ZERO                  TO WS-NEW-DBNFT-AMT.
M119NB     MOVE RCVGC-INSRD-CLI-ID    TO WCLI-CLI-ID.
M119NB
M119NB     PERFORM  CLI-1000-READ
M119NB         THRU CLI-1000-READ-X.
M119NB
M119NB     EVALUATE  TRUE 
M119NB
M119NB     WHEN RPOL-POL-STAT-PENDING
M119NB
M119NB     MOVE LOW-VALUES            TO WCWAA-KEY
M119NB     MOVE HIGH-VALUES           TO WCWAA-ENDBR-KEY
M119NB      
M119NB     MOVE RPOL-POL-ID           TO WCWAA-POL-ID 
M119NB                                   WCWAA-ENDBR-POL-ID
M119NB     MOVE WWKDT-LOW-DT          TO WCWAA-RECPT-DT
M119NB     MOVE WWKDT-HIGH-DT         TO WCWAA-ENDBR-RECPT-DT
M119NB
M119NB     PERFORM  CWAA-1000-BROWSE
M119NB         THRU CWAA-1000-BROWSE-X
M119NB
M119NB     IF WCWAA-IO-OK 
M119NB         PERFORM  CWAA-2000-READ-NEXT
M119NB             THRU CWAA-2000-READ-NEXT-X
M119NB         IF  WCWAA-IO-OK
M119NB             MOVE RCWAR-RECPT-DT         TO L1680-INTERNAL-2
M119NB         ELSE
M119NB             MOVE RPOL-POL-APP-UPLD-DT   TO L1680-INTERNAL-2
ADF228         END-IF
M119NB         MOVE RCLI-CLI-BTH-DT        TO L1680-INTERNAL-1
M119NB         PERFORM  1680-2000-COMP-DAYS-BETWEEN
M119NB             THRU 1680-2000-COMP-DAYS-BETWEEN-X
M119NB
M119NB         MOVE L1680-NUMBER-OF-YEARS  TO WS-LINC-AGE
M119NB         IF  WS-LINC-AGE < RPCOM-LINC-AGE-LMT
M119NB             SET WS-UNDR-AGE-YES     TO TRUE
M119NB         ELSE
M119NB             SET WS-UNDR-AGE-NO      TO TRUE 
ADF228         END-IF
ADF228*M119NB         END-IF
ADF228*M119NB     END-IF
M119NB
M119NB         PERFORM  CWAA-3000-END-BROWSE
M119NB             THRU CWAA-3000-END-BROWSE-X
M119NB     END-IF
M119NB
M119NB     WHEN RLNCX-REC-TYP-RA-OR
M119DM*M119NB         SET WS-UNDR-AGE-NO   TO TRUE
M119DM          SET WS-UNDR-AGE-YES  TO TRUE
M119DM          SET WS-LINC-RULE-NEW TO TRUE
M119NB     WHEN RLNCX-REC-TYP-RA-BOTH
M119NB          SET WS-UNDR-AGE-NO  TO TRUE
M119NB
M119NB     WHEN RLNCX-REC-TYP-UA-PP
M119NB          SET WS-UNDR-AGE-YES  TO TRUE
M119NB     WHEN RLNCX-REC-TYP-UA-PI
M119NB          SET WS-UNDR-AGE-YES  TO TRUE
M119NB     WHEN RLNCX-REC-TYP-UA-PR
M119NB          SET WS-UNDR-AGE-YES  TO TRUE
M119NB            
M119NB     END-EVALUATE.
M119NB
M119NB     IF  WS-LINC-RULE-OLD
M119NB         MOVE RPCOM-LINC-LIFE-FACE-AMT  
M119NB                                     TO WS-LINC-MAX-LIFE-FACE-AMT
M119NB     ELSE
M119NB         IF  WS-UNDR-AGE-YES
M119NB             MOVE RPCOM-UNDR15-LINC-FACE-AMT
M119NB                                     TO WS-LINC-MAX-LIFE-FACE-AMT
M119NB         ELSE
M119NB             MOVE RPCOM-LINC-LIFE-FACE-AMT    
M119NB                                     TO WS-LINC-MAX-LIFE-FACE-AMT
M119NB         END-IF
M119NB     END-IF.
27676C*M119NB     IF  WS-LINC-RULE-NEW
27676C*M119NB     AND WS-UNDR-AGE-YES
27676C*M119NB         COMPUTE WS-NEW-DBNFT-AMT = WS-TOT-LIFE-FACE-AMT
27676C*M119NB                                  + WS-TOT-LIFE-ADB-FACE-AMT
27676C*M119NB     ELSE
27676C*M119NB         MOVE  WS-TOT-LIFE-FACE-AMT  TO   WS-NEW-DBNFT-AMT
27676C*M119NB     END-IF.
27676C
27676C     IF  WS-LINC-RULE-NEW-2
27676C     AND WS-UNDR-AGE-NO
27676C         MOVE RPCOM-LINC-AD-FACE-AMT  TO WS-LINC-AD-FACE-AMT
27676C     END-IF.
27676C
27676C     EVALUATE TRUE
27676C         WHEN  WS-LINC-RULE-NEW
27676C         AND WS-UNDR-AGE-YES
27676C             COMPUTE WS-NEW-DBNFT-AMT = WS-TOT-LIFE-FACE-AMT
27676C                                  + WS-TOT-LIFE-ADB-FACE-AMT
27676C
27676C         WHEN  WS-LINC-RULE-NEW-2
27676C         AND WS-UNDR-AGE-YES
27676C             COMPUTE WS-NEW-DBNFT-AMT = WS-TOT-LIFE-FACE-AMT
27676C                                  + WS-TOT-LIFE-ADB-FACE-AMT 
27676C                                  + WS-AD-BNFT-AMT
27676C
27676C         WHEN OTHER
27676C         MOVE  WS-TOT-LIFE-FACE-AMT  TO   WS-NEW-DBNFT-AMT
27676C     END-EVALUATE.
MM0156
M119NB*MM0156     IF  WS-TOT-LIFE-FACE-AMT       < RPCOM-LINC-LIFE-FACE-AMT
M119DM*M119NB     IF  WS-NEW-DBNFT-AMT           < WS-LINC-MAX-LIFE-FACE-AMT
M119DM*MM0156     AND WS-TOT-HOSP-ACC-FACE-AMT   < RPCOM-LINC-HLTH-FACE-AMT
M119DM*MM0156     AND WS-TOT-HOSP-DIS-FACE-AMT   < RPCOM-LINC-HLTH-FACE-AMT
M119DM*MM0156     AND WS-TOT-HOSP-ADULT-DIS-AMT  < RPCOM-LINC-HLTH-FACE-AMT
M119DM*M119NB     AND NOT RLNCX-REC-TYP-UA-PR
M119DM*MM0049*MSG: MINIMUM AMOUNTS REQUIRED
M119DM*IF DEATH BENEFIT AMOUNT + ACCIDENTAL DEATH BENEFIT AMOUNT IS LESS
M119DM*THAN 5 MILLION YEN THEN INSURED/POLICY NOT ELIGIBLE FOR DATA MIGRATION
M119DM     IF  WS-NEW-DBNFT-AMT           < WS-LINC-MAX-LIFE-FACE-AMT
M119DM         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
M119DM     END-IF.
M119DM*IF DEATH BENEFIT AMOUNT IS GREATER THAN 30 MILLION YEN, THEN 
M119DM*INSURED/POLICY IS NOT ELIGIBLE FOR DATA MIGRATION
M119DM     IF  WS-TOT-LIFE-FACE-AMT       >= RPCOM-LINC-LIFE-FACE-AMT
M119DM         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
M119DM     END-IF.
M119DM*IF ACCIDENTAL HOSPITALISATION BENEFIT AMOUNT IS GREATER THAN 5000 
M119DM*YEN,THEN INSURED/POLICY IS NOT ELIGIBLE FOR DATA MIGRATION
M119DM     IF  WS-TOT-HOSP-ACC-FACE-AMT   >= RPCOM-LINC-HLTH-FACE-AMT
M119DM         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
M119DM     END-IF.
M119DM*IF HOSPITALISATION DESEASE BENEFIT AMOUNT IS GREATER THAN 5000
M119DM*YEN,THEN INSURED/POLICY IS NOT ELIGIBLE FOR DATA MIGRATION
M119DM     IF  WS-TOT-HOSP-DIS-FACE-AMT   >= RPCOM-LINC-HLTH-FACE-AMT
M119DM         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
M119DM     END-IF.
M119DM*IF HOSPITALISATION ADULT DESEASE BENEFIT AMOUNT IS GREATER THAN
M119DM*5000 YEN,THEN INSURED/POLICY IS NOT ELIGIBLE FOR DATA MIGRATION
M119DM     IF  WS-TOT-HOSP-ADULT-DIS-AMT  >= RPCOM-LINC-HLTH-FACE-AMT
M119DM         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
M119DM     END-IF.
27676C
27676C     IF  WS-FDIS-HOSP-BNFT-AMT >= RPCOM-LINC-HLTH-FACE-AMT
27676C         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
27676C     END-IF.
27676C
27676C     IF  WS-CNCR-BNFT-AMT >= RPCOM-LINC-CNCR-FACE-AMT
27676C         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
27676C     END-IF.
27676C
27676C     IF  WS-HOSP-BNFT-AMT >= RPCOM-LINC-HOSP-FACE-AMT
27676C         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
27676C     END-IF.
27676C
27676C     IF  WS-MEDIC-BNFT-QTY  >= RPCOM-LINC-MEDIC-BNFT-QTY
27676C         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
27676C     END-IF.
27676C
27676C     IF  WS-AD-BNFT-AMT  >= WS-LINC-AD-FACE-AMT
27676C         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
27676C     END-IF.
27676C
27676C     IF  WS-IP-BNFT-AMT  >= RPCOM-LINC-IP-FACE-AMT
27676C         SET WS-ERROR-TYP-FACE-AMT  TO TRUE
27676C     END-IF.
27676C
M119DM     IF  WS-ERROR-TYP-FACE-AMT
M119DM         PERFORM  2100-WRITE-REPORT-DETAIL
M119DM             THRU 2100-WRITE-REPORT-DETAIL-X
M119DM         IF  WS-ERROR-SEVERE
M119DM             GO TO 2200-WRITE-EXTRACT-X
M119DM         END-IF
           ELSE
               MOVE L2435-CLI-NM-COMPRESSED    TO RLNCX-OWNER-KA-NM
           END-IF.
M119NB
M119NB     IF  RLNCX-REC-TYP-UA-PR
M119NB         IF  WS-NEW-DBNFT-AMT         <WS-LINC-MAX-LIFE-FACE-AMT
M119NB         AND WS-TOT-HOSP-ACC-FACE-AMT <RPCOM-LINC-HLTH-FACE-AMT
M119NB         AND WS-TOT-HOSP-DIS-FACE-AMT <RPCOM-LINC-HLTH-FACE-AMT
M119NB         AND WS-TOT-HOSP-ADULT-DIS-AMT <RPCOM-LINC-HLTH-FACE-AMT
M119NB             MOVE 'D'                 TO RLNCX-CHNG-TYP-CD
M119NB         ELSE
M119NB             MOVE 'U'                 TO RLNCX-CHNG-TYP-CD
M119NB         END-IF
M119NB     END-IF.
M119NB
M119NB* FIND COVERAGE ISSUE DATE TO FILL THE REINSTATE DATE FIELD
M119NB     MOVE LOW-VALUES                TO WCCLI-KEY.
M119DM*M119NB    MOVE RLTRN-INSRD-CLI-ID        TO WCCLI-INSRD-CLI-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID        TO WCCLI-INSRD-CLI-ID.
M119NB     MOVE RPOL-POL-ID               TO WCCLI-POL-ID.

M119NB     MOVE HIGH-VALUES               TO WCCLI-ENDBR-KEY.
M119DM*M119NB    MOVE RLTRN-INSRD-CLI-ID        TO WCCLI-ENDBR-INSRD-CLI-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID        TO WCCLI-ENDBR-INSRD-CLI-ID.
M119NB     MOVE RPOL-POL-ID               TO WCCLI-ENDBR-POL-ID.

M119NB     PERFORM  CCLI-1000-BROWSE
M119NB         THRU CCLI-1000-BROWSE-X.

M119NB     PERFORM  CCLI-2000-READ-NEXT
M119NB         THRU CCLI-2000-READ-NEXT-X.

M119NB     PERFORM  2230-PRCES-CVGS-ISS-DT
M119NB         THRU 2230-PRCES-CVGS-ISS-DT-X
M119NB        UNTIL NOT WCCLI-IO-OK
M119NB           OR     WCCLI-IO-EOF.

M119NB     PERFORM  CCLI-3000-END-BROWSE
M119NB         THRU CCLI-3000-END-BROWSE-X.
MU0035*
MU0035* AT THIS POINT WE HAVE CONSIDERED THE RELATIONSHIP BETWEEN
MU0035* 30DAY-TYPE-HOSP-ACC AND 30DAY-TYPE-HOSP-DIS COVERAGES 
MU0035* AND THE C-TYPE-HOSP COVERAGE TO DETERMINE WHETHER OR NOT    
MU0035* OR NOT A LINC EXTRACT IS REQUIRED,
MU0035* IF EITHER OF THE 30DAY AMOUNTS HAS BEEN SUPPRESSED TO DATE BECAUSE
MU0035* OF ITS RELATIONSHIP WITH THE C-TYPE AMOUNT, THEN THE CLIENT WANTS
MU0035* US TO REPORT THE 30DAY-TYPE AMOUNT ANYWAY.
MU0035*
MU0035     IF  RLNCX-ACCDNT-HOSP-BNFT-AMT  =  ZERO 
MU0035     AND WS-TMP-HOSP-C-FACE-AMT      >  ZERO
MU0035     AND WS-TMP-HOSP-ACC30-FACE-AMT  >= RPCOM-LINC-HLTH-FACE-AMT
MU0035         COMPUTE L0290-INPUT-NUMBER   = WS-TMP-HOSP-ACC30-FACE-AMT
MU0035                                      * L0290-CRCY-MULT-FCT
MU0035         MOVE WGLOB-CRCY-SCALE-QTY     TO L0290-PRECISION
MU0035         MOVE 5                        TO L0290-MAX-OUT-LEN
MU0035         SET  L0290-LEAD-ZEROS-DISPLAY TO TRUE
MU0035         SET  L0290-SIGN-SUPPRESS      TO TRUE
MU0035         PERFORM  0290-1000-NUMERIC-FORMAT
MU0035             THRU 0290-1000-NUMERIC-FORMAT-X
MU0035         IF  NOT L0290-RETRN-OK
MU0035*MSG: ERROR FORMATTING NUMERIC VALUE (@1) ON POLICY (@2)
MU0035             MOVE 'NS90750100'         TO WGLOB-MSG-REF-INFO
MU0035             MOVE WS-TOT-HOSP-ACC-FACE-AMT-X
MU0035                                       TO WGLOB-MSG-PARM (1)
MU0035             MOVE WPOL-POL-ID          TO WGLOB-MSG-PARM (2)
MU0035             PERFORM  0260-2000-GET-MESSAGE
MU0035             THRU 0260-2000-GET-MESSAGE-X
MU0035             MOVE WGLOB-MSG-TXT        TO L0040-INPUT-LINE
MU0035             PERFORM  0040-3000-WRITE-OTHER
MU0035                 THRU 0040-3000-WRITE-OTHER-X
MU0035         ELSE
MU0035             MOVE L0290-OUTPUT-DATA 
MU0035             TO   RLNCX-ACCDNT-HOSP-BNFT-AMT
MU0035         END-IF
MU0035     END-IF.
MU0035 
MU0035     IF  RLNCX-DISEASE-HOSP-BNFT-AMT =  ZERO 
MU0035     AND WS-TMP-HOSP-C-FACE-AMT      >  ZERO
MU0035     AND WS-TMP-HOSP-DIS30-AMT       >= RPCOM-LINC-HLTH-FACE-AMT
MU0035         COMPUTE L0290-INPUT-NUMBER   = WS-TMP-HOSP-DIS30-AMT
MU0035                                      * L0290-CRCY-MULT-FCT
MU0035         MOVE WGLOB-CRCY-SCALE-QTY     TO L0290-PRECISION
MU0035         MOVE 5                        TO L0290-MAX-OUT-LEN
MU0035         SET  L0290-LEAD-ZEROS-DISPLAY TO TRUE
MU0035         SET  L0290-SIGN-SUPPRESS      TO TRUE
MU0035         PERFORM  0290-1000-NUMERIC-FORMAT
MU0035             THRU 0290-1000-NUMERIC-FORMAT-X
MU0035         IF  NOT L0290-RETRN-OK
MU0035*MSG: ERROR FORMATTING NUMERIC VALUE (@1) ON POLICY (@2)
MU0035             MOVE 'NS90750100'         TO WGLOB-MSG-REF-INFO
MU0035             MOVE WS-TOT-HOSP-ACC-FACE-AMT-X
MU0035                                       TO WGLOB-MSG-PARM (1)
MU0035             MOVE WPOL-POL-ID          TO WGLOB-MSG-PARM (2)
MU0035             PERFORM  0260-2000-GET-MESSAGE
MU0035             THRU 0260-2000-GET-MESSAGE-X
MU0035             MOVE WGLOB-MSG-TXT        TO L0040-INPUT-LINE
MU0035             PERFORM  0040-3000-WRITE-OTHER
MU0035                 THRU 0040-3000-WRITE-OTHER-X
MU0035         ELSE
MU0035             MOVE L0290-OUTPUT-DATA 
MU0035             TO   RLNCX-DISEASE-HOSP-BNFT-AMT
MU0035         END-IF
MU0035     END-IF.
 
      * ACCIDENTAL DEATH FACE AMOUNT
           COMPUTE L0290-INPUT-NUMBER   =  WS-TOT-LIFE-ADB-FACE-AMT
                                        *  L0290-CRCY-MULT-FCT.
           MOVE WGLOB-CRCY-SCALE-QTY     TO L0290-PRECISION.
           MOVE 10                       TO L0290-MAX-OUT-LEN.
           SET  L0290-LEAD-ZEROS-DISPLAY TO TRUE.
           SET  L0290-SIGN-SUPPRESS      TO TRUE.
           PERFORM  0290-1000-NUMERIC-FORMAT
               THRU 0290-1000-NUMERIC-FORMAT-X.
           IF  NOT L0290-RETRN-OK
      *MSG: ERROR FORMATTING NUMERIC VALUE (@1) ON POLICY (@2)
               MOVE 'NS90750100'         TO WGLOB-MSG-REF-INFO
               MOVE WS-TOT-LIFE-ADB-FACE-AMT-X
                                         TO WGLOB-MSG-PARM (1)
               MOVE WPOL-POL-ID          TO WGLOB-MSG-PARM (2)
               PERFORM  0260-2000-GET-MESSAGE
                   THRU 0260-2000-GET-MESSAGE-X
               MOVE WGLOB-MSG-TXT        TO L0040-INPUT-LINE
               PERFORM  0040-3000-WRITE-OTHER
                   THRU 0040-3000-WRITE-OTHER-X
           ELSE
               MOVE L0290-OUTPUT-DATA    TO RLNCX-ADB-FACE-AMT
           END-IF.

      *
      * EACH SECTION
      * ============

B00476*    MOVE RPOL-SERV-BR-ID         TO RLNCX-EACH-CO1-BR-CD.

B00476*    MOVE RLTRN-POL-ID            TO RLNCX-EACH-CO1-MCL-REG-NUM.
B00476
B00476* INSURED CLIENT ID
M119DM*B00476     MOVE RLTRN-INSRD-CLI-ID      TO RLNCX-EACH-CO1-CLI-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID      TO RLNCX-EACH-CO1-CLI-ID.

      * SMALL CATEGORY, POLICY NUMBER
B00476*    IF  RLTRN-LTRN-REC-TYP-POL-SETL
B00476*        SET  RLNCX-EACH-CO1-SMALL-PROD-FTJ TO TRUE
B00476*    END-IF.
ATF203*B00476     SET  RLNCX-EACH-CO1-SMALL-PROD-FTJ   TO TRUE.

M119DM*    MOVE RLTRN-POL-ID            TO RLNCX-EACH-CO1-POL-ID.
M119DM     MOVE RLCDM-POL-ID            TO RLNCX-EACH-CO1-POL-ID.

           SET  RLNCX-CO1-WORK-AREA-POL-GRPS    TO TRUE.

      * POLICY HOLDER GENDER
           EVALUATE TRUE

               WHEN L2435-CLI-SEX-CD = 'M'
                    SET RLNCX-OWNER-SEX-MALE    TO TRUE

               WHEN L2435-CLI-SEX-CD = 'F'
                    SET RLNCX-OWNER-SEX-FEMALE  TO TRUE

02PR63         WHEN L2435-CLI-SEX-CD = 'C'
02PR63              MOVE '3' TO RLNCX-OWNER-SEX-CD
               WHEN OTHER
      *MSG: SEX MUST BE MALE OR FEMALE.
                    SET WS-ERROR-TYP-INVALID-SEX    TO TRUE
                    PERFORM  2100-WRITE-REPORT-DETAIL
                        THRU 2100-WRITE-REPORT-DETAIL-X
                    IF  WS-ERROR-SEVERE
                        GO TO 2200-WRITE-EXTRACT-X
                    END-IF

           END-EVALUATE.

           MOVE L2435-CLI-BTH-DT               TO WS-BTH-DT.
           MOVE WS-BTH-DT-YR                   TO RLNCX-OWNER-BTH-DT-YR.
           MOVE WS-BTH-DT-MO                   TO RLNCX-OWNER-BTH-DT-MO.
           MOVE WS-BTH-DT-DY                   TO RLNCX-OWNER-BTH-DT-DY.
02PR63     IF L2435-CLI-SEX-CD = 'C'
02PR63*** move all 9's to the birth date and set Corporate Insurance Flag on
02PR63       MOVE '99999999'    TO RLNCX-OWNER-BTH-DT
B01012** FOR PAYROLL DEDUCTION , MOVE '0' TO CORP-INS-IND
B01012       IF RPOL-POL-BILL-TYP-LIST-BILL
B01012           MOVE '0' TO RLNCX-CORP-INS-IND
B01012       ELSE
B01012           SET RLNCX-CORP-INS    TO TRUE
B01012       END-IF
02PR63     END-IF.

B00378* GET OWNERS'S ADDRESS
B00378
           MOVE L2430-CLI-ID                   TO L2440-CLI-ID.
           MOVE L2430-CLI-ADDR-TYP-CD          TO L2440-CLI-ADDR-TYP-CD.

           IF  L2440-CLI-ADDR-TYP-CD  =  'PR'
               PERFORM  2440-1000-PRIMARY-ADDRESS
                   THRU 2440-1000-PRIMARY-ADDRESS-X
           ELSE
               PERFORM  2440-2000-OTHER-ADDRESS
                   THRU 2440-2000-OTHER-ADDRESS-X
           END-IF.

B00378     IF  L2440-RETRN-OK
B00378         PERFORM  2205-PRCES-KA-ADDR-INFO
B00378             THRU 2205-PRCES-KA-ADDR-INFO-X
B00378         MOVE L0015-COMP-AREA-OUT      TO RLNCX-OWNER-ADDR
B00378         IF  L0015-COMP-AREA-OUT NOT = SPACES
B00378             NEXT SENTENCE
B00378         END-IF
B00378*MSG: OWNER ADDRESS MISSING.
B00378         SET WS-ERROR-TYP-OWNER-ADDR   TO TRUE
B00378         PERFORM  2100-WRITE-REPORT-DETAIL
B00378             THRU 2100-WRITE-REPORT-DETAIL-X
B00378         IF  WS-ERROR-SEVERE
B00378             GO TO 2200-WRITE-EXTRACT-X
B00378         END-IF
B00378     END-IF.

      * ADDRESS CODE
           IF  NOT L2440-RETRN-OK
B00525*    OR  L2440-CLI-PSTL-CD = SPACES
B00525*    OR  L2440-CLI-PSTL-CD = '00000000'
B00525     OR  L2440-CLI-ADDR-LOC-CD = SPACES
B00525     OR  L2440-CLI-ADDR-LOC-CD = '00000000'
      *MSG: ADDRESS CODE MISSING
               SET WS-ERROR-TYP-ADDR-CD       TO TRUE
               PERFORM  2100-WRITE-REPORT-DETAIL
                   THRU 2100-WRITE-REPORT-DETAIL-X
               IF  WS-ERROR-SEVERE
                   GO TO 2200-WRITE-EXTRACT-X
               END-IF
           END-IF.

B00525*    MOVE L2440-CLI-PSTL-CD         TO RLNCX-ADDR-CD.
B00525     MOVE L2440-CLI-ADDR-LOC-CD     TO RLNCX-ADDR-CD.
           MOVE '000'                     TO RLNCX-ADDR-CD-6-8.

      * OPERATION CODE
M119DM*    IF  RLTRN-LTRN-REC-TYP-POL-ISS
M119DM     IF  RLCDM-LCDM-REC-TYP-POL-ISS
               SET  RLNCX-OPER-NB             TO TRUE
               SET  RLNCX-WORK-AREA-NB        TO TRUE
           ELSE
               SET  RLNCX-OPER-SETL           TO TRUE
               SET  RLNCX-WORK-AREA-SETL      TO TRUE
           END-IF.

      *
      * EACH SECTION 2
      * ==============

B00476*    MOVE RPOL-SERV-BR-ID         TO RLNCX-EACH-CO2-BR-CD.

B00476*    MOVE RLTRN-POL-ID            TO RLNCX-EACH-CO2-MCL-REG-NUM.
B00476
B00476* INSURED CLIENT ID
M119DM*B00476     MOVE RLTRN-INSRD-CLI-ID      TO RLNCX-EACH-CO2-CLI-ID.

      * SMALL CATEGORY, POLICY NUMBER
B00476*    IF  RLTRN-LTRN-REC-TYP-POL-SETL
B00476*        SET  RLNCX-EACH-CO2-SMALL-PROD-FTJ TO TRUE
B00476*    END-IF.
ATF203*B00476     SET  RLNCX-EACH-CO2-SMALL-PROD-FTJ TO TRUE.

M119DM*    MOVE RLTRN-POL-ID            TO RLNCX-EACH-CO2-POL-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID      TO RLNCX-EACH-CO2-CLI-ID.
M119DM     MOVE RLCDM-POL-ID            TO RLNCX-EACH-CO2-POL-ID.

           SET  RLNCX-CO2-WORK-AREA-POL-GRPS TO TRUE.

M119DM*
M119DM* WRITE THE EXTRACT RECORD
M119DM*
M119DM*    PERFORM  LNCX-1000-WRITE
M119DM*        THRU LNCX-1000-WRITE-X.
M119DM*
M119DM     MOVE RLNCX-SEQ-REC-INFO          TO R9175-SEQ-REC-INFO
M119DM*
M119DM* WRITE THE EXTRACT RECORD
M119DM*
M119DM     PERFORM  9175-1000-WRITE
M119DM         THRU 9175-1000-WRITE-X.
M119DM
           ADD +1                       TO WS-REC-CNTR-OUT.
P00120*
P00120* FOR THE APPLICATION LINC REQUEST, CREATE THE TLINC RECORD.
P00120*
M119DM*P00120     IF  RLTRN-LTRN-REC-TYP-POL-ISS
B10544*    OR  RLTRN-LTRN-REC-TYP-RA-OR  
B10544*    OR  RLTRN-LTRN-REC-TYP-RA-BOTH
M119DM*M119NB     OR  RLTRN-LTRN-REC-TYP-UA-PP
M119DM     IF  RLCDM-LCDM-REC-TYP-POL-ISS
M119DM     OR  RLCDM-LCDM-REC-TYP-UA-PP
P00120         PERFORM  2500-WRITE-TLINC
P00120             THRU 2500-WRITE-TLINC-X
P00120     END-IF.

       2200-WRITE-EXTRACT-X.
           EXIT.
B00378/
B00378*------------------------
B00378 2205-PRCES-KA-ADDR-INFO.
B00378*------------------------
B00378
B00378     MOVE  L2440-CLI-KA-PREFCT-TXT TO L0015-COMP-AREA-IN-FIRST.
B00378     MOVE  L2440-CLI-KA-CITY-TXT   TO L0015-COMP-AREA-IN-LAST.
B00378     PERFORM  0015-1000-COMPRESS-BLANKS
B00378         THRU 0015-1000-COMPRESS-BLANKS-X.
B10025*    MOVE L0015-COMP-AREA-OUT      TO WS-TEXT-AREA-1.
B10025*
B10025*    SET WS-FOUND-NO               TO TRUE.
B10025*
B10025*    PERFORM
B10025*        VARYING I FROM 60 BY -1
B10025*        UNTIL I <= 0
B10025*        OR WS-FOUND
B10025*           IF  WS-TEXT-AREA-1-X (I) NOT = SPACES
B10025*               SET WS-FOUND TO TRUE
B10025*           END-IF
B10025*    END-PERFORM.
B10025*
B10025*    IF  I <= 30
B10025*        MOVE L0015-COMP-AREA-OUT  TO L0015-COMP-AREA-IN-FIRST
B10025*        MOVE L2440-CLI-KA-NGHBRHD-TXT
B10025*                                  TO L0015-COMP-AREA-IN-LAST
B10025*        PERFORM  0015-1000-COMPRESS-BLANKS
B10025*            THRU 0015-1000-COMPRESS-BLANKS-X
B10025*    END-IF.
B00378
B00378 2205-PRCES-KA-ADDR-INFO-X.
B00378     EXIT.
      /
      *-----------------------
       2210-PRCES-INSRD-BNFTS.
      *-----------------------

           MOVE ZEROS                     TO WS-TOT-LIFE-FACE-AMT.
           MOVE ZEROS                     TO WS-TOT-LIFE-ADB-FACE-AMT.
           MOVE ZEROS                     TO WS-TOT-HOSP-ACC-FACE-AMT.
B10048*    MOVE ZEROS                     TO WS-TOT-HOSP-LT-FACE-AMT.
           MOVE ZEROS                     TO WS-TOT-HOSP-DIS-FACE-AMT.
B10047     MOVE ZEROS                     TO WS-TOT-HOSP-ADULT-DIS-AMT.
 
PR006C     MOVE ZEROS                     TO WS-TMP-HOSP-ACC30-FACE-AMT. 
PR006C     MOVE ZEROS                     TO WS-TMP-HOSP-DIS30-AMT.      
PR006C     MOVE ZEROS                     TO WS-TMP-HOSP-ADIS30-AMT.     
PR006C     MOVE ZEROS                     TO WS-TMP-HOSP-C-FACE-AMT.     
PR006C     MOVE ZEROS                     TO WS-TMP-HOSP-C-ADIS-AMT.     
 
MM0085     MOVE SPACES                TO WS-HOSP-ACC30-CVG-ISS-EFF-DT.
MM0085     MOVE SPACES                TO WS-HOSP-DIS30-CVG-ISS-EFF-DT.
MM0085     MOVE SPACES                TO WS-HOSP-ADIS30-CVG-ISS-EFF-DT.
MM0085     MOVE SPACES                TO WS-HOSP-C-CVG-ISS-EFF-DT.
MM0085     MOVE SPACES                TO WS-HOSP-C-ADIS-CVG-ISS-EFF-DT. 
27676C     MOVE ZEROS                 TO WS-FDIS-HOSP-BNFT-AMT.
27676C     MOVE ZEROS                 TO WS-AD-BNFT-AMT.       
27676C     MOVE ZEROS                 TO WS-IP-BNFT-AMT.       
27676C     MOVE ZEROS                 TO WS-CNCR-BNFT-AMT.     
27676C     MOVE ZEROS                 TO WS-HOSP-BNFT-AMT.     
27676C     MOVE ZEROS                 TO WS-MEDIC-BNFT-QTY.      

      * PROCESS COVERAGE AMOUNTS FOR THIS INSURED
      * NOTE: CCLI IS AN ALTERNATE INDEX FOR CVGC

           MOVE LOW-VALUES                TO WCCLI-KEY.
M119DM*    MOVE RLTRN-INSRD-CLI-ID        TO WCCLI-INSRD-CLI-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID        TO WCCLI-INSRD-CLI-ID.
           MOVE RPOL-POL-ID               TO WCCLI-POL-ID.

           MOVE HIGH-VALUES               TO WCCLI-ENDBR-KEY.
M119DM*    MOVE RLTRN-INSRD-CLI-ID        TO WCCLI-ENDBR-INSRD-CLI-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID        TO WCCLI-ENDBR-INSRD-CLI-ID.
           MOVE RPOL-POL-ID               TO WCCLI-ENDBR-POL-ID.

           PERFORM  CCLI-1000-BROWSE
               THRU CCLI-1000-BROWSE-X.

           PERFORM  CCLI-2000-READ-NEXT
               THRU CCLI-2000-READ-NEXT-X.

           PERFORM  2220-PRCES-CVGS-BNFTS
               THRU 2220-PRCES-CVGS-BNFTS-X
              UNTIL NOT WCCLI-IO-OK
                 OR     WCCLI-IO-EOF

           PERFORM  CCLI-3000-END-BROWSE
               THRU CCLI-3000-END-BROWSE-X.

      * SET UP THE EXTRACT FIELDS FROM THE ACCUMULATED VALUES.

      * HOSPITALIZATION - ACCIDENTAL DAILY BENEFIT
       
MM0085*PR006C 
MM0085*PR006C  IF A C-TYPE RIDER EXISTS IN CONJUNCTION WITH THE ACCIDENTAL
MM0085*PR006C  HOSP. RIDER THEN USE THE GREATER OF THE C-TYPE RIDER FACE AMOUNT
MM0085*PR006C  OR THE 30 DAY RIDER
MM0085*PR006C 
MM0085*PR006C     IF WS-TOT-HOSP-ACC-FACE-AMT = ZERO
MM0085*PR006C        MOVE WS-TMP-HOSP-ACC30-FACE-AMT 
MM0085*PR006C        TO   WS-TOT-HOSP-ACC-FACE-AMT
MM0085*PR006C        IF WS-TMP-HOSP-C-FACE-AMT > WS-TOT-HOSP-ACC-FACE-AMT
MM0085*PR006C           MOVE WS-TMP-HOSP-C-FACE-AMT TO WS-TOT-HOSP-ACC-FACE-AMT
MM0085*PR006C        END-IF
MM0085*PR006C     END-IF.
MM0085*
MM0085*
MM0085* 30-DAY TYPE AND C-TYPE PROCESSING...
MM0085*
MM0085*  IF THE CLIENT HAS ONLY ONE OF 30-DAY TYPE AND C-TYPE THEN 
MM0085*  ADD THE RELEVANT FACE AMOUNT
MM0085*
MM0085*  ELSE
MM0085*
MM0085*  IF THE CLIENT HAS BOTH 30-DAY TYPE AND C-TYPE THEN WE HAVE TO  
MM0085*  DECIDE WHICH AMOUNT (IF ANY) TO SEND AS FOLLOWS:
MM0085*
MM0085*   IF THE COVERAGES WERE ISSUED ON THE SAME DATE SEND THE LARGER
MM0085*
MM0085*   IF THE COVERAGES WERE ISSUED ON DIFFERENT DATES THEN IF THE
MM0085*   NEW COVERAGE IS GREATER THAN THE OLD COVERAGE THEN SEND THE
MM0085*   NEW COVERAGE
MM0085*
MM0085     IF WS-HOSP-ACC30-CVG-ISS-EFF-DT = SPACES 
MM0085     OR WS-HOSP-C-CVG-ISS-EFF-DT     = SPACES 
MM0085        IF WS-HOSP-ACC30-CVG-ISS-EFF-DT NOT = SPACES 
MM0085           ADD WS-TMP-HOSP-ACC30-FACE-AMT      
MM0085           TO  WS-TOT-HOSP-ACC-FACE-AMT
MM0085        ELSE
MM0085           ADD WS-TMP-HOSP-C-FACE-AMT      
MM0085           TO  WS-TOT-HOSP-ACC-FACE-AMT
MM0085        END-IF 
MM0085     ELSE
MM0085        EVALUATE TRUE
MM0085
MM0085        WHEN WS-HOSP-ACC30-CVG-ISS-EFF-DT 
MM0085             = WS-HOSP-C-CVG-ISS-EFF-DT 
M00085
MM0085        IF WS-TMP-HOSP-ACC30-FACE-AMT > WS-TMP-HOSP-C-FACE-AMT 
MM0085           ADD WS-TMP-HOSP-ACC30-FACE-AMT      
MM0085           TO  WS-TOT-HOSP-ACC-FACE-AMT
MM0085        ELSE
MM0085           ADD WS-TMP-HOSP-C-FACE-AMT      
MM0085           TO  WS-TOT-HOSP-ACC-FACE-AMT
MM0085        END-IF
MM0085
MM0085        WHEN WS-HOSP-ACC30-CVG-ISS-EFF-DT 
MM0085             > WS-HOSP-C-CVG-ISS-EFF-DT 
MM0085         AND WS-TMP-HOSP-ACC30-FACE-AMT > WS-TMP-HOSP-C-FACE-AMT
MM0085 
MM0085             ADD WS-TMP-HOSP-ACC30-FACE-AMT      
MM0085             TO  WS-TOT-HOSP-ACC-FACE-AMT
M00085
MM0085        WHEN WS-HOSP-C-CVG-ISS-EFF-DT 
MM0085             > WS-HOSP-ACC30-CVG-ISS-EFF-DT 
MM0085         AND WS-TMP-HOSP-C-FACE-AMT > WS-TMP-HOSP-ACC30-FACE-AMT
MM0085 
MM0085             ADD WS-TMP-HOSP-C-FACE-AMT      
MM0085             TO  WS-TOT-HOSP-ACC-FACE-AMT
M00085
MM0085       END-EVALUATE              
M00085     END-IF.
 
           COMPUTE L0290-INPUT-NUMBER   =  WS-TOT-HOSP-ACC-FACE-AMT
                                        *  L0290-CRCY-MULT-FCT.
           MOVE WGLOB-CRCY-SCALE-QTY     TO L0290-PRECISION.
           MOVE 5                        TO L0290-MAX-OUT-LEN.
           SET  L0290-LEAD-ZEROS-DISPLAY TO TRUE.
           SET  L0290-SIGN-SUPPRESS      TO TRUE.
           PERFORM  0290-1000-NUMERIC-FORMAT
               THRU 0290-1000-NUMERIC-FORMAT-X.
           IF  NOT L0290-RETRN-OK
      *MSG: ERROR FORMATTING NUMERIC VALUE (@1) ON POLICY (@2)
               MOVE 'NS90750100'         TO WGLOB-MSG-REF-INFO
               MOVE WS-TOT-HOSP-ACC-FACE-AMT-X
                                         TO WGLOB-MSG-PARM (1)
               MOVE WPOL-POL-ID          TO WGLOB-MSG-PARM (2)
               PERFORM  0260-2000-GET-MESSAGE
                   THRU 0260-2000-GET-MESSAGE-X
               MOVE WGLOB-MSG-TXT        TO L0040-INPUT-LINE
               PERFORM  0040-3000-WRITE-OTHER
                   THRU 0040-3000-WRITE-OTHER-X
           ELSE
               MOVE L0290-OUTPUT-DATA    TO RLNCX-ACCDNT-HOSP-BNFT-AMT
           END-IF.

MM0085*
      * HOSPITALIZATION - DISEASE BENEFIT
MM0085*
PR006C*
PR006C* IF A C-TYPE RIDER EXISTS IN CONJUNCTION WITH THE HOSP. DISEASE
PR006C* RIDER THEN USE THE GREATER OF THE C-TYPE RIDER FACE AMOUNT
PR006C* OR THE 30 DAY RIDER
PR006C*
PR006C* NOTE THAT THE C-TYPE ACC. HOSP. FACE AMOUNT IS INTENIONALLY RE-USED
PR006C*
MM0085*PR006C     IF WS-TOT-HOSP-DIS-FACE-AMT = ZERO
MM0085*PR006C        MOVE WS-TMP-HOSP-DIS30-AMT 
MM0085*PR006C        TO   WS-TOT-HOSP-DIS-FACE-AMT
MM0085*PR006C        IF WS-TMP-HOSP-C-FACE-AMT > WS-TOT-HOSP-DIS-FACE-AMT
MM0085*PR006C           MOVE WS-TMP-HOSP-C-FACE-AMT TO WS-TOT-HOSP-DIS-FACE-AMT
MM0085*PR006C        END-IF
MM0085*PR006C     END-IF.
MM0085*
MM0085* 30-DAY TYPE AND C-TYPE PROCESSING...
MM0085*
MM0085*  IF THE CLIENT HAS ONLY ONE OF 30-DAY TYPE AND C-TYPE THEN 
MM0085*  ADD THE RELEVANT FACE AMOUNT
MM0085*
MM0085*  ELSE
MM0085*
MM0085*  IF THE CLIENT HAS BOTH 30-DAY TYPE AND C-TYPE THEN WE HAVE TO  
MM0085*  DECIDE WHICH AMOUNT (IF ANY) TO SEND AS FOLLOWS:
MM0085*
MM0085*   IF THE COVERAGES WERE ISSUED ON THE SAME DATE SEND THE LARGER
MM0085*
MM0085*   IF THE COVERAGES WERE ISSUED ON DIFFERENT DATES THEN IF THE
MM0085*   NEW COVERAGE IS GREATER THAN THE OLD COVERAGE THEN SEND THE
MM0085*   NEW COVERAGE
MM0085*
MM0085     IF WS-HOSP-DIS30-CVG-ISS-EFF-DT = SPACES 
MM0085     OR WS-HOSP-C-CVG-ISS-EFF-DT     = SPACES 
MM0085        IF WS-HOSP-DIS30-CVG-ISS-EFF-DT NOT = SPACES 
MM0085           ADD WS-TMP-HOSP-DIS30-AMT      
MM0085           TO  WS-TOT-HOSP-DIS-FACE-AMT
MM0085        ELSE
MM0085           ADD WS-TMP-HOSP-C-FACE-AMT      
MM0085           TO  WS-TOT-HOSP-DIS-FACE-AMT
MM0085        END-IF 
MM0085     ELSE
MM0085        EVALUATE TRUE
MM0085
MM0085        WHEN WS-HOSP-DIS30-CVG-ISS-EFF-DT 
MM0085             = WS-HOSP-C-CVG-ISS-EFF-DT 
M00085
MM0085        IF WS-TMP-HOSP-DIS30-AMT > WS-TMP-HOSP-C-FACE-AMT 
MM0085           ADD WS-TMP-HOSP-DIS30-AMT      
MM0085           TO  WS-TOT-HOSP-DIS-FACE-AMT
MM0085        ELSE
MM0085           ADD WS-TMP-HOSP-C-FACE-AMT      
MM0085           TO  WS-TOT-HOSP-DIS-FACE-AMT
MM0085        END-IF
MM0085
MM0085        WHEN WS-HOSP-DIS30-CVG-ISS-EFF-DT 
MM0085             > WS-HOSP-C-CVG-ISS-EFF-DT 
MM0085         AND WS-TMP-HOSP-DIS30-AMT > WS-TMP-HOSP-C-FACE-AMT
MM0085 
MM0085             ADD WS-TMP-HOSP-DIS30-AMT      
MM0085             TO  WS-TOT-HOSP-DIS-FACE-AMT
M00085
MM0085        WHEN WS-HOSP-C-CVG-ISS-EFF-DT 
MM0085             > WS-HOSP-DIS30-CVG-ISS-EFF-DT 
MM0085         AND WS-TMP-HOSP-C-FACE-AMT > WS-TMP-HOSP-DIS30-AMT
MM0085 
MM0085             ADD WS-TMP-HOSP-C-FACE-AMT      
MM0085             TO  WS-TOT-HOSP-DIS-FACE-AMT
M00085
MM0085       END-EVALUATE              
M00085     END-IF.
 
           COMPUTE L0290-INPUT-NUMBER   =  WS-TOT-HOSP-DIS-FACE-AMT
                                        *  L0290-CRCY-MULT-FCT.
           MOVE WGLOB-CRCY-SCALE-QTY     TO L0290-PRECISION.
           MOVE 5                        TO L0290-MAX-OUT-LEN.
           SET  L0290-LEAD-ZEROS-DISPLAY TO TRUE.
           SET  L0290-SIGN-SUPPRESS      TO TRUE.
           PERFORM  0290-1000-NUMERIC-FORMAT
               THRU 0290-1000-NUMERIC-FORMAT-X.
           IF  NOT L0290-RETRN-OK
      *MSG: ERROR FORMATTING NUMERIC VALUE (@1) ON POLICY (@2)
               MOVE 'NS90750100'         TO WGLOB-MSG-REF-INFO
               MOVE WS-TOT-HOSP-DIS-FACE-AMT-X
                                         TO WGLOB-MSG-PARM (1)
               MOVE WPOL-POL-ID          TO WGLOB-MSG-PARM (2)
               PERFORM  0260-2000-GET-MESSAGE
                   THRU 0260-2000-GET-MESSAGE-X
               MOVE WGLOB-MSG-TXT        TO L0040-INPUT-LINE
               PERFORM  0040-3000-WRITE-OTHER
                   THRU 0040-3000-WRITE-OTHER-X
           ELSE
               MOVE L0290-OUTPUT-DATA    TO RLNCX-DISEASE-HOSP-BNFT-AMT
           END-IF.

      * HOSPITALIZATION - ADULT DISEASE BENEFIT
PR006C*
PR006C* IF A C-TYPE RIDER EXISTS IN CONJUNCTION WITH THE ADULT DISEASE
PR006C* RIDER THEN USE THE GREATER OF THE C-TYPE RIDER FACE AMOUNT
PR006C* OR THE 30 DAY RIDER
PR006C*
MM0085*PR006C     IF WS-TOT-HOSP-ADULT-DIS-AMT = ZERO
MM0085*PR006C        MOVE WS-TMP-HOSP-ADIS30-AMT 
MM0085*PR006C        TO   WS-TOT-HOSP-ADULT-DIS-AMT
MM0085*PR006C        IF WS-TMP-HOSP-C-ADIS-AMT > WS-TOT-HOSP-ADULT-DIS-AMT
MM0085*PR006C           MOVE WS-TMP-HOSP-C-ADIS-AMT 
MM0085*PR006C           TO   WS-TOT-HOSP-ADULT-DIS-AMT
MM0085*PR006C        END-IF
MM0085*PR006C     END-IF.
MM0085*
MM0085* 30-DAY TYPE AND C-TYPE PROCESSING...
MM0085*
MM0085*  IF THE CLIENT HAS ONLY ONE OF 30-DAY TYPE AND C-TYPE THEN 
MM0085*  ADD THE RELEVANT FACE AMOUNT
MM0085*
MM0085*  ELSE
MM0085*
MM0085*  IF THE CLIENT HAS BOTH 30-DAY TYPE AND C-TYPE THEN WE HAVE TO  
MM0085*  DECIDE WHICH AMOUNT (IF ANY) TO SEND AS FOLLOWS:
MM0085*
MM0085*   IF THE COVERAGES WERE ISSUED ON THE SAME DATE SEND THE LARGER
MM0085*
MM0085*   IF THE COVERAGES WERE ISSUED ON DIFFERENT DATES THEN IF THE
MM0085*   NEW COVERAGE IS GREATER THAN THE OLD COVERAGE THEN SEND THE
MM0085*   NEW COVERAGE
MM0085*
MM0085     IF WS-HOSP-ADIS30-CVG-ISS-EFF-DT = SPACES 
MM0085     OR WS-HOSP-C-ADIS-CVG-ISS-EFF-DT = SPACES 
MM0085        IF WS-HOSP-ADIS30-CVG-ISS-EFF-DT NOT = SPACES 
MM0085           ADD WS-TMP-HOSP-ADIS30-AMT      
MM0085           TO  WS-TOT-HOSP-ADULT-DIS-AMT
MM0085        ELSE
MM0085           ADD WS-TMP-HOSP-C-ADIS-AMT      
MM0085           TO  WS-TOT-HOSP-ADULT-DIS-AMT
MM0085        END-IF 
MM0085     ELSE
MM0085        EVALUATE TRUE
MM0085
MM0085        WHEN WS-HOSP-ADIS30-CVG-ISS-EFF-DT 
MM0085             = WS-HOSP-C-ADIS-CVG-ISS-EFF-DT
M00085
MM0085        IF WS-TMP-HOSP-ADIS30-AMT > WS-TMP-HOSP-C-ADIS-AMT 
MM0085           ADD WS-TMP-HOSP-ADIS30-AMT      
MM0085           TO  WS-TOT-HOSP-ADULT-DIS-AMT
MM0085        ELSE
MM0085           ADD WS-TMP-HOSP-C-ADIS-AMT      
MM0085           TO  WS-TOT-HOSP-ADULT-DIS-AMT
MM0085        END-IF
MM0085
MM0085        WHEN WS-HOSP-ADIS30-CVG-ISS-EFF-DT 
MM0085             > WS-HOSP-C-ADIS-CVG-ISS-EFF-DT
MM0085         AND WS-TMP-HOSP-ADIS30-AMT > WS-TMP-HOSP-C-ADIS-AMT
MM0085 
MM0085             ADD WS-TMP-HOSP-ADIS30-AMT      
MM0085             TO  WS-TOT-HOSP-ADULT-DIS-AMT
M00085
MM0085        WHEN WS-HOSP-C-ADIS-CVG-ISS-EFF-DT
MM0085             > WS-HOSP-ADIS30-CVG-ISS-EFF-DT 
MM0085         AND WS-TMP-HOSP-C-ADIS-AMT > WS-TMP-HOSP-ADIS30-AMT
MM0085 
MM0085             ADD WS-TMP-HOSP-C-ADIS-AMT      
MM0085             TO  WS-TOT-HOSP-ADULT-DIS-AMT
M00085
MM0085       END-EVALUATE              
M00085     END-IF.
 
B10047*    MOVE ZEROS                   TO RLNCX-ADULT-DISEASE-BNFT-AMT.
B10047
B10047     COMPUTE L0290-INPUT-NUMBER   =  WS-TOT-HOSP-ADULT-DIS-AMT
B10047                                  *  L0290-CRCY-MULT-FCT.
B10047     MOVE WGLOB-CRCY-SCALE-QTY     TO L0290-PRECISION.
B10047     MOVE 5                        TO L0290-MAX-OUT-LEN.
B10047     SET  L0290-LEAD-ZEROS-DISPLAY TO TRUE.
B10047     SET  L0290-SIGN-SUPPRESS      TO TRUE.
B10047     PERFORM  0290-1000-NUMERIC-FORMAT
B10047         THRU 0290-1000-NUMERIC-FORMAT-X.
B10047     IF  NOT L0290-RETRN-OK
B10047*MSG: ERROR FORMATTING NUMERIC VALUE (@1) ON POLICY (@2)
B10047         MOVE 'NS90750100'         TO WGLOB-MSG-REF-INFO
B10047         MOVE WS-TOT-HOSP-ADULT-DIS-AMT-X
B10047                                   TO WGLOB-MSG-PARM (1)
B10047         MOVE WPOL-POL-ID          TO WGLOB-MSG-PARM (2)
B10047         PERFORM  0260-2000-GET-MESSAGE
B10047             THRU 0260-2000-GET-MESSAGE-X
B10047         MOVE WGLOB-MSG-TXT        TO L0040-INPUT-LINE
B10047         PERFORM  0040-3000-WRITE-OTHER
B10047             THRU 0040-3000-WRITE-OTHER-X
B10047     ELSE
B10047         MOVE L0290-OUTPUT-DATA    TO RLNCX-ADULT-DISEASE-BNFT-AMT
B10047     END-IF.

      * HOSPITALIZATION - OTHER DISEASE BENEFIT
B10048*    COMPUTE L0290-INPUT-NUMBER   =  WS-TOT-HOSP-LT-FACE-AMT
B10048*                                 *  L0290-CRCY-MULT-FCT.
B10048*    MOVE WGLOB-CRCY-SCALE-QTY     TO L0290-PRECISION.
B10048*    MOVE 5                        TO L0290-MAX-OUT-LEN.
B10048*    SET  L0290-LEAD-ZEROS-DISPLAY TO TRUE.
B10048*    SET  L0290-SIGN-SUPPRESS      TO TRUE.
B10048*    PERFORM  0290-1000-NUMERIC-FORMAT
B10048*        THRU 0290-1000-NUMERIC-FORMAT-X.
B10048*    IF  NOT L0290-RETRN-OK
B10048*MSG: ERROR FORMATTING NUMERIC VALUE (@1) ON POLICY (@2)
B10048*        MOVE 'NS90750100'         TO WGLOB-MSG-REF-INFO
B10048*        MOVE WS-TOT-HOSP-LT-FACE-AMT-X
B10048*                                  TO WGLOB-MSG-PARM (1)
B10048*        MOVE WPOL-POL-ID          TO WGLOB-MSG-PARM (2)
B10048*        PERFORM  0260-2000-GET-MESSAGE
B10048*            THRU 0260-2000-GET-MESSAGE-X
B10048*        MOVE WGLOB-MSG-TXT        TO L0040-INPUT-LINE
B10048*        PERFORM  0040-3000-WRITE-OTHER
B10048*            THRU 0040-3000-WRITE-OTHER-X
B10048*    ELSE
B10048*        MOVE L0290-OUTPUT-DATA    TO RLNCX-OTHER-DISEASE-BNFT-AMT
B10048*    END-IF.

       2210-PRCES-INSRD-BNFTS-X.
           EXIT.
      /
      *----------------------
       2220-PRCES-CVGS-BNFTS.
      *----------------------

B00525* FOR POLICY ISSUE REQUESTS, ACCUMULATE PENDING COVERAGES ONLY
B00525* FOR POLICY SETTLE REQUESTS, ACCUMULATE IN-FORCE COVERAGES ONLY
M119NB* FOR PIRA ADDITION REQUESTS, ACCUMULATE PENDING CVGSS & INFORCE CVGS.
M119NB* FOR PIRA SETTLE/REJECT REQUESTS, ACCUMULATE IN-FORCE COVERAGES ONLY
B00525
B00525     IF  (RLNCX-REC-TYP-POL-ISS
B00525     AND  WCVGS-CVG-STAT-PENDING  (RCVGC-CVG-NUM-N))
B00525     OR  (RLNCX-REC-TYP-POL-SETL
B00525     AND  WCVGS-CVG-STAT-IN-FORCE (RCVGC-CVG-NUM-N))
02NB64     OR  (RLNCX-REC-TYP-RA-OR 
02NB64     AND  (WCVGS-CVG-STAT-PENDING (RCVGC-CVG-NUM-N)
02NB64     OR    WCVGS-CVG-STAT-IN-FORCE (RCVGC-CVG-NUM-N)))
02NB64     OR  (RLNCX-REC-TYP-RA-BOTH
02NB64     AND  (WCVGS-CVG-STAT-PENDING (RCVGC-CVG-NUM-N)
02NB64     OR    WCVGS-CVG-STAT-IN-FORCE (RCVGC-CVG-NUM-N)))
M119NB     OR  (RLNCX-REC-TYP-UA-PP
M119NB     AND (WCVGS-CVG-STAT-PENDING (RCVGC-CVG-NUM-N)
M119NB     OR   WCVGS-CVG-STAT-IN-FORCE (RCVGC-CVG-NUM-N)))
M119NB     OR  (RLNCX-REC-TYP-UA-PI
M119NB     AND  WCVGS-CVG-STAT-IN-FORCE (RCVGC-CVG-NUM-N))
M119NB     OR  (RLNCX-REC-TYP-UA-PR
M119NB     AND  WCVGS-CVG-STAT-IN-FORCE (RCVGC-CVG-NUM-N))

      * ACCUMULATE LIFE COVERAGES
NWLEXT*               IF  WCVGS-CVG-INS-TYP-UL-INS-ONLY (RCVGC-CVG-NUM-N)
NWLEXT         IF  (WCVGS-CVG-INS-TYP-UL-INS-ONLY (RCVGC-CVG-NUM-N)
NWLEXT         OR  WCVGS-CVG-INS-TYP-TRAD (RCVGC-CVG-NUM-N) )
               AND WCVGS-PLAN-BNFT-TYP-CD (RCVGC-CVG-NUM-N) = SPACES
IPDDUW*            ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
IPDDUW*             TO WS-TOT-LIFE-FACE-AMT
IPDDUW*
IPDDUW* ADD THE PRESENT CONVERTED FACE AMOUNT FOR IPDD RIDERS
IPDDUW* INSTEAD OF COVERAGE FACE AMOUNT
IPDDUW*
ABF059*VALUES ARE ADDED AT COVERAGE LEVEL; SO WORKING STORAGE VARIABLE
ABF059*WS-PLAN-ID IS REMOVED 
ABF059* 
ABF059             IF  WCVGS-PLAN-IP (RCVGC-CVG-NUM-N)
IPDDUW                 ADD WCVGS-PRES-CNVR-FACE-AMT (RCVGC-CVG-NUM-N)
IPDDUW                  TO WS-TOT-LIFE-FACE-AMT
IPDDUW             ELSE
IPDDUW                 ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
IPDDUW                  TO WS-TOT-LIFE-FACE-AMT
IPDDUW             END-IF
               END-IF

      * ACCUMULATE ADB COVERAGES
B10544*        IF  WCVGS-CVG-INS-TYP-UL-INS-ONLY (RCVGC-CVG-NUM-N)
B10544*        AND WCVGS-PLAN-BNFT-ACCDTH (RCVGC-CVG-NUM-N)
B10544*        OR  WCVGS-CVG-INS-TYP-UL-INS-ONLY (RCVGC-CVG-NUM-N)
B10544*        AND WCVGS-PLAN-BNFT-INJURY (RCVGC-CVG-NUM-N)
NWLEXT*B10544         IF  (WCVGS-CVG-INS-TYP-UL-INS-ONLY (RCVGC-CVG-NUM-N)
NWLEXT*B10544         AND WCVGS-PLAN-BNFT-ACCDTH (RCVGC-CVG-NUM-N))
NWLEXT*B10544         OR  (WCVGS-CVG-INS-TYP-UL-INS-ONLY (RCVGC-CVG-NUM-N)
NWLEXT*B10544         AND WCVGS-PLAN-BNFT-INJURY (RCVGC-CVG-NUM-N))
NWLEXT         IF  WCVGS-PLAN-BNFT-INJURY (RCVGC-CVG-NUM-N) 
NWLEXT         OR  WCVGS-PLAN-BNFT-ACCDTH (RCVGC-CVG-NUM-N) 
                   ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
                    TO WS-TOT-LIFE-ADB-FACE-AMT
               END-IF

      * TEST HEALTH COVERAGES

PR006C*        IF  WCVGS-PLAN-BNFT-HOSP-ACC (RCVGC-CVG-NUM-N)
PR006C*            ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C*             TO WS-TOT-HOSP-ACC-FACE-AMT
PR006C*        END-IF
PR006C
PR006C         IF  WCVGS-PLAN-BNFT-HOSP-ACC (RCVGC-CVG-NUM-N)
PR006C             IF WCVGS-CVG-STBL-2-CD (RCVGC-CVG-NUM-N) = '1  '
PR006C                ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C                TO  WS-TMP-HOSP-ACC30-FACE-AMT
MM0085                MOVE WCVGS-CVG-ISS-EFF-DT (RCVGC-CVG-NUM-N)
MM0085                TO   WS-HOSP-ACC30-CVG-ISS-EFF-DT  
PR006C             ELSE
PR006C                ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C                TO  WS-TOT-HOSP-ACC-FACE-AMT
PR006C             END-IF
PR006C         END-IF

B10048*        IF  WCVGS-PLAN-BNFT-HOSP-LT (RCVGC-CVG-NUM-N)
B10048*            ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
B10048*             TO WS-TOT-HOSP-LT-FACE-AMT
B10048*        END-IF

PR006C*        IF  WCVGS-PLAN-BNFT-HOSP-DIS (RCVGC-CVG-NUM-N)
PR006C*            ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C*             TO WS-TOT-HOSP-DIS-FACE-AMT
PR006C*        END-IF
 
PR006C         IF  WCVGS-PLAN-BNFT-HOSP-DIS (RCVGC-CVG-NUM-N)
PR006C             IF WCVGS-CVG-STBL-2-CD (RCVGC-CVG-NUM-N) = '1  '
PR006C                ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C                TO  WS-TMP-HOSP-DIS30-AMT
MM0085                MOVE WCVGS-CVG-ISS-EFF-DT (RCVGC-CVG-NUM-N)
MM0085                TO   WS-HOSP-DIS30-CVG-ISS-EFF-DT  
PR006C             ELSE
PR006C                ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C                TO  WS-TOT-HOSP-DIS-FACE-AMT
PR006C             END-IF
PR006C         END-IF

PR006C*        IF  WCVGS-PLAN-BNFT-DISEA (RCVGC-CVG-NUM-N)
PR006C*            ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C*             TO WS-TOT-HOSP-ADULT-DIS-AMT
PR0063*        END-IF
      
PR006C         IF  WCVGS-PLAN-BNFT-DISEA (RCVGC-CVG-NUM-N)
PR006C             IF WCVGS-CVG-STBL-2-CD (RCVGC-CVG-NUM-N) = '1  '
PR006C                ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C                TO  WS-TMP-HOSP-ADIS30-AMT
MM0085                MOVE WCVGS-CVG-ISS-EFF-DT (RCVGC-CVG-NUM-N)
MM0085                TO   WS-HOSP-ADIS30-CVG-ISS-EFF-DT  
PR006C             ELSE
PR006C                ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C                TO  WS-TOT-HOSP-ADULT-DIS-AMT
PR006C             END-IF
PR006C         END-IF
       
 
PR006C         IF WCVGS-PLAN-BNFT-C-HOSP (RCVGC-CVG-NUM-N) 
PR006C            ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C            TO  WS-TMP-HOSP-C-FACE-AMT
MM0085            MOVE WCVGS-CVG-ISS-EFF-DT (RCVGC-CVG-NUM-N)
MM0085            TO   WS-HOSP-C-CVG-ISS-EFF-DT  
PR006C         END-IF
 
PR006C         IF WCVGS-PLAN-BNFT-C-ADISEASE (RCVGC-CVG-NUM-N) 
PR006C            ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
PR006C            TO  WS-TMP-HOSP-C-ADIS-AMT
MM0085            MOVE WCVGS-CVG-ISS-EFF-DT (RCVGC-CVG-NUM-N)
MM0085            TO   WS-HOSP-C-ADIS-CVG-ISS-EFF-DT  
PR006C         END-IF
27676C
27676C* FEMALE DISEASE HOSPITALIZATION DAILY BENEFIT
27676C         IF  WCVGS-PLAN-BNFT-FEM-DIS-HOSP (RCVGC-CVG-NUM-N)
27676C         OR  WCVGS-PLAN-BNFT-FDISEA  (RCVGC-CVG-NUM-N)
27676C             ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
27676C                                      TO 
27676C                                WS-FDIS-HOSP-BNFT-AMT
27676C         END-IF
27676C
27676C* CANCER LUMPSUM BENEFIT(FACE AMOUNT)
27676C         IF  WCVGS-PLAN-BNFT-CNCR-LUMP-SUM (RCVGC-CVG-NUM-N)
27676C         OR  WCVGS-PLAN-BNFT-3DD (RCVGC-CVG-NUM-N)
27676C         OR  WCVGS-PLAN-BNFT-DREAD (RCVGC-CVG-NUM-N)
27676C         OR  WCVGS-PLAN-BNFT-3DD-ANTY (RCVGC-CVG-NUM-N)
27676C         OR  WCVGS-PLAN-BNFT-MALIGNT-NEO (RCVGC-CVG-NUM-N)
27676C         OR  WCVGS-PLAN-BNFT-IN-SITU-NEO (RCVGC-CVG-NUM-N)
27676C             ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
27676C                                      TO WS-CNCR-BNFT-AMT
27676C         END-IF
27676C
27676C* HOSPITALIZATION LUMP SUM(LUMP SUM)
27676C         IF  WCVGS-PLAN-BNFT-HOSP-LMPSUM (RCVGC-CVG-NUM-N)
27676C             ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
27676C                                      TO
27676C                              WS-HOSP-BNFT-AMT
27676C         END-IF
27676C
27676C* ADVANCED TREATMENT RIDER
27676C         IF  WCVGS-PLAN-BNFT-ADV-MED (RCVGC-CVG-NUM-N)
27676C             ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
27676C                                      TO WS-MEDIC-BNFT-QTY
27676C         END-IF 
           END-IF.

           PERFORM  CCLI-2000-READ-NEXT
               THRU CCLI-2000-READ-NEXT-X.

       2220-PRCES-CVGS-BNFTS-X.
           EXIT.
P00120/
B10645*----------------------
B10645 2230-PRCES-CVGS-ISS-DT.
B10645*----------------------
M119NB*THE FIELD NAME REINSTATEMENT DATE IS CHANGED TO POLICY SERVICE DATE.
B10645     IF  RLNCX-CHNG-TYP-CD = 'U' OR 'I'
B10645     AND WCVGS-CVG-STAT-PENDING (RCVGC-CVG-NUM-N)
M119NB*B10645         MOVE WCVGS-CVG-ISS-EFF-DT-YR (RCVGC-CVG-NUM-N)
M119NB*B10645                                        TO RLNCX-REINST-YR
M119NB*B10645         MOVE WCVGS-CVG-ISS-EFF-DT-MO (RCVGC-CVG-NUM-N)     
M119NB*B10645                                        TO RLNCX-REINST-MO
M119NB*B10645         MOVE WCVGS-CVG-ISS-EFF-DT-DY (RCVGC-CVG-NUM-N)     
M119NB*B10645                                        TO RLNCX-REINST-DY
M119NB         MOVE WCVGS-CVG-ISS-EFF-DT-YR (RCVGC-CVG-NUM-N)
M119NB                                 TO RLNCX-POL-SERV-YR
M119NB         MOVE WCVGS-CVG-ISS-EFF-DT-MO (RCVGC-CVG-NUM-N)               
M119NB                                 TO RLNCX-POL-SERV-MO
M119NB         MOVE WCVGS-CVG-ISS-EFF-DT-DY (RCVGC-CVG-NUM-N)              
M119NB                                 TO RLNCX-POL-SERV-DY
B10645     END-IF.
M119NB**********************************************
M119NB* GET SCHEDULED POLICY SERVICE EFFECTIVE DATE
M119NB**********************************************
M119NB     IF  RLNCX-REC-TYP-UA-PP
M119NB     AND WCVGS-CVG-STAT-PENDING (RCVGC-CVG-NUM-N)
M119NB         MOVE WCVGS-CVG-ISS-EFF-DT(RCVGC-CVG-NUM-N)
M119NB                                 TO WS-SCHD-POL-SERV-DT
M119NB         MOVE WS-SCHD-POL-SERV-DT-YR 
M119NB                                 TO RLNCX-SCHD-POL-SERV-DT-YR
M119NB         MOVE WS-SCHD-POL-SERV-DT-MO 
M119NB                                 TO RLNCX-SCHD-POL-SERV-DT-MO
M119NB         MOVE WS-SCHD-POL-SERV-DT-DY
M119NB                                 TO RLNCX-SCHD-POL-SERV-DT-DY
M119NB     END-IF.
M119NB*
B10645     PERFORM  CCLI-2000-READ-NEXT
B10645         THRU CCLI-2000-READ-NEXT-X.

B10645 2230-PRCES-CVGS-ISS-DT-X.
B10645     EXIT.
B10645/
P00120*-----------------
P00120 2500-WRITE-TLINC.
P00120*-----------------
P00120
M119DM*P00120     MOVE RLTRN-INSRD-CLI-ID          TO WLINC-CLI-ID.
M119DM*P00120     MOVE RLTRN-POL-ID                TO WLINC-POL-ID.
M119DM     MOVE RLCDM-INSRD-CLI-ID          TO WLINC-CLI-ID.
M119DM     MOVE RLCDM-POL-ID                TO WLINC-POL-ID.
P00120*
P00120* CHECK IF RECORD ALREADY EXISTS
P00120*
M119NB*FOR PIRA ADDED AND RECORD TYPE 28, ACCUMULATE LIFE DB AMT/
M119NB*MEDICAL DAILY BENEFIT AMNT FOR INFORCE COVERAGES ONLY AND 
M119NB*WRITE IT TO LINC TABLE FOR THE PIRA SETL/REJECT PROCESSING.
P00120     PERFORM  LINC-1000-READ
P00120         THRU LINC-1000-READ-X.
M119NB     IF  WLINC-IO-OK
M119NB         SET  WS-LINC-EXISTS      TO TRUE
M119NB     ELSE
M119NB         SET  WS-LINC-EXISTS-NO   TO TRUE
M119NB     END-IF.
M119NB             
M119NB     IF  WS-LINC-EXISTS
M119DM*M119NB         IF  RLTRN-LTRN-REC-TYP-UA-PP
M119DM         IF  RLCDM-LCDM-REC-TYP-UA-PP
M119NB             PERFORM  LINC-1000-READ-FOR-UPDATE
M119NB                 THRU LINC-1000-READ-FOR-UPDATE-X
M119NB         ELSE
M119NB             GO TO 2500-WRITE-TLINC-X
M119NB         END-IF
M119NB     ELSE 
M119NB         PERFORM  LINC-1000-CREATE
M119NB             THRU LINC-1000-CREATE-X
M119NB     END-IF.
M119NB
M119NB*P00120     IF  WLINC-IO-OK
M119NB*P00120         GO TO 2500-WRITE-TLINC-X
M119NB*P00120     END-IF
M119NB*P00120
M119NB*P00120     PERFORM  LINC-1000-CREATE
M119NB*P00120         THRU LINC-1000-CREATE-X.
M119NB*P00120
M119NB     PERFORM  2600-CALC-INFC-BNFT-AMTS
M119NB         THRU 2600-CALC-INFC-BNFT-AMTS-X.
M119NB
M119NB     MOVE  WS-INFC-LIFE-DB-FACE-AMT TO  
M119NB                                RLINC-INFC-LIFE-DB-FACE-AMT.
M119NB     MOVE  WS-INFC-HOSP-BNFT-AMT    TO  
M119NB                                RLINC-INFC-HOSP-BNFT-AMT.
M119NB     IF  WS-LINC-EXISTS
M119NB         PERFORM  LINC-2000-REWRITE
M119NB             THRU LINC-2000-REWRITE-X
M119NB     ELSE
M119NB         PERFORM  LINC-1000-WRITE
M119NB             THRU LINC-1000-WRITE-X
M119NB     END-IF.
M119NB
M119NB*P00120     PERFORM  LINC-1000-WRITE
M119NB*P00120         THRU LINC-1000-WRITE-X.
P00120
P00120 2500-WRITE-TLINC-X.
P00120     EXIT.
      /
M119NB*------------------------
M119NB 2600-CALC-INFC-BNFT-AMTS.
M119NB*------------------------
M119NB
M119NB     MOVE ZEROS                     TO WS-TOT-LIFE-FACE-AMT.
M119NB     MOVE ZEROS                     TO WS-TOT-LIFE-ADB-FACE-AMT.
M119NB     MOVE ZEROS                     TO WS-INFC-HOSP-BNFT-AMT.
M119NB     MOVE ZEROS                     TO WS-INFC-LIFE-DB-FACE-AMT.
M119NB
M119NB* PROCESS COVERAGE AMOUNTS FOR THIS INSURED
M119NB* NOTE: CCLI IS AN ALTERNATE INDEX FOR CVGC
M119NB
M119NB     MOVE LOW-VALUES                TO WCCLI-KEY.
M119DM     MOVE RLCDM-INSRD-CLI-ID        TO WCCLI-INSRD-CLI-ID.
M119DM*M119NB     MOVE RLTRN-INSRD-CLI-ID        TO WCCLI-INSRD-CLI-ID.
M119NB     MOVE RPOL-POL-ID               TO WCCLI-POL-ID.
M119NB
M119NB     MOVE HIGH-VALUES               TO WCCLI-ENDBR-KEY.
M119DM     MOVE RLCDM-INSRD-CLI-ID        TO WCCLI-ENDBR-INSRD-CLI-ID.
M119DM*M119NB     MOVE RLTRN-INSRD-CLI-ID        TO WCCLI-ENDBR-INSRD-CLI-ID.
M119NB     MOVE RPOL-POL-ID               TO WCCLI-ENDBR-POL-ID.
M119NB
M119NB     PERFORM  CCLI-1000-BROWSE
M119NB         THRU CCLI-1000-BROWSE-X.
M119NB
M119NB     PERFORM  CCLI-2000-READ-NEXT
M119NB         THRU CCLI-2000-READ-NEXT-X.
M119NB
M119NB     PERFORM  2610-PRCES-INFC-CVGS
M119NB         THRU 2610-PRCES-INFC-CVGS-X
M119NB        UNTIL NOT WCCLI-IO-OK
M119NB           OR     WCCLI-IO-EOF

M119NB     PERFORM  CCLI-3000-END-BROWSE
M119NB         THRU CCLI-3000-END-BROWSE-X.
M119NB
M119NB     COMPUTE WS-INFC-LIFE-DB-FACE-AMT = WS-TOT-LIFE-FACE-AMT
M119NB                                  + WS-TOT-LIFE-ADB-FACE-AMT.
M119NB
M119NB 2600-CALC-INFC-BNFT-AMTS-X.
M119NB     EXIT.
M119NB/
      *----------------------
       2610-PRCES-INFC-CVGS.
      *----------------------

M119NB* ACCUMULATE IN-FORCE COVERAGES ONLY FOR PIRA ADDITIONS FOR
M119NB*INSURED LESS THAN 15 YEARS.
M119NB     IF  (RLNCX-REC-TYP-UA-PP
M119NB     AND  WCVGS-CVG-STAT-IN-FORCE (RCVGC-CVG-NUM-N))
M119NB* ACCUMULATE LIFE COVERAGES
M119NB         IF  (WCVGS-CVG-INS-TYP-UL-INS-ONLY (RCVGC-CVG-NUM-N)
M119NB         OR  WCVGS-CVG-INS-TYP-TRAD (RCVGC-CVG-NUM-N))
M119NB         AND WCVGS-PLAN-BNFT-TYP-CD (RCVGC-CVG-NUM-N) = SPACES
M119NB* ADD THE PRESENT CONVERTED FACE AMOUNT FOR IPDD RIDERS
M119NB* INSTEAD OF COVERAGE FACE AMOUNT
M119NB* 
M119NB             IF  WCVGS-PLAN-IP (RCVGC-CVG-NUM-N)
M119NB                 ADD WCVGS-PRES-CNVR-FACE-AMT (RCVGC-CVG-NUM-N)
M119NB                  TO WS-TOT-LIFE-FACE-AMT
M119NB             ELSE
M119NB                 ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
M119NB                  TO WS-TOT-LIFE-FACE-AMT
M119NB             END-IF
M119NB         END-IF

M119NB* ACCUMULATE ADB COVERAGES
M119NB         IF  WCVGS-PLAN-BNFT-INJURY (RCVGC-CVG-NUM-N) 
M119NB         OR  WCVGS-PLAN-BNFT-ACCDTH (RCVGC-CVG-NUM-N) 
M119NB             ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
M119NB              TO WS-TOT-LIFE-ADB-FACE-AMT
M119NB         END-IF

      * TEST HEALTH COVERAGES
M119NB         IF  WCVGS-PLAN-BNFT-DISEA (RCVGC-CVG-NUM-N)
M119NB         OR  WCVGS-PLAN-BNFT-HOSP-ACC (RCVGC-CVG-NUM-N)
M119NB         OR  WCVGS-PLAN-BNFT-HOSP-DIS (RCVGC-CVG-NUM-N)
M119NB         OR  WCVGS-PLAN-BNFT-C-HOSP (RCVGC-CVG-NUM-N)
M119NB         OR  WCVGS-PLAN-BNFT-C-ADISEASE (RCVGC-CVG-NUM-N)
M119NB             ADD WCVGS-CVG-FACE-AMT (RCVGC-CVG-NUM-N)
M119NB              TO WS-INFC-HOSP-BNFT-AMT
M119NB         END-IF

M119NB     END-IF.

M119NB     PERFORM  CCLI-2000-READ-NEXT
M119NB         THRU CCLI-2000-READ-NEXT-X.

M119NB 2610-PRCES-INFC-CVGS-X.
M119NB     EXIT.
M119NB/
      *--------------------
       3500-WRITE-HEADINGS.
      *--------------------

           ADD 1                        TO WS-PAGE-CNTR.
           MOVE WS-PAGE-CNTR            TO WHDG-PAGE.
           MOVE SPACES                  TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-2000-WRITE
               THRU PRT1-2000-WRITE-X.
           MOVE +1                      TO WPRT1-NUMBER-LINES.
           MOVE WHDG-LINE-1             TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.
           MOVE +1                      TO WPRT1-NUMBER-LINES.
           MOVE WHDG-LINE-2             TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.
           MOVE +2                      TO WPRT1-NUMBER-LINES.
           MOVE WS-HEADING-1               TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.
           MOVE +1                      TO WPRT1-NUMBER-LINES.
           MOVE WS-HEADING-2               TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.
           MOVE +1                      TO WPRT1-NUMBER-LINES.
           MOVE SPACES                  TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.
           MOVE 8                       TO WS-LINE-CNTR.

       3500-WRITE-HEADINGS-X.
           EXIT.
      /
      *--------------------
       3600-WRITE-FOOTINGS.
      *--------------------

      * WRITE BLANK LINE
           MOVE SPACES                  TO WS-DETAIL-LINE.
           PERFORM  4300-WRITE-REPORT-DETAIL
               THRU 4300-WRITE-REPORT-DETAIL-X.

      *TEXT: TOTAL RECORDS INPUT  =
           MOVE '00003'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  4700-GET-TEXT-DESC
               THRU 4700-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-DF1-TOTAL-TEXT.
           MOVE WS-REC-CNTR-IN          TO WS-DF1-TOTAL-X.

           PERFORM  4300-WRITE-REPORT-DETAIL
               THRU 4300-WRITE-REPORT-DETAIL-X.

      *TEXT: TOTAL RECORDS OUTPUT =
           MOVE '00004'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  4700-GET-TEXT-DESC
               THRU 4700-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-DF1-TOTAL-TEXT.
           MOVE WS-REC-CNTR-OUT         TO WS-DF1-TOTAL-X.

           PERFORM  4300-WRITE-REPORT-DETAIL
               THRU 4300-WRITE-REPORT-DETAIL-X.

      *TEXT: TOTAL ERROR RECORDS  =
           MOVE '00015'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  4700-GET-TEXT-DESC
               THRU 4700-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-DF1-TOTAL-TEXT.
           MOVE WS-ERROR-RECORDS        TO WS-DF1-TOTAL-X.

           PERFORM  4300-WRITE-REPORT-DETAIL
               THRU 4300-WRITE-REPORT-DETAIL-X.

       3600-WRITE-FOOTINGS-X.
           EXIT.
      /
      *----------------------
       4000-INIT-FOR-COMPANY.
      *----------------------

           MOVE SPACES                  TO WHDG-LINE-1.

           PERFORM  0950-0000-INIT-PARM-INFO
               THRU 0950-0000-INIT-PARM-INFO-X.
           PERFORM  0950-1000-GET-COMPANY-NAME
               THRU 0950-1000-GET-COMPANY-NAME-X.

           MOVE L0950-COMPANY-NAME      TO WS-COMPANY-NAME.
           MOVE WS-COMPANY-NAME         TO WHDG-COMPANY-NAME.

           MOVE ZEROS                   TO WS-PAGE-CNTR.
      *
      *  FORCE THE HEADER TO PRINT ON FIRST PAGE
           MOVE 99                      TO WS-LINE-CNTR.

           PERFORM  0290-1000-BUILD-PARM-INFO
               THRU 0290-1000-BUILD-PARM-INFO-X.

       4000-INIT-FOR-COMPANY-X.
           EXIT.
      /
      *---------------------
       4100-INIT-OCF-TITLES.
      *---------------------

           MOVE WS-COMPANY-NAME         TO L0040-COMPANY-NAME.
           MOVE ZERO                    TO L0040-ERROR-CNT.

           MOVE SPACES                  TO WHDG-LINE-2.
           MOVE WPGWS-CRNT-PGM-ID       TO WHDG-PROGRAM-ID.

      *TEXT: LINC PROCESSING EXTRACT - MESSAGES AND CONTROL TOTALS
           MOVE '00009'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  4700-GET-TEXT-DESC
               THRU 4700-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO L0040-PROGRAM-DESC.

      **** GET THE SYSTEM ID FOR THE HEADING
           MOVE 'XS00000145'            TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.
           MOVE WGLOB-MSG-TXT           TO L0040-SYSTEM-ID.
           MOVE WGLOB-MSG-TXT           TO WHDG-SYSTEM-ID.

      **** GET THE DETAIL HEADINGS 'RUN MESSAGES'
           MOVE 'XS00000153'            TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-2000-GET-MESSAGE
               THRU 0260-2000-GET-MESSAGE-X.
           MOVE WGLOB-MSG-TXT           TO L0040-HDG-LINE-3.

           MOVE SPACES                  TO L0040-SBSDRY-CO-NAME.

           PERFORM  0040-1000-INIT-TITLE
               THRU 0040-1000-INIT-TITLE-X.

       4100-INIT-OCF-TITLES-X.
           EXIT.
      /
      *--------------------------
       4200-INIT-DETAIL-HEADINGS.
      *--------------------------

      *  INITIALIZE PARMATERS FOR TEXT RETRIEVAL MODULE
           PERFORM  2490-1000-BUILD-PARM-INFO
               THRU 2490-1000-BUILD-PARM-INFO-X.
M119DM     MOVE 'NSBM9075'              TO L2490-TXT-SRC-ID.

      **** MOVE DATE TO HEADING
           MOVE WGLOB-SYSTEM-DATE-INT   TO L1640-INTERNAL-DATE.
           PERFORM  1640-2000-INTERNAL-TO-EXT
               THRU 1640-2000-INTERNAL-TO-EXT-X.
           MOVE L1640-EXTERNAL-DATE     TO WHDG-DATE.

      **** MOVE TIME TO HEADING
           MOVE WGLOB-SYSTEM-TIME       TO WTIME-EDIT-TIME.
           PERFORM  TIME-1000-REFORMAT
               THRU TIME-1000-REFORMAT-X.
           MOVE WTIME-DISPLAY-TIME      TO WHDG-TIME.

      **** SET UP HEADING CONTANTS - DATE:, TIME:, PAGE NO:
           PERFORM  HDG-1000-INIT-CONSTANTS
               THRU HDG-1000-INIT-CONSTANTS-X.
           PERFORM  HDG-2000-INIT-SBSDRY-CO
               THRU HDG-2000-INIT-SBSDRY-CO-X.

      *TEXT: LINC INTERFACE ERROR AND STATISTICS REPORT
           MOVE '00005'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  4700-GET-TEXT-DESC
               THRU 4700-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-REPORT-TITLE-1.
           MOVE L2490-TXT-STR-TXT       TO WHDG-REPORT-TITLE.

      **** GET REPORT WS-HEADING-1
           MOVE '00006'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  4700-GET-TEXT-DESC
               THRU 4700-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-HEADING-1.

      **** GET REPORT WS-HEADING-2
           MOVE '00007'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  4700-GET-TEXT-DESC
               THRU 4700-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-HEADING-2.

      *TEXT: TOTALS
           MOVE '00008'                 TO WS-TXT-SRC-REF-ID.
           PERFORM  4700-GET-TEXT-DESC
               THRU 4700-GET-TEXT-DESC-X.
           MOVE L2490-TXT-STR-TXT       TO WS-DF1-TOTAL-TEXT.

       4200-INIT-DETAIL-HEADINGS-X.
           EXIT.
      /
      *-------------------------
       4300-WRITE-REPORT-DETAIL.
      *-------------------------

           ADD +1                       TO WS-LINE-CNTR.
           IF  WS-LINE-CNTR > WS-MAX-LINE-CNTR
               PERFORM  3500-WRITE-HEADINGS
                   THRU 3500-WRITE-HEADINGS-X
           END-IF.

           MOVE +1                      TO WPRT1-NUMBER-LINES.
           MOVE WS-DETAIL-LINE          TO RPRT1-SEQ-REC-INFO.
           PERFORM  PRT1-1000-WRITE
               THRU PRT1-1000-WRITE-X.

       4300-WRITE-REPORT-DETAIL-X.
           EXIT.
      /
      *-------------------
       4700-GET-TEXT-DESC.
      *-------------------

           PERFORM  2490-1000-BUILD-PARM-INFO
               THRU 2490-1000-BUILD-PARM-INFO-X.
M119DM     MOVE 'NSBM9075'              TO L2490-TXT-SRC-ID.
           MOVE WS-TXT-SRC-REF-ID       TO L2490-TXT-SRC-REF-ID.
           PERFORM  2490-1000-RETRIEVE-TEXT
               THRU 2490-1000-RETRIEVE-TEXT-X.

       4700-GET-TEXT-DESC-X.
           EXIT.
      /
      *-----------------
       9999-CLOSE-FILES.
      *-----------------

           PERFORM  BCF-4000-CLOSE
               THRU BCF-4000-CLOSE-X.

           PERFORM  PRT1-4000-CLOSE
               THRU PRT1-4000-CLOSE-X.
               
M119DM     PERFORM  9175-4000-CLOSE
M119DM         THRU 9175-4000-CLOSE-X.
M119DM 
M119DM     PERFORM  LCDM-4000-CLOSE
M119DM         THRU LCDM-4000-CLOSE-X.
M119DM*
M119DM*    PERFORM  LNCX-4000-CLOSE
M119DM*        THRU LNCX-4000-CLOSE-X.

           PERFORM  OCF-4000-CLOSE
               THRU OCF-4000-CLOSE-X.

       9999-CLOSE-FILES-X.
           EXIT.
      /
      *****************************************************************
      *    PROCESSING COPYBOOKS                                       *
      *****************************************************************
       COPY CCPPCCC.
      /
       COPY CCPS0010.
      /
       COPY CCPS0950.
      /
       COPY NCPIPRT1.
      /
       COPY NCPPCVGS.
      /
       COPY XCPPHDG.
      /
       COPY XCPPTIME.
      /
NWL002 COPY CCPEPRSM.
NWL002/
      *****************************************************************
      *    LINKAGE PROCESSING COPYBOOKS                               *
      *****************************************************************
P02229 COPY XCPL0035.

       COPY CCPL0010.
       COPY CCPL0950.
      /
       COPY CCPS2430.
       COPY CCPL2430.
      /
       COPY CCPS2435.
       COPY CCPL2435.
      /
       COPY CCPL2440.
      /
B00378 COPY XCPL0015.
       COPY XCPL0040.
       COPY XCPL0260.
       COPY XCPL0290.
       COPY XCPL1640.
       COPY XCPL1680.
       COPY XCPL2490.
      /
       COPY XCPS0290.
       COPY XCPS2490.
UYS001 COPY XCPL1660.       
      /
      *****************************************************************
      *    FILE I/O PROCESS MODULES                                   *
      *****************************************************************
       COPY CCPBCCLI.
M119NB COPY CCPBCWAA.
M119NB/
M119NB COPY CCPNCLI.
M119NB/
       COPY CCPNCVG.
      /
       COPY CCPNPOL.
       COPY NCPBCLUA.
      /
M119DM*COPY NCPALNCX.
M119DM*COPY NCPLLNCX.
M119DM*COPY NCPOLNCX.
      /
P00120 COPY NCPALINC.
P00120 COPY NCPCLINC.
P00036 COPY NCPNLINC.
      /
M119NB COPY NCPULINC.
M119NB/
M119DM*COPY NCPGLTRN.
M119DM*COPY NCPTLTRN.
        
PR006C COPY CCPNPCOM.
 
      /
       COPY XCPLBCF.
       COPY XCPLOCF.
      /
       COPY XCPNBCF.
       COPY XCPOBCF.
       COPY XCPOOCF.
      /
NWL002 COPY NCPNTTAB.
NWL002/
UYS001 COPY CCPBETAB.
M119NB COPY CCPNTRNS.
M119NB/
M119DM COPY XCSLFILE REPLACING ==:ID:==  BY LCDM
M119DM                         ==':PGM:'== BY =='ZSRQLCDM'==.
M119DM COPY XCSOFILE REPLACING ==:ID:==  BY LCDM.
M119DM COPY XCSNSEQ  REPLACING ==:ID:==  BY LCDM.
M119DM/  
M119DM COPY XCSLFILE REPLACING ==:ID:==  BY 9175
M119DM                         ==':PGM:'== BY =='ZSRQ9175'==.
M119DM COPY XCSOFILE REPLACING ==:ID:==  BY 9175.
M119DM COPY XCSASEQ  REPLACING ==:ID:==  BY 9175.
M119DM/
      *****************************************************************
      *    ERROR HANDLING ROUTINES                                    *
      *****************************************************************
       COPY XCPL0030.
      *
      *****************************************************************
      **                 END OF PROGRAM ZSBM9175                     **
      *****************************************************************
